{
    "News": [
        [
            {
                "topic": "f1 Red Bull Racing",
                "topic_news": [
                    [
                        {
                            "title": "Mercedes hints at rethink over Red Bull F1 copy",
                            "article_html": "<div><p><a href=\"https://www.autosport.com/team/mclaren/36473/\" target=\"_blank\" rel=\"noopener\">McLaren</a> has proved to be the surprise of the British Grand Prix weekend as<a href=\"https://www.motorsport.com/f1/news/f1-british-gp-verstappen-on-pole-as-mclaren-drivers-star/10493329/\" target=\"_self\" rel=\"noopener\"> Lando Norris and Oscar Piastri secured second and third on the grid at Silverstone</a> in the updated MCL60 car.</p><p class=\"ms-ap\"></p><p>The dramatic progress that McLaren has made since switching floor and sidepod concepts has raised eyebrows at other teams, as the Woking-based squad has jumped from fighting near the back to becoming one of Red Bull&#8217;s main challengers in terms of single-lap pace.</p>\n<p><a href=\"https://www.autosport.com/driver/lewis-hamilton/829181/\" target=\"_blank\" rel=\"noopener\">Lewis Hamilton</a> declared that the way that McLaren had made such a move with a Red Bull lookalike <a href=\"https://www.motorsport.com/f1/news/hamilton-red-bull-lookalike-mclaren-an-f1-wake-up-call-for-mercedes/10493445/\" target=\"_self\" rel=\"noopener\">was a &#8220;wake-up call&#8221; for his own Mercedes squad</a> as it battles to close the gap to the front.</p>\n<p>Team boss Toto Wolff has admitted that McLaren's progress should serve as food for thought for his engineers in it potentially needing to reevaluate going further down the Red Bull style route with the W14.</p>\n<p>&#8220;I think from what you see from the outside, which is obviously only half the information, it is that the [McLaren] car looks like a Red Bull,&#8221; said Wolff.</p>\n<p>&#8220;As a matter of fact, and to be honest, it doesn&#8217;t matter though &#8211; because only the stopwatch counts. And this is what I guess Lewis was referring too, that this kind of design seems to be a good direction.</p><p class=\"ms-ap\"></p><p>&#8220;It&#8217;s easier said than done though. Each of us had bodywork that looked like the Red Bull in the tunnel, and it didn&#8217;t come up in performance.</p>\n<p>&#8220;But we&#8217;ve got to leave no stone unturned and maybe look at it again because another team just found a second in performance.&#8221;</p>\n   <img src=\"//cdn-2.motorsport.com/images/mgl/YBeDPPn2/s1000/toto-wolff-team-principal-and--1.jpg\" alt=\"Toto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock\"> \n<p class=\"title\">Toto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock</p>\n<p class=\"photographer\">Photo by: Mark Sutton / <a href=\"https://www.motorsportimages.com\" target=\"_blank\" rel=\"noopener\">Motorsport Images</a></p>\n<p>Wolff said that some deep analysis was needed about how the fight behind Red Bull was playing out, as the form of <a href=\"https://www.autosport.com/team/ferrari/36466/\" target=\"_blank\" rel=\"noopener\">Ferrari</a>, <a href=\"https://www.autosport.com/team/mercedes/36495/\" target=\"_blank\" rel=\"noopener\">Mercedes</a>, Aston Martin and McLaren keeps switching around so much.</p>\n<p>&#8220;It is quite weird how that fluctuates &#8211; because you would have said for a long time into the season that Aston Martin was second before us,&#8221; he explained.</p>\n<p>&#8220;Probably they were our biggest competitor, obviously with Ferrari, and then suddenly you have McLaren in the mix in Austria.</p><p class=\"ms-ap\"></p><p>&#8220;Clearly, one car had the upgrade, and he was very fast, here both cars have the upgrade and they are second and third on the grid. So, absolutely, it seems like they have made a massive step in understanding and performance.&#8221;</p>\n<p>Wolff said there was no doubt that Mercedes needs to find further gains with its car but reckoned that the way that Aston Martin and McLaren had made such big inroads for 2023 was proof that dramatic progress could still be made.</p>\n<p>&#8220;I think it&#8217;s very encouraging to see that Aston Martin found massive chunks of lap times from last year to this year, and in the same way you see within the season McLaren doing that,&#8221; he said.</p>\n<p>&#8220;That is something that you need to take your hat off [to] if we see that consolidating. Certainly, for us, it was a good example of how you can turn things around.&#8221;</p>\n    \n    <p id=\"ms-piano_article-prebanner\" class=\"ms-display-contents\"></p>\n\n    \n    <p class=\"ms-entity-detail-header_views\">\n                \n                    \n                \n                <p class=\"ms-entity-detail-header_views-value\"></p>\n            </p>\n        <p class=\"ms-share_inline \"></p>\n            \n            \n            <p class=\"ms-entity-detail-header_shares\">\n                <p class=\"ms-entity-detail-header_shares_value\"></p>\n                <p class=\"ms-entity-detail-header_shares_label\">shares</p>\n            </p>\n                         \n                    </div>",
                            "text": "McLaren has proved to be the surprise of the British Grand Prix weekend as Lando Norris and Oscar Piastri secured second and third on the grid at Silverstone in the updated MCL60 car.\n\nThe dramatic progress that McLaren has made since switching floor and sidepod concepts has raised eyebrows at other teams, as the Woking-based squad has jumped from fighting near the back to becoming one of Red Bull’s main challengers in terms of single-lap pace.\n\nLewis Hamilton declared that the way that McLaren had made such a move with a Red Bull lookalike was a “wake-up call” for his own Mercedes squad as it battles to close the gap to the front.\n\nTeam boss Toto Wolff has admitted that McLaren's progress should serve as food for thought for his engineers in it potentially needing to reevaluate going further down the Red Bull style route with the W14.\n\n“I think from what you see from the outside, which is obviously only half the information, it is that the [McLaren] car looks like a Red Bull,” said Wolff.\n\n“As a matter of fact, and to be honest, it doesn’t matter though – because only the stopwatch counts. And this is what I guess Lewis was referring too, that this kind of design seems to be a good direction.\n\n“It’s easier said than done though. Each of us had bodywork that looked like the Red Bull in the tunnel, and it didn’t come up in performance.\n\n“But we’ve got to leave no stone unturned and maybe look at it again because another team just found a second in performance.”\n\nToto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock Photo by: Mark Sutton / Motorsport Images\n\nWolff said that some deep analysis was needed about how the fight behind Red Bull was playing out, as the form of Ferrari, Mercedes, Aston Martin and McLaren keeps switching around so much.\n\n“It is quite weird how that fluctuates – because you would have said for a long time into the season that Aston Martin was second before us,” he explained.\n\n“Probably they were our biggest competitor, obviously with Ferrari, and then suddenly you have McLaren in the mix in Austria.\n\n“Clearly, one car had the upgrade, and he was very fast, here both cars have the upgrade and they are second and third on the grid. So, absolutely, it seems like they have made a massive step in understanding and performance.”\n\nWolff said there was no doubt that Mercedes needs to find further gains with its car but reckoned that the way that Aston Martin and McLaren had made such big inroads for 2023 was proof that dramatic progress could still be made.\n\n“I think it’s very encouraging to see that Aston Martin found massive chunks of lap times from last year to this year, and in the same way you see within the season McLaren doing that,” he said.\n\n“That is something that you need to take your hat off [to] if we see that consolidating. Certainly, for us, it was a good example of how you can turn things around.”",
                            "top_image": "https://cdn-8.motorsport.com/images/amp/YpN1yGg0/s6/max-verstappen-red-bull-racing.jpg",
                            "keywords": [],
                            "publish_date": 1688917639,
                            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vdXMubW90b3JzcG9ydC5jb20vZjEvbmV3cy9tZXJjZWRlcy1oaW50cy1hdC1yZXRoaW5rLW92ZXItcmVkLWJ1bGwtZjEtY29weS8xMDQ5MzY0Mi_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "F1 LIVE: Start grid changed as driver disqualified, Verstappen goes in on Perez",
                            "article_html": "<div><p>Toto Wolff hinted at Mercedes taking a leaf out of Red Bull's book after Max Verstappen took pole</p><p>It was another eventful day in the world of F1 as Max Verstappen claimed pole at the British Grand Prix ahead of Lando Norris at his home circuit, while Oscar Piastri took third on a brilliant day for McLaren. However, there was more disappointment for Verstappen's Red Bull team-mate Sergio Perez.</p><p>Perez endured another awful qualifying session, having been knocked out in Q1 much to the frustration of Red Bull and following Saturday's action, Verstappen made his feelings very clear on his team-mate's performance.</p><p id=\"div-gpt-ad-vip\"></p><p>Meanwhile after seeing Red Bull notch up another pole position, Toto Wolff has hinted at taking a leaf out of Red Bull's book as Mercedes look to cut the deficit between the two constructor giants following a tough time of late.</p><p>You can find out the latest news from the F1 world with Express Sport's blog right below as the British Grand Prix takes centre stage today...</p><p id=\"ovp-primis\">     </p></div>",
                            "text": "Toto Wolff hinted at Mercedes taking a leaf out of Red Bull's book after Max Verstappen took pole\n\nIt was another eventful day in the world of F1 as Max Verstappen claimed pole at the British Grand Prix ahead of Lando Norris at his home circuit, while Oscar Piastri took third on a brilliant day for McLaren. However, there was more disappointment for Verstappen's Red Bull team-mate Sergio Perez.\n\nPerez endured another awful qualifying session, having been knocked out in Q1 much to the frustration of Red Bull and following Saturday's action, Verstappen made his feelings very clear on his team-mate's performance.\n\nMeanwhile after seeing Red Bull notch up another pole position, Toto Wolff has hinted at taking a leaf out of Red Bull's book as Mercedes look to cut the deficit between the two constructor giants following a tough time of late.\n\nYou can find out the latest news from the F1 world with Express Sport's blog right below as the British Grand Prix takes centre stage today...",
                            "top_image": "https://cdn.images.express.co.uk/img/dynamic/73/1200x712/4846012.jpg?r=1688910936386",
                            "keywords": [],
                            "publish_date": 1688917640,
                            "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvc3BvcnQvZjEtYXV0b3Nwb3J0LzE3ODkwNDUvRjEtTElWRS1NYXgtVmVyc3RhcHBlbi1Ub3RvLVdvbGZmLUxld2lzLUhhbWlsdG9uLUJyaXRpc2gtR3JhbmQtUHJpeNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "‘You never stop learning’: Pedals, the engineer driving Red Bull’s speed",
                            "article_html": "<div><p class=\"dcr-1i69m5j\">Still on course for an unprecedented clean sweep of wins in the 2023 Formula One season, Red Bull go into this weekend&#8217;s <a href=\"https://www.theguardian.com/sport/british-grand-prix\">British Grand Prix</a> already champions elect.</p><p class=\"dcr-1i69m5j\">Such has been their <a href=\"https://www.theguardian.com/sport/2023/jul/03/red-bull-at-highest-level-in-their-history-after-verstappen-run-horner-claims\">dominance this season</a>, Silverstone too will surely fall. While romantics rightly yearn for an upset, an unlikely blow to the flank of a charging beast, the brutal reality is the Bulls are rampant, the best team on the grid on every level this season.</p><p id=\"sign-in-gate\"></p><p class=\"dcr-1i69m5j\"><a href=\"https://www.theguardian.com/sport/2023/jul/02/red-bulls-max-verstappen-eases-to-victory-in-austrian-f1-grand-prix\">Nine races in and with nine wins</a>, some consider Red Bull have had it easy, their car and driver combination with <a href=\"https://www.theguardian.com/sport/2023/jun/19/christian-horner-hails-max-verstappen-as-one-of-the-greats-of-formula-one\">world champion Max Verstappen in commanding form</a> affording them a cruise to both drivers&#8217; and constructors&#8217; titles. Yet this is an uncharitable interpretation for a team that have earned their advantage and are focused on maintaining it with steely determination.</p><p class=\"dcr-1i69m5j\">Key to their effort but largely unrecognised is a man who has spent more than 30 years in F1 and has been with <a href=\"https://www.theguardian.com/sport/red-bull\">Red Bull</a> since 2006, an integral part of maximising their performance, especially over a race weekend. Paul Monaghan&#8217;s title might be rather clunky as &#8220;chief engineer, car engineering&#8221; but his mind is razor sharp and he is adamant the team have no intention of letting their lead slip away.</p><p class=\"dcr-1i69m5j\">&#8220;There is no complacency,&#8221; he says. &#8220;If we were to back off now I would not say the 2023 championship is a done deal. It wouldn&#8217;t take the others long to catch us. But our personal motivation, pride and dedication would not let it happen. There won&#8217;t be a let up because we keep pushing ourselves.&#8221;</p><p class=\"dcr-1i69m5j\">Monaghan might well epitomise why Red Bull have been so successful this season in taking their two titles from 2022 and turning them into an all-conquering behemoth.</p><p class=\"dcr-1i69m5j\">The 55-year-old is calm professionalism personified albeit under the light-hearted nickname by which he is universally known in the paddock: &#8220;Pedals&#8221;. On a race weekend he is instrumental as chief engineer, a calm and phlegmatic troubleshooter dealing with the intensity and pressure of adapting to key moments as the weekend develops.</p><p class=\"dcr-1i69m5j\">He oversees the race engineers who work closely with the drivers to ensure the cars are at their best on every track, a task Red Bull have achieved with overwhelming success this season.</p><p class=\"dcr-1i69m5j\">Pedals is softly spoken and thoughtful, with an endearing, self-deprecating wit. One can see why he has proven to be such a successful people-person in the intensely cooperative atmosphere of an F1 team. He does not often speak to the media but, sitting in the Red Bull motorhome, is entirely comfortable when asked to assess why they are in such rare form.</p><p class=\"dcr-1i69m5j\">&#8220;Without wanting to sound flippant, dismissive or arrogant, it&#8217;s not been easy for us,&#8221; he says. &#8220;Because getting the most out of this car each weekend requires a lot of effort from a lot of very clever people.</p><p class=\"dcr-1i69m5j\">&#8220;If there is an assumption that this is an easy car to operate, it is anything but. The fact that the team have levels of trust and belief in all the individual departments, that those group efforts will merge together to make a bloody good car, is indicative of a very healthy team. We are not in-fighting, the gears are in mesh.&#8221;</p><p class=\"dcr-1i69m5j\">Hugely respected in the paddock, Pedals is no spin doctor, no team principal playing the game. There is a sense that anything but a straightforward, honest consideration would sit uncomfortably with a man who has had a long career against which to measure Red Bull&#8217;s current performance.</p><img alt=\"Adrian Newey, the chief technical officer of Red Bull Racing, and head of car engineering Paul Monaghan celebrate winning the F1 World Constructors Championship.\" src=\"https://i.guim.co.uk/img/media/2dbb8f98db5c06eaea39f6099ef56706a7483e13/0_388_6192_3715/master/6192.jpg?width=445&amp;dpr=1&amp;s=none\" width=\"445\" height=\"445\" class=\"dcr-evn1e9\"><p class=\"dcr-17eagbs\"></p><p class=\"dcr-flw1bz\">Paul Monaghan (centre) celebrates winning the constructors&#8217; championship with Red Bull last season.</p> Photograph: Clive Mason/Formula 1/Getty Images<p class=\"dcr-1i69m5j\">He picked up the Pedals nickname in his first F1 job in the design office at McLaren in 1990, repeatedly having to draw the pedal configuration for Gerhard Berger, a tall driver who was tricky to accommodate in the car. He did so many drawings that the name stuck.</p><p class=\"dcr-1i69m5j\">Seven years followed in the design office before becoming trackside data engineer for David Coulthard, then a move to Benetton in 2000 where, as the team became Renault, he took on the new role as race engineer to two drivers who would become world champions, first Jenson Button, then Fernando Alonso.</p><a href=\"#EmailSignup-skip-link-16\" class=\"dcr-15r7368\">skip past newsletter promotion</a><p class=\"dcr-12h1z29\">Sign up to The Recap</p><p class=\"dcr-1hwoqtr\"></p><p class=\"dcr-17iw3o2\">Free weekly newsletter</p><p class=\"dcr-1613jw2\">The best of our sports journalism from the past seven days and a heads-up on the weekend&#8217;s action</p><p class=\"dcr-jh8d37\"></p><span class=\"dcr-1u9nobt\"><strong>Privacy Notice: </strong>Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our <a></a><a></a><a></a><p>Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our <a href=\"https://www.theguardian.com/help/privacy-policy\" rel=\"noreferrer\" class=\"dcr-1895p0o\">Privacy Policy</a> . We use Google reCaptcha to protect our website and the Google <a href=\"https://policies.google.com/privacy\" rel=\"noreferrer\" class=\"dcr-1895p0o\">Privacy Policy</a> and <a href=\"https://policies.google.com/terms\" rel=\"noreferrer\" class=\"dcr-1895p0o\">Terms of Service</a> apply.</p></span><p id=\"EmailSignup-skip-link-16\" tabindex=\"0\" class=\"dcr-15r7368\">after newsletter promotion</p><p class=\"dcr-1i69m5j\">A short spell with the ill-fated Midland followed in 2005 at the end of which Red Bull headhunted him for their then nascent outfit. He has been with them since, through the titles of 2010-2013 and the years of Mercedes domination. He has seen every side of F1 and his judgment is sincere and invaluable.</p><p class=\"dcr-1i69m5j\">Yet the elephant in the room remains. It is just the car, isn&#8217;t it? The team are coasting, are they not? He smiles and considers it again. &#8220;Listen to the radio messages from Monaco,&#8221; he says. &#8220;Max said on Friday morning: &#8216;I am coming in, I am going to shunt if I carry on like this.&#8217; I don&#8217;t think it was even a raceable car at that point. So we changed it.</p><p class=\"dcr-1i69m5j\">&#8220;It&#8217;s race engineer, driver and the research tools at the factory. A team effort. It was nice to see us face that situation and there was no in-fighting, there was a discussion, it went in the right direction and when put it in the sweet spot, each practice was better, qualifying was acceptable, and the race was wonderful.&#8221;</p><p class=\"dcr-1i69m5j\">After an &#8220;acceptable&#8221; qualifying Verstappen took pole and then went on to win on a track that was least suited of all the races this season to the strengths of the Red Bull. An indication that their car was formidably potent but also that the team were able to adapt and react with skill and cohesion.</p><p class=\"dcr-1i69m5j\">For Pedals it was a further spur. &#8220;There was a combination of relief and pride. You take pride in it but the best thing we do is learn from it,&#8221; he says. It is a repeated refrain from a man who has been in the game his entire life but still takes nothing for granted, including this weekend at Silverstone, a home race for the team from Milton Keynes and a track very much suited to the Red Bull.</p><p class=\"dcr-1i69m5j\">&#8220;You never stop learning,&#8221; he says. &#8220;The car is evolving this weekend, every weekend. The great thing is they are prototypes, they are allowed to change and that&#8217;s what changes your competitive position. We are there to be shot at but we are here to try and protect our position, our competitive stance and we will do everything within our freedom to do so.&#8221;</p><p class=\"dcr-1i69m5j\">What about that never-before achieved clean sweep? Can it be done? Pedals smiles. As an engineer he does not want to be drawn into imponderables he cannot control but nonetheless he acknowledges it is within their compass.</p><p class=\"dcr-1i69m5j\">&#8220;Of course it is possible,&#8221; he says. &#8220;Each race is a new set of challenges, so be ready, be prepared, be thorough and let&#8217;s see where we finish. Sunday night in Abu Dhabi, you can ask me.&#8221;</p></div>",
                            "text": "Still on course for an unprecedented clean sweep of wins in the 2023 Formula One season, Red Bull go into this weekend’s British Grand Prix already champions elect.\n\nSuch has been their dominance this season, Silverstone too will surely fall. While romantics rightly yearn for an upset, an unlikely blow to the flank of a charging beast, the brutal reality is the Bulls are rampant, the best team on the grid on every level this season.\n\nNine races in and with nine wins, some consider Red Bull have had it easy, their car and driver combination with world champion Max Verstappen in commanding form affording them a cruise to both drivers’ and constructors’ titles. Yet this is an uncharitable interpretation for a team that have earned their advantage and are focused on maintaining it with steely determination.\n\nKey to their effort but largely unrecognised is a man who has spent more than 30 years in F1 and has been with Red Bull since 2006, an integral part of maximising their performance, especially over a race weekend. Paul Monaghan’s title might be rather clunky as “chief engineer, car engineering” but his mind is razor sharp and he is adamant the team have no intention of letting their lead slip away.\n\n“There is no complacency,” he says. “If we were to back off now I would not say the 2023 championship is a done deal. It wouldn’t take the others long to catch us. But our personal motivation, pride and dedication would not let it happen. There won’t be a let up because we keep pushing ourselves.”\n\nMonaghan might well epitomise why Red Bull have been so successful this season in taking their two titles from 2022 and turning them into an all-conquering behemoth.\n\nThe 55-year-old is calm professionalism personified albeit under the light-hearted nickname by which he is universally known in the paddock: “Pedals”. On a race weekend he is instrumental as chief engineer, a calm and phlegmatic troubleshooter dealing with the intensity and pressure of adapting to key moments as the weekend develops.\n\nHe oversees the race engineers who work closely with the drivers to ensure the cars are at their best on every track, a task Red Bull have achieved with overwhelming success this season.\n\nPedals is softly spoken and thoughtful, with an endearing, self-deprecating wit. One can see why he has proven to be such a successful people-person in the intensely cooperative atmosphere of an F1 team. He does not often speak to the media but, sitting in the Red Bull motorhome, is entirely comfortable when asked to assess why they are in such rare form.\n\n“Without wanting to sound flippant, dismissive or arrogant, it’s not been easy for us,” he says. “Because getting the most out of this car each weekend requires a lot of effort from a lot of very clever people.\n\n“If there is an assumption that this is an easy car to operate, it is anything but. The fact that the team have levels of trust and belief in all the individual departments, that those group efforts will merge together to make a bloody good car, is indicative of a very healthy team. We are not in-fighting, the gears are in mesh.”\n\nHugely respected in the paddock, Pedals is no spin doctor, no team principal playing the game. There is a sense that anything but a straightforward, honest consideration would sit uncomfortably with a man who has had a long career against which to measure Red Bull’s current performance.\n\nPaul Monaghan (centre) celebrates winning the constructors’ championship with Red Bull last season. Photograph: Clive Mason/Formula 1/Getty Images\n\nHe picked up the Pedals nickname in his first F1 job in the design office at McLaren in 1990, repeatedly having to draw the pedal configuration for Gerhard Berger, a tall driver who was tricky to accommodate in the car. He did so many drawings that the name stuck.\n\nSeven years followed in the design office before becoming trackside data engineer for David Coulthard, then a move to Benetton in 2000 where, as the team became Renault, he took on the new role as race engineer to two drivers who would become world champions, first Jenson Button, then Fernando Alonso.\n\nskip past newsletter promotion Sign up to The Recap Free weekly newsletter The best of our sports journalism from the past seven days and a heads-up on the weekend’s action Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nA short spell with the ill-fated Midland followed in 2005 at the end of which Red Bull headhunted him for their then nascent outfit. He has been with them since, through the titles of 2010-2013 and the years of Mercedes domination. He has seen every side of F1 and his judgment is sincere and invaluable.\n\nYet the elephant in the room remains. It is just the car, isn’t it? The team are coasting, are they not? He smiles and considers it again. “Listen to the radio messages from Monaco,” he says. “Max said on Friday morning: ‘I am coming in, I am going to shunt if I carry on like this.’ I don’t think it was even a raceable car at that point. So we changed it.\n\n“It’s race engineer, driver and the research tools at the factory. A team effort. It was nice to see us face that situation and there was no in-fighting, there was a discussion, it went in the right direction and when put it in the sweet spot, each practice was better, qualifying was acceptable, and the race was wonderful.”\n\nAfter an “acceptable” qualifying Verstappen took pole and then went on to win on a track that was least suited of all the races this season to the strengths of the Red Bull. An indication that their car was formidably potent but also that the team were able to adapt and react with skill and cohesion.\n\nFor Pedals it was a further spur. “There was a combination of relief and pride. You take pride in it but the best thing we do is learn from it,” he says. It is a repeated refrain from a man who has been in the game his entire life but still takes nothing for granted, including this weekend at Silverstone, a home race for the team from Milton Keynes and a track very much suited to the Red Bull.\n\n“You never stop learning,” he says. “The car is evolving this weekend, every weekend. The great thing is they are prototypes, they are allowed to change and that’s what changes your competitive position. We are there to be shot at but we are here to try and protect our position, our competitive stance and we will do everything within our freedom to do so.”\n\nWhat about that never-before achieved clean sweep? Can it be done? Pedals smiles. As an engineer he does not want to be drawn into imponderables he cannot control but nonetheless he acknowledges it is within their compass.\n\n“Of course it is possible,” he says. “Each race is a new set of challenges, so be ready, be prepared, be thorough and let’s see where we finish. Sunday night in Abu Dhabi, you can ask me.”",
                            "top_image": "https://i.guim.co.uk/img/media/fded5eb669c3e476293a31725b2c35bcd004fc92/0_309_5287_3172/master/5287.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4979ce3a90e7fdbf019edc71e94c8bf4",
                            "keywords": [],
                            "publish_date": 1688727331,
                            "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9zcG9ydC8yMDIzL2p1bC8wNy9mb3JtdWxhLW9uZS1mMS1yZWQtYnVsbC1pbnRlcnZpZXctcGVkYWxzLWNoaWVmLWVuZ2luZWVy0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "McLaren: Improved performance not as simple as just copying Red Bull",
                            "article_html": "<div><p>McLaren says any inspiration it has taken from Red Bull's Formula One car to shape its latest upgrade package only tells part of the story about its step forward in performance at the last two races.</p><p>After a disappointing start to the year, McLaren appeared to make step forward at last weekend's Austrian Grand Prix when it introduced a significant upgrade to Lando Norris' car.</p><p>That upgrade is now on both cars at the British Grand Prix, and Norris and teammate Oscar Piastri benefitted from the improved performance to qualify second and third for Sunday's race.</p><p>After Saturday's session, Lewis Hamilton, who qualified seventh, pointed out similarities between McLaren's upgraded bodywork and the championship-leading Red Bull.</p><p>While team principal Andrea Stella said McLaren's design office had taken inspiration from Red Bull, he stressed that it was not as simple as just copying the fastest car.</p><p>\"Every team takes inspiration from any other team,\" Stella said. \"Teams are equipped to try and absorb IP from looking at the photos, from looking at the cars on display [in the pit lane] on Friday.</p><p>\"So you do take inspiration from the other cars, but taking inspiration or even looking at the photo doesn't mean that you copy the geometry, you don't install it in your CFD run it in the computer simulation or in the wind tunnel, and the car lights up in terms of downforce.</p><p>\"Normally what happens is the performance goes down, because your car is already optimised around what you have done up until that point. Somehow, the key element is understanding that some concepts have more potential that will allow you to develop faster and for longer.</p><p>\"And here is where you need to have the right people at the right place. And I think I would like to mention one name here. Peter Prodromou is leading the aerodynamic development at McLaren and is doing an exceptional job in terms of setting the conceptual direction but also having organised and having inspired the entire aerodynamic group so really well done to Peter.\"</p><p>Stella said the opportunity to view the underside of Sergio Perez's Red Bull when the Mexican's car was lifted off the circuit by a crane at Monaco had shown McLaren that there was still potential for further development of its own floor.</p><img class=\" lazyload lazyload\" height=\"320\" width=\"570\">Jon Hobley/MI News/NurPhoto via Getty Images<p>\"The reality is that when you look, for instance, at the floor of Red Bull in Monaco, you'll see that there's another step,\" he said. \"So there's, again, even in this area we work to do.</p><p class=\"ad-slot ad-slot-incontent2 ad-wrapper\"></p><p>\"The good thing is that the aerodynamic department and in general, the engineers at McLaren have kind of accelerated this development. And now we are finding directions and we are finding performance quicker, than we were in condition to do before.\"</p><p>Asked how much the photos of the Red Bull in Monaco had influenced the latest upgrades, Stella added: \"I'm sure all teams got inspiration from looking at the Red Bull car, like they get inspiration from all the photos that all teams get off any other car.</p><p>\"Pretty much all teams have, they have professional photographers that take as much opportunity as possible. And this is inspiration, you know.</p><p>\"But I would detract off our aerodynamic department if I said, 'oh, yeah, we saw that and now we have the solution'.</p><p>\"You see that and you get some maybe-you-can-do-this, but then you have to do your own job and your own iteration, otherwise you don't get to something that actually works.\"</p>\n</div>",
                            "text": "McLaren says any inspiration it has taken from Red Bull's Formula One car to shape its latest upgrade package only tells part of the story about its step forward in performance at the last two races.\n\nAfter a disappointing start to the year, McLaren appeared to make step forward at last weekend's Austrian Grand Prix when it introduced a significant upgrade to Lando Norris' car.\n\nThat upgrade is now on both cars at the British Grand Prix, and Norris and teammate Oscar Piastri benefitted from the improved performance to qualify second and third for Sunday's race.\n\nAfter Saturday's session, Lewis Hamilton, who qualified seventh, pointed out similarities between McLaren's upgraded bodywork and the championship-leading Red Bull.\n\nWhile team principal Andrea Stella said McLaren's design office had taken inspiration from Red Bull, he stressed that it was not as simple as just copying the fastest car.\n\n\"Every team takes inspiration from any other team,\" Stella said. \"Teams are equipped to try and absorb IP from looking at the photos, from looking at the cars on display [in the pit lane] on Friday.\n\n\"So you do take inspiration from the other cars, but taking inspiration or even looking at the photo doesn't mean that you copy the geometry, you don't install it in your CFD run it in the computer simulation or in the wind tunnel, and the car lights up in terms of downforce.\n\n\"Normally what happens is the performance goes down, because your car is already optimised around what you have done up until that point. Somehow, the key element is understanding that some concepts have more potential that will allow you to develop faster and for longer.\n\n\"And here is where you need to have the right people at the right place. And I think I would like to mention one name here. Peter Prodromou is leading the aerodynamic development at McLaren and is doing an exceptional job in terms of setting the conceptual direction but also having organised and having inspired the entire aerodynamic group so really well done to Peter.\"\n\nStella said the opportunity to view the underside of Sergio Perez's Red Bull when the Mexican's car was lifted off the circuit by a crane at Monaco had shown McLaren that there was still potential for further development of its own floor.\n\nJon Hobley/MI News/NurPhoto via Getty Images\n\n\"The reality is that when you look, for instance, at the floor of Red Bull in Monaco, you'll see that there's another step,\" he said. \"So there's, again, even in this area we work to do.\n\n\"The good thing is that the aerodynamic department and in general, the engineers at McLaren have kind of accelerated this development. And now we are finding directions and we are finding performance quicker, than we were in condition to do before.\"\n\nAsked how much the photos of the Red Bull in Monaco had influenced the latest upgrades, Stella added: \"I'm sure all teams got inspiration from looking at the Red Bull car, like they get inspiration from all the photos that all teams get off any other car.\n\n\"Pretty much all teams have, they have professional photographers that take as much opportunity as possible. And this is inspiration, you know.\n\n\"But I would detract off our aerodynamic department if I said, 'oh, yeah, we saw that and now we have the solution'.\n\n\"You see that and you get some maybe-you-can-do-this, but then you have to do your own job and your own iteration, otherwise you don't get to something that actually works.\"",
                            "top_image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F0709%2Fr1195757_1296x729_16%2D9.jpg",
                            "keywords": [],
                            "publish_date": 1688917642,
                            "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmVzcG4uY29tL2YxL3N0b3J5L18vaWQvMzc5ODMyNDgvbWNsYXJlbi1pbXByb3ZlZC1wZXJmb3JtYW5jZS1ub3Qtc2ltcGxlLWp1c3QtY29weWluZy1yZWQtYnVsbNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "",
                            "article_html": "",
                            "text": "",
                            "top_image": "",
                            "keywords": [],
                            "publish_date": 1688917643,
                            "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LnNpLmNvbS9mYW5uYXRpb24vcmFjaW5nL2YxYnJpZWZpbmdzL25ld3MvZjEtbmV3cy1yZWQtYnVsbC10by1yZWxlYXNlLWJpZy11cGdyYWRlcy13aXRoLWRvbWluYW5jZS10by1pbmNyZWFzZdIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        }
                    ]
                ]
            },
            {
                "topic": "f1 Mercedes",
                "topic_news": [
                    [
                        {
                            "title": "Mercedes hints at rethink over Red Bull F1 copy",
                            "article_html": "<div><p><a href=\"https://www.autosport.com/team/mclaren/36473/\" target=\"_blank\" rel=\"noopener\">McLaren</a> has proved to be the surprise of the British Grand Prix weekend as<a href=\"https://www.motorsport.com/f1/news/f1-british-gp-verstappen-on-pole-as-mclaren-drivers-star/10493329/\" target=\"_self\" rel=\"noopener\"> Lando Norris and Oscar Piastri secured second and third on the grid at Silverstone</a> in the updated MCL60 car.</p><p class=\"ms-ap\"></p><p>The dramatic progress that McLaren has made since switching floor and sidepod concepts has raised eyebrows at other teams, as the Woking-based squad has jumped from fighting near the back to becoming one of Red Bull&#8217;s main challengers in terms of single-lap pace.</p>\n<p><a href=\"https://www.autosport.com/driver/lewis-hamilton/829181/\" target=\"_blank\" rel=\"noopener\">Lewis Hamilton</a> declared that the way that McLaren had made such a move with a Red Bull lookalike <a href=\"https://www.motorsport.com/f1/news/hamilton-red-bull-lookalike-mclaren-an-f1-wake-up-call-for-mercedes/10493445/\" target=\"_self\" rel=\"noopener\">was a &#8220;wake-up call&#8221; for his own Mercedes squad</a> as it battles to close the gap to the front.</p>\n<p>Team boss Toto Wolff has admitted that McLaren's progress should serve as food for thought for his engineers in it potentially needing to reevaluate going further down the Red Bull style route with the W14.</p>\n<p>&#8220;I think from what you see from the outside, which is obviously only half the information, it is that the [McLaren] car looks like a Red Bull,&#8221; said Wolff.</p>\n<p>&#8220;As a matter of fact, and to be honest, it doesn&#8217;t matter though &#8211; because only the stopwatch counts. And this is what I guess Lewis was referring too, that this kind of design seems to be a good direction.</p><p class=\"ms-ap\"></p><p>&#8220;It&#8217;s easier said than done though. Each of us had bodywork that looked like the Red Bull in the tunnel, and it didn&#8217;t come up in performance.</p>\n<p>&#8220;But we&#8217;ve got to leave no stone unturned and maybe look at it again because another team just found a second in performance.&#8221;</p>\n   <img src=\"//cdn-2.motorsport.com/images/mgl/YBeDPPn2/s1000/toto-wolff-team-principal-and--1.jpg\" alt=\"Toto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock\"> \n<p class=\"title\">Toto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock</p>\n<p class=\"photographer\">Photo by: Mark Sutton / <a href=\"https://www.motorsportimages.com\" target=\"_blank\" rel=\"noopener\">Motorsport Images</a></p>\n<p>Wolff said that some deep analysis was needed about how the fight behind Red Bull was playing out, as the form of <a href=\"https://www.autosport.com/team/ferrari/36466/\" target=\"_blank\" rel=\"noopener\">Ferrari</a>, <a href=\"https://www.autosport.com/team/mercedes/36495/\" target=\"_blank\" rel=\"noopener\">Mercedes</a>, Aston Martin and McLaren keeps switching around so much.</p>\n<p>&#8220;It is quite weird how that fluctuates &#8211; because you would have said for a long time into the season that Aston Martin was second before us,&#8221; he explained.</p>\n<p>&#8220;Probably they were our biggest competitor, obviously with Ferrari, and then suddenly you have McLaren in the mix in Austria.</p><p class=\"ms-ap\"></p><p>&#8220;Clearly, one car had the upgrade, and he was very fast, here both cars have the upgrade and they are second and third on the grid. So, absolutely, it seems like they have made a massive step in understanding and performance.&#8221;</p>\n<p>Wolff said there was no doubt that Mercedes needs to find further gains with its car but reckoned that the way that Aston Martin and McLaren had made such big inroads for 2023 was proof that dramatic progress could still be made.</p>\n<p>&#8220;I think it&#8217;s very encouraging to see that Aston Martin found massive chunks of lap times from last year to this year, and in the same way you see within the season McLaren doing that,&#8221; he said.</p>\n<p>&#8220;That is something that you need to take your hat off [to] if we see that consolidating. Certainly, for us, it was a good example of how you can turn things around.&#8221;</p>\n    \n    <p id=\"ms-piano_article-prebanner\" class=\"ms-display-contents\"></p>\n\n    \n    <p class=\"ms-entity-detail-header_views\">\n                \n                    \n                \n                <p class=\"ms-entity-detail-header_views-value\"></p>\n            </p>\n        <p class=\"ms-share_inline \"></p>\n            \n            \n            <p class=\"ms-entity-detail-header_shares\">\n                <p class=\"ms-entity-detail-header_shares_value\"></p>\n                <p class=\"ms-entity-detail-header_shares_label\">shares</p>\n            </p>\n                         \n                    </div>",
                            "text": "McLaren has proved to be the surprise of the British Grand Prix weekend as Lando Norris and Oscar Piastri secured second and third on the grid at Silverstone in the updated MCL60 car.\n\nThe dramatic progress that McLaren has made since switching floor and sidepod concepts has raised eyebrows at other teams, as the Woking-based squad has jumped from fighting near the back to becoming one of Red Bull’s main challengers in terms of single-lap pace.\n\nLewis Hamilton declared that the way that McLaren had made such a move with a Red Bull lookalike was a “wake-up call” for his own Mercedes squad as it battles to close the gap to the front.\n\nTeam boss Toto Wolff has admitted that McLaren's progress should serve as food for thought for his engineers in it potentially needing to reevaluate going further down the Red Bull style route with the W14.\n\n“I think from what you see from the outside, which is obviously only half the information, it is that the [McLaren] car looks like a Red Bull,” said Wolff.\n\n“As a matter of fact, and to be honest, it doesn’t matter though – because only the stopwatch counts. And this is what I guess Lewis was referring too, that this kind of design seems to be a good direction.\n\n“It’s easier said than done though. Each of us had bodywork that looked like the Red Bull in the tunnel, and it didn’t come up in performance.\n\n“But we’ve got to leave no stone unturned and maybe look at it again because another team just found a second in performance.”\n\nToto Wolff, Team Principal and CEO, Mercedes-AMG, arrives in the paddock Photo by: Mark Sutton / Motorsport Images\n\nWolff said that some deep analysis was needed about how the fight behind Red Bull was playing out, as the form of Ferrari, Mercedes, Aston Martin and McLaren keeps switching around so much.\n\n“It is quite weird how that fluctuates – because you would have said for a long time into the season that Aston Martin was second before us,” he explained.\n\n“Probably they were our biggest competitor, obviously with Ferrari, and then suddenly you have McLaren in the mix in Austria.\n\n“Clearly, one car had the upgrade, and he was very fast, here both cars have the upgrade and they are second and third on the grid. So, absolutely, it seems like they have made a massive step in understanding and performance.”\n\nWolff said there was no doubt that Mercedes needs to find further gains with its car but reckoned that the way that Aston Martin and McLaren had made such big inroads for 2023 was proof that dramatic progress could still be made.\n\n“I think it’s very encouraging to see that Aston Martin found massive chunks of lap times from last year to this year, and in the same way you see within the season McLaren doing that,” he said.\n\n“That is something that you need to take your hat off [to] if we see that consolidating. Certainly, for us, it was a good example of how you can turn things around.”",
                            "top_image": "https://cdn-3.motorsport.com/images/amp/YpN1yGg0/s6/max-verstappen-red-bull-racing.jpg",
                            "keywords": [],
                            "publish_date": 1688917653,
                            "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3Lm1vdG9yc3BvcnQuY29tL2YxL25ld3MvbWVyY2VkZXMtaGludHMtYXQtcmV0aGluay1vdmVyLXJlZC1idWxsLWYxLWNvcHkvMTA0OTM2NDEv0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "F1 LIVE: Start grid changed as driver disqualified, Verstappen goes in on Perez",
                            "article_html": "<div><p>Toto Wolff hinted at Mercedes taking a leaf out of Red Bull's book after Max Verstappen took pole</p><p>It was another eventful day in the world of F1 as Max Verstappen claimed pole at the British Grand Prix ahead of Lando Norris at his home circuit, while Oscar Piastri took third on a brilliant day for McLaren. However, there was more disappointment for Verstappen's Red Bull team-mate Sergio Perez.</p><p>Perez endured another awful qualifying session, having been knocked out in Q1 much to the frustration of Red Bull and following Saturday's action, Verstappen made his feelings very clear on his team-mate's performance.</p><p id=\"div-gpt-ad-vip\"></p><p>Meanwhile after seeing Red Bull notch up another pole position, Toto Wolff has hinted at taking a leaf out of Red Bull's book as Mercedes look to cut the deficit between the two constructor giants following a tough time of late.</p><p>You can find out the latest news from the F1 world with Express Sport's blog right below as the British Grand Prix takes centre stage today...</p><p id=\"ovp-primis\">     </p></div>",
                            "text": "Toto Wolff hinted at Mercedes taking a leaf out of Red Bull's book after Max Verstappen took pole\n\nIt was another eventful day in the world of F1 as Max Verstappen claimed pole at the British Grand Prix ahead of Lando Norris at his home circuit, while Oscar Piastri took third on a brilliant day for McLaren. However, there was more disappointment for Verstappen's Red Bull team-mate Sergio Perez.\n\nPerez endured another awful qualifying session, having been knocked out in Q1 much to the frustration of Red Bull and following Saturday's action, Verstappen made his feelings very clear on his team-mate's performance.\n\nMeanwhile after seeing Red Bull notch up another pole position, Toto Wolff has hinted at taking a leaf out of Red Bull's book as Mercedes look to cut the deficit between the two constructor giants following a tough time of late.\n\nYou can find out the latest news from the F1 world with Express Sport's blog right below as the British Grand Prix takes centre stage today...",
                            "top_image": "https://cdn.images.express.co.uk/img/dynamic/73/1200x712/4846012.jpg?r=1688910936386",
                            "keywords": [],
                            "publish_date": 1688917654,
                            "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmV4cHJlc3MuY28udWsvc3BvcnQvZjEtYXV0b3Nwb3J0LzE3ODkwNDUvRjEtTElWRS1NYXgtVmVyc3RhcHBlbi1Ub3RvLVdvbGZmLUxld2lzLUhhbWlsdG9uLUJyaXRpc2gtR3JhbmQtUHJpeNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Mercedes Performance Improves After Adjustments to Its Racecar",
                            "article_html": "<div><p class=\"css-at9mc1 evys1bk0\">After qualifying was finished for the season-opening Bahrain Grand Prix in March, Toto Wolff, the Mercedes team principal, condemned his own car.</p><p class=\"css-at9mc1 evys1bk0\">Lewis Hamilton and George Russell, the team&#8217;s drivers, had finished over six-tenths of a second behind the leading time set by the reigning champion, Max Verstappen of Red Bull, which is a huge gap in Formula 1.</p><p class=\"css-at9mc1 evys1bk0\">&#8220;We got the physics wrong, and now we need to correct it,&#8221; Wolff said. &#8220;We gave it our best go, and now we need to regroup, sit down with the engineers and decide the development direction we want to pursue in order to win races.</p><p class=\"css-at9mc1 evys1bk0\">&#8220;We hit our targets, and that showed us that it is simply not good enough.&#8221;</p><p class=\"css-at9mc1 evys1bk0\">Weeks later, at the Monaco Grand Prix, Mercedes introduced an upgraded version of its W14 car. With new side pods, the aerodynamic shape was different. There was also a new floor and front suspension.</p></div>",
                            "text": "After qualifying was finished for the season-opening Bahrain Grand Prix in March, Toto Wolff, the Mercedes team principal, condemned his own car.\n\nLewis Hamilton and George Russell, the team’s drivers, had finished over six-tenths of a second behind the leading time set by the reigning champion, Max Verstappen of Red Bull, which is a huge gap in Formula 1.\n\n“We got the physics wrong, and now we need to correct it,” Wolff said. “We gave it our best go, and now we need to regroup, sit down with the engineers and decide the development direction we want to pursue in order to win races.\n\n“We hit our targets, and that showed us that it is simply not good enough.”\n\nWeeks later, at the Monaco Grand Prix, Mercedes introduced an upgraded version of its W14 car. With new side pods, the aerodynamic shape was different. There was also a new floor and front suspension.",
                            "top_image": "https://static01.nyt.com/images/2023/07/08/multimedia/08sp-british-mercedes-inyt-ljbp/08sp-british-mercedes-inyt-ljbp-facebookJumbo.jpg",
                            "keywords": [],
                            "publish_date": 1688917655,
                            "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDcvMDcvc3BvcnRzL2F1dG9yYWNpbmcvZjEtbWVyY2VkZXMtY2FyLXBlcmZvcm1hbmNlLmh0bWzSAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "",
                            "article_html": "",
                            "text": "",
                            "top_image": "",
                            "keywords": [],
                            "publish_date": 1688917656,
                            "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LnNpLmNvbS9mYW5uYXRpb24vcmFjaW5nL2YxYnJpZWZpbmdzL25ld3MvZjEtbmV3cy1tZXJjZWRlcy1zdW1tb25lZC10by1zdGV3YXJkcy1hZnRlci1sZXdpcy1oYW1pbHRvbi1taXNoYXAtc2o00gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Mercedes F1 Boss Toto Wolff Grasping At Straws To Prevent 11th Team Joining",
                            "article_html": "<div><p class=\"sc-77igqf-0 fnnahv\">Formula 1 is currently considering new teams to join the world championship grid, but many team principals aren&#8217;t happy about this, including <a class=\"sc-1out364-0 dPMosf sc-145m8ut-0 kdASgk js_link\" href=\"https://jalopnik.com/the-toto-wolff-smash-is-the-meme-f1-deserves-right-now-1793683756\">Mercedes team boss Toto Wolff</a>. The deadline for formal applications with the FIA closed last May, and the sport&#8217;s governing body is aiming to make its final decisions this month. The approved teams will then negotiate with Formula One Management, the championship&#8217;s commercial rights holder, to secure their spots.</p><p class=\"sc-77igqf-0 fnnahv\">The concerns of the current teams revolve around the dilution of F1&#8217;s prize pool by an additional team to share revenue with. The team bosses wanted to be included in the application process and have a say if a team was allowed to join. However, Wolff has added an additional concern to the mix, safety. <a class=\"sc-1out364-0 dPMosf sc-145m8ut-0 kdASgk js_link\" href=\"https://www.motorsport.com/f1/news/wolff-11th-f1-team-would-create-safety-issues/10492786/\" target=\"_blank\" rel=\"noopener noreferrer\">According to Motorsport.com</a>, he said:</p><blockquote class=\"sc-8hxd3p-0 bijnoX\"><p class=\"sc-77igqf-0 fnnahv\">&#8220;Our position was very clear - <a class=\"sc-1out364-0 dPMosf sc-145m8ut-0 kdASgk js_link\" href=\"https://jalopnik.com/andretti-autosport-isnt-buying-into-f1-any-time-soon-1847959325\">buy a team.</a> There&#8217;s a lot of consequences when you look at qualifying sessions. I mean already now we are looking like on a go-kart track, we are tripping over each other. There is a safety concern. We haven&#8217;t got the logistics where to put an 11th team.&#8221;</p></blockquote><p class=\"sc-1xxadal-0 jCxDxJ js_related-stories-inset\"></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-2 bGgkuB cLmdPT\"></p><p class=\"sc-17kx9cd-0 fjNuCW\">Advertisement</p><p class=\"ad-container dfp dfp-slot-MOBILE_IN_POST ad-mobile placement-default\"></p><p class=\"bt-wrapper\"><p class=\"bt-uid-tg\"></p></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-3 bGgkuB kTRrxu\"></p><p class=\"sc-77igqf-0 fnnahv\">The Austrian&#8217;s concerns are <a class=\"sc-1out364-0 dPMosf sc-145m8ut-0 kdASgk js_link\" href=\"https://jalopnik.com/toto-wolff-risk-of-brain-damage-from-porpoising-means-1849356193\">completely overblown</a>. Formula 1&#8217;s regulations allow for a maximum of 13 teams. Garage facilities at circuits allowed to host F1 are built with those regulations in mind. The track might be too crowded during the first portion of qualifying, but the format could easily be changed to alleviate congestion.</p><span class=\"sc-1eow4w5-0 knmQPh js_lightbox-wrapper\"><p class=\"sc-1m41dwj-0 jwxrZb magnifier js_lightbox lightbox hide\"><p class=\"sc-iyvn34-0 keEGDF\"></p></p><img alt=\"Formula One Group CEO Stefano Domenicali (L) and Mercedes F1 team principal Toto Wolff speak to the press during a visit to Downing Street in London on July 4, 2023 ahead of the British Grand Prix.\" src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"></span><p class=\"js_recommend\"></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-2 bGgkuB cLmdPT\"></p><p class=\"sc-17kx9cd-0 fjNuCW\">Advertisement</p><p class=\"ad-container dfp dfp-slot-MOBILE_IN_POST ad-mobile placement-default\"></p><p class=\"bt-wrapper\"><p class=\"bt-uid-tg\"></p></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-3 bGgkuB kTRrxu\"></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-2 bGgkuB cLmdPT\"></p><p class=\"sc-17kx9cd-0 fjNuCW\">Advertisement</p><p class=\"ad-container dfp dfp-slot-MOBILE_IN_POST ad-mobile placement-default\"></p><p class=\"bt-wrapper\"><p class=\"bt-uid-tg\"></p></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-3 bGgkuB kTRrxu\"></p><p class=\"sc-77igqf-0 fnnahv\">Wolff would then continue to try to compare the current situation in F1 to other team sports, stating:</p><blockquote class=\"sc-8hxd3p-0 bijnoX\"><p class=\"sc-77igqf-0 fnnahv\">&#8220;There is no mature sports league in the world, whether it&#8217;s a national football championship, or the Champions League, the NBA, the NFL, the NHL, where such a situation is possible, where you can say &#8216;I&#8217;m just setting up the team and I&#8217;m joining, thank you very much for making me part of the prize fund. You have to qualify, you have to go through the ranks, you have to showcase the commitment to the championship that we&#8217;ve done over the many years.&#8221;</p></blockquote><p class=\"sc-17kx9cd-1 sc-17kx9cd-2 bGgkuB cLmdPT\"></p><p class=\"sc-17kx9cd-0 fjNuCW\">Advertisement</p><p class=\"ad-container dfp dfp-slot-MOBILE_IN_POST ad-mobile placement-default\"></p><p class=\"bt-wrapper\"><p class=\"bt-uid-tg\"></p></p><p class=\"sc-17kx9cd-1 sc-17kx9cd-3 bGgkuB kTRrxu\"></p><p class=\"apscustom\" id=\"93b7dd52-a8ce-11ed-afa1-0242ac120002:1\"></p><p id=\"connatix-mid-article-thumbnails\"></p><p class=\"sc-77igqf-0 fnnahv\">That is not how the process works in the North American leagues. It is a franchise system where new owners pay an expansion fee to the league and participate in a draft to build a roster using players from existing teams. Wolff conceded that the NHL allowed the Vegas Golden Knights and Seattle Kraken to join but stated that all of hockey&#8217;s stakeholders wanted it to happen.</p><p class=\"js_ymal-below-post\"></p><p class=\"sc-1or3yyu-5 hNjGzN js_more-below-post\"></p><p class=\"sc-77igqf-0 fnnahv\">Formula One Management and the teams already established a similar anti-dilution fee for new entries, but the teams seemingly want more power to keep the paddock gate shut. F1 has also kept out the juggernauts of its feeder series, like Prema Powerteam and ART Grand Prix. Both teams have over 50 championship titles combined but have never been able to move up to F1. Hitech Grand Prix, another mult-category junior team, has sent in an application alongside <a class=\"sc-1out364-0 dPMosf sc-145m8ut-0 kdASgk js_link\" href=\"https://jalopnik.com/formula-1-can-prove-its-dedication-to-america-with-andr-1849964715\">Andretti-Cadillac&#8217;s heavily-criticized effort. </a></p></div>",
                            "text": "Formula 1 is currently considering new teams to join the world championship grid, but many team principals aren’t happy about this, including Mercedes team boss Toto Wolff. The deadline for formal applications with the FIA closed last May, and the sport’s governing body is aiming to make its final decisions this month. The approved teams will then negotiate with Formula One Management, the championship’s commercial rights holder, to secure their spots.\n\nThe concerns of the current teams revolve around the dilution of F1’s prize pool by an additional team to share revenue with. The team bosses wanted to be included in the application process and have a say if a team was allowed to join. However, Wolff has added an additional concern to the mix, safety. According to Motorsport.com, he said:\n\n“Our position was very clear - buy a team. There’s a lot of consequences when you look at qualifying sessions. I mean already now we are looking like on a go-kart track, we are tripping over each other. There is a safety concern. We haven’t got the logistics where to put an 11th team.”\n\nAdvertisement\n\nThe Austrian’s concerns are completely overblown. Formula 1’s regulations allow for a maximum of 13 teams. Garage facilities at circuits allowed to host F1 are built with those regulations in mind. The track might be too crowded during the first portion of qualifying, but the format could easily be changed to alleviate congestion.\n\nAdvertisement Advertisement\n\nWolff would then continue to try to compare the current situation in F1 to other team sports, stating:\n\n“There is no mature sports league in the world, whether it’s a national football championship, or the Champions League, the NBA, the NFL, the NHL, where such a situation is possible, where you can say ‘I’m just setting up the team and I’m joining, thank you very much for making me part of the prize fund. You have to qualify, you have to go through the ranks, you have to showcase the commitment to the championship that we’ve done over the many years.”\n\nAdvertisement\n\nThat is not how the process works in the North American leagues. It is a franchise system where new owners pay an expansion fee to the league and participate in a draft to build a roster using players from existing teams. Wolff conceded that the NHL allowed the Vegas Golden Knights and Seattle Kraken to join but stated that all of hockey’s stakeholders wanted it to happen.\n\nFormula One Management and the teams already established a similar anti-dilution fee for new entries, but the teams seemingly want more power to keep the paddock gate shut. F1 has also kept out the juggernauts of its feeder series, like Prema Powerteam and ART Grand Prix. Both teams have over 50 championship titles combined but have never been able to move up to F1. Hitech Grand Prix, another mult-category junior team, has sent in an application alongside Andretti-Cadillac’s heavily-criticized effort.",
                            "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/6a236cdf1caf0cb213ea5a73921b4335.jpg",
                            "keywords": [],
                            "publish_date": 1688917657,
                            "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vamFsb3BuaWsuY29tL21lcmNlZGVzLWYxLWJvc3MtdG90by13b2xmZi1ncmFzcGluZy1hdC1zdHJhd3MtdG8tcHJldmUtMTg1MDYxNTcwNNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        }
                    ]
                ]
            },
            {
                "topic": "formula1",
                "topic_news": [
                    [
                        {
                            "title": "Verstappen retakes British Grand Prix lead from Norris",
                            "article_html": "<div><p>Lando Norris sounds a little bit annoyed on the radio with his McLaren team constantly asking him questioning. Let the man drive. </p><p>The next update for Norris is \"don't worry about Leclerc, no-one is stopping yet.\" </p><img src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" alt=\"lando norris\" class=\"qa-lazyload-image lazyload lazyautosizes\"><p class=\"lx-media-asset__copyright gel-minion\"><p>Getty Images</p><p class=\"gs-u-vh\">Copyright: Getty Images</p></p></div>",
                            "text": "Lando Norris sounds a little bit annoyed on the radio with his McLaren team constantly asking him questioning. Let the man drive.\n\nThe next update for Norris is \"don't worry about Leclerc, no-one is stopping yet.\"",
                            "top_image": "https://news.google.com//m.files.bbci.co.uk/modules/bbc-morph-sport-seo-meta/1.23.3/images/bbc-sport-logo.png",
                            "keywords": [],
                            "publish_date": 1688917676,
                            "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmJiYy5jby51ay9zcG9ydC9saXZlL2Zvcm11bGExLzYzMjA3OTY50gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Formula 1 picks, odds, race time: Surprising 2023 British Grand Prix predictions, F1 best bets by proven model",
                            "article_html": "<div><p>Max Verstappen has been absolutely dominant in the 2023 Formula 1 season and is coming off his fifth straight victory last week. Will he continue that complete control over the rest of the Formula 1 field at the 2023 British Grand Prix at the Silverstone Circuit on Sunday at 10 a.m. ET? He finished 20th and seventh in his last two British Grand Prix events, so there may be an opportunity for a new winner for the first time since April on Sunday.</p><p>Verstappen is the -450 favorite (risk $450 to win $100) in the 2023 British Grand Prix odds on Caesars Sportsbook. Englishman Lando Norris, who is sure to be a local favorite, follows Verstappen at +1000, with Charles Leclerq at +1600. Lewis Hamilton has +2000 odds to win his ninth British Grand Prix, while Sergio Perez is at +5000 after struggling in qualifying. Before analyzing the 2023 British Grand Prix starting grid and making any Formula 1 picks, <a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">be sure to check out the latest 2023 British GP predictions and betting advice from SportsLine's proven projection model.</a></p><p>Developed by daily Fantasy pro and SportsLine predictive data engineer Mike McClure, this proprietary Formula 1 prediction model simulates every race 10,000 times, taking into account factors such as track history and recent results. It's had a strong history of success in motorsports, correctly predicting nine NASCAR winners since the 2021 season and its projected leaderboards have forecasted winners across multiple racing formats.</p><p>The model has been scorching hot when it comes to picking Formula 1 race events dating back to 2021. It nailed both of Charles Leclerc's wins in 2022, and at the 2021 Mexican Grand Prix, the model was strongly backing Verstappen as its top pick. The result: Verstappen dominated the field and ran away with a surprise victory.&#160;</p>\n        <p id=\"native_story_flex_top\" class=\"ad-native-story-flex-top \">\n    </p>\n\n    <p>The model followed that up by calling Verstappen's win at the Rolex Emilia Romagna GP in April and then nailed his wins again in Belgium, the Netherlands, Japan, the United States, Mexico and Abu Dhabi. It's also nailed Verstappen's wins in Bahrain, Australia, Miami, Monaco, Spain, Canada and Austria this season. Anyone who followed the model's lead on those plays has seen huge returns</p><p>Now, the model has dialed in on the 2023 Formula 1 British Grand Prix and just released its coveted picks and leaderboard projections. <a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">You can head to SportsLine now to see the complete 2023 British Grand Prix leaderboard projection.</a></p><h2>Top 2023 Formula 1 British GP predictions</h2><p>One massive shocker: The model is fading Leclerc even though he's coming off a season-best second-place finish in Austria and is listed as the third favorite. He has +1600 odds but is sixth in the 2023 Formula 1 standings, largely because of his inconsistent racing this season.</p>\n        <p id=\"gambling_partner\" class=\"ad-gambling-partner GamblingPartnerAd lazyload lazypreload\">\n    </p>\n\n    <p>Last weekend was his first runner-up in nine races this season, and he's winless in his last 20 races. Although he finished second in the Formula 1 standings last year, the 25-year-old hasn't built on that success at all. In fact, he's regressed with two finishes 19th or worse this season over just nine races after finishing 19th or worse three times last year in 22 races. The model doesn't see value in his 16-1 odds, picking him to finish outside the top five on Sunday.&#160;<a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">See who else the model is backing and who it is fading right here</a>.</p><h2>How to make 2023 British Grand Prix   picks</h2><p>The model is also targeting one longshot getting triple-digit British GP odds to make a surprising surge up the leaderboard. Anyone who backs him could hit it big. <a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">You can find out who he is, and see all of the model's F1 picks and predictions at SportsLine.</a></p><p><strong>So who wins the British Grand Prix 2023, and which under-the-radar drivers make a stunning charge toward the front? Check out the latest 2023 F1 odds below, <a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">then visit SportsLine now to see the full projected 2023 British Grand Prix leaderboard, all from the model that has already nailed all seven of Verstappen's wins this season</a> and find out.</strong></p>\n        <p id=\"native_story_flex_inc\" class=\"ad-native-story-flex-inc lazyload lazypreload\">\n    </p>\n\n    <h2>2023 Formula 1 British Grand Prix   odds, field, top contenders</h2><p><a href=\"https://www.sportsline.com/insiders/2023-formula-1-schedule-f1-picks-odds-british-grand-prix-projected-leaderboard-start-time-race-prediction-from-top-model/#ttag=07062023_agg_cbssports_picks_autoracing_formula1_model_britishgrandprix\" target=\"_blank\">See British Grand Prix picks at SportsLine</a><br><br>Max Verstappen -450 <br>Lando Norris +1000 <br>Charles Leclerc +1600 <br>Lewis Hamilton +2000 <br>Carlos Sainz +2200 <br>George Russell +2500 <br>Sergio Perez +5000 <br>Oscar Piastri +6600 <br>Fernando Alonso +8000 <br>Alexander Albon +12500 <br>Lance Stroll +25000 <br>Pierre Gasly +25000 <br>Esteban Ocon +30000 <br>Nico Hulkenberg +40000 <br>Valtteri Bottas +100000 <br>Logan Sargeant +150000 <br>Kevin Magnussen +200000 <br>Guanyu Zhou +200000 <br>Yuki Tsunoda +200000 <br>Nyck De Vries +300000</p>\n\n\n        \n            </div>",
                            "text": "Max Verstappen has been absolutely dominant in the 2023 Formula 1 season and is coming off his fifth straight victory last week. Will he continue that complete control over the rest of the Formula 1 field at the 2023 British Grand Prix at the Silverstone Circuit on Sunday at 10 a.m. ET? He finished 20th and seventh in his last two British Grand Prix events, so there may be an opportunity for a new winner for the first time since April on Sunday.\n\nVerstappen is the -450 favorite (risk $450 to win $100) in the 2023 British Grand Prix odds on Caesars Sportsbook. Englishman Lando Norris, who is sure to be a local favorite, follows Verstappen at +1000, with Charles Leclerq at +1600. Lewis Hamilton has +2000 odds to win his ninth British Grand Prix, while Sergio Perez is at +5000 after struggling in qualifying. Before analyzing the 2023 British Grand Prix starting grid and making any Formula 1 picks, be sure to check out the latest 2023 British GP predictions and betting advice from SportsLine's proven projection model.\n\nDeveloped by daily Fantasy pro and SportsLine predictive data engineer Mike McClure, this proprietary Formula 1 prediction model simulates every race 10,000 times, taking into account factors such as track history and recent results. It's had a strong history of success in motorsports, correctly predicting nine NASCAR winners since the 2021 season and its projected leaderboards have forecasted winners across multiple racing formats.\n\nThe model has been scorching hot when it comes to picking Formula 1 race events dating back to 2021. It nailed both of Charles Leclerc's wins in 2022, and at the 2021 Mexican Grand Prix, the model was strongly backing Verstappen as its top pick. The result: Verstappen dominated the field and ran away with a surprise victory.\n\nThe model followed that up by calling Verstappen's win at the Rolex Emilia Romagna GP in April and then nailed his wins again in Belgium, the Netherlands, Japan, the United States, Mexico and Abu Dhabi. It's also nailed Verstappen's wins in Bahrain, Australia, Miami, Monaco, Spain, Canada and Austria this season. Anyone who followed the model's lead on those plays has seen huge returns\n\nNow, the model has dialed in on the 2023 Formula 1 British Grand Prix and just released its coveted picks and leaderboard projections. You can head to SportsLine now to see the complete 2023 British Grand Prix leaderboard projection.\n\nTop 2023 Formula 1 British GP predictions\n\nOne massive shocker: The model is fading Leclerc even though he's coming off a season-best second-place finish in Austria and is listed as the third favorite. He has +1600 odds but is sixth in the 2023 Formula 1 standings, largely because of his inconsistent racing this season.\n\nLast weekend was his first runner-up in nine races this season, and he's winless in his last 20 races. Although he finished second in the Formula 1 standings last year, the 25-year-old hasn't built on that success at all. In fact, he's regressed with two finishes 19th or worse this season over just nine races after finishing 19th or worse three times last year in 22 races. The model doesn't see value in his 16-1 odds, picking him to finish outside the top five on Sunday. See who else the model is backing and who it is fading right here.\n\nHow to make 2023 British Grand Prix picks\n\nThe model is also targeting one longshot getting triple-digit British GP odds to make a surprising surge up the leaderboard. Anyone who backs him could hit it big. You can find out who he is, and see all of the model's F1 picks and predictions at SportsLine.\n\nSo who wins the British Grand Prix 2023, and which under-the-radar drivers make a stunning charge toward the front? Check out the latest 2023 F1 odds below, then visit SportsLine now to see the full projected 2023 British Grand Prix leaderboard, all from the model that has already nailed all seven of Verstappen's wins this season and find out.\n\n2023 Formula 1 British Grand Prix odds, field, top contenders\n\nSee British Grand Prix picks at SportsLine\n\n\n\nMax Verstappen -450\n\nLando Norris +1000\n\nCharles Leclerc +1600\n\nLewis Hamilton +2000\n\nCarlos Sainz +2200\n\nGeorge Russell +2500\n\nSergio Perez +5000\n\nOscar Piastri +6600\n\nFernando Alonso +8000\n\nAlexander Albon +12500\n\nLance Stroll +25000\n\nPierre Gasly +25000\n\nEsteban Ocon +30000\n\nNico Hulkenberg +40000\n\nValtteri Bottas +100000\n\nLogan Sargeant +150000\n\nKevin Magnussen +200000\n\nGuanyu Zhou +200000\n\nYuki Tsunoda +200000\n\nNyck De Vries +300000",
                            "top_image": "https://sportshub.cbsistatic.com/i/r/2023/07/08/725e1b2e-c914-474c-835a-98a4879a0314/thumbnail/1200x675/0edd4f62d22b8bce180c11ee2591c55e/gettyimages-1522128068.jpg",
                            "keywords": [],
                            "publish_date": 1688917679,
                            "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5jYnNzcG9ydHMuY29tL21vdG9yLXNwb3J0cy9uZXdzL2Zvcm11bGEtMS1waWNrcy1vZGRzLXJhY2UtdGltZS1zdXJwcmlzaW5nLTIwMjMtYnJpdGlzaC1ncmFuZC1wcml4LXByZWRpY3Rpb25zLWYxLWJlc3QtYmV0cy1ieS1wcm92ZW4tbW9kZWwv0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Formula 1: Max Verstappen enters unfamiliar territory",
                            "article_html": "<div><p>Formula 1: A new team has joined the fight for the podium by Siddharth Bharani-Dharan</p><p class=\"speakable-content\"><strong>Silverstone Circuit is one of just three circuits where Max Verstappen failed to win in both the 2021 and 2022 Formula 1 seasons.</strong></p><p class=\"speakable-content\">Just three tracks which appeared on the <a href=\"http://beyondtheflag.com/formula-one\">Formula 1</a> schedule in both 2021 and 2022 did not see two-time reigning world champion Max Verstappen win in either season.</p><p>One of those tracks is scheduled to host this Sunday&#8217;s race, with the Red Bull driver set to enter the weekend on his second ever five-race winning streak.</p><p>Silverstone Circuit is the site of many recent unpleasant memories for the driver who has been otherwise dominant. The 18-turn, 3.661-mile (5.892-kilometer) road course is where he has his worst average result across multiple races since 2021, that being an uncharacteristic 13.5.</p><p>Verstappen looked poised to win the race last year, but bodywork damage suffered as a result of debris from another car made it practically impossible. He was able to salvage a seventh place finish.</p><p>And of course, we all remember what happened in 2021, when he was taken out by country hero Lewis Hamilton on the opening lap amid their epic championship battle. Hamilton overcame the ensuing slam-dunk penalty to further rub salt in the wound with a race victory.</p><p>On top of that, Silverstone Circuit itself has presented a highly anti-Verstappen environment ever since the Dutchman truly began to mount a challenge against the seven-time world champion a few seasons ago.</p><p>While it may have only been a small contingent of fans who cheered as Verstappen was taken to hospital after the 2021 wreck, you could hear the unmistakable boos in 2022 whenever he was spoken to on the broadcast or shown on the video screens &#8212; and the unforgiving roars of approval when he began to fall down the order with car damage.</p><p>What does 2023 have in store?</p><p>Believe it or not, Verstappen does actually have a win at Silverstone Circuit to his name, having won the second of two races at the track in a 2020 season that saw several schedule modifications due to COVID-19-related restrictions.</p><p>He almost won both races there that year, in fact, with Hamilton winning the first but with a tire that went flat on the final lap.</p><p>But his win was not in front of a raucous crowd of 150,000 fans, and that race was the 70th Anniversary Grand Prix. He is still in search of his first British Grand Prix win.</p><p><strong>FanDuel Sportsbook</strong>, which is currently <a href=\"https://bit.ly/BeyondtheFlag-Web-FanDuel\" target=\"_blank\" rel=\"nofollow noopener sponsored\">offering fans an instant $200</a> just for signing up and betting $20, lists Verstappen as the -290 favorite to win the British Grand Prix.</p><p>The other two tracks where Verstappen failed to win in both 2021 and 2022 are Bahrain International Circuit, where he had never won, and Interlagos Circuit, where he won in 2019. He opened up the 2023 season with a win in Bahrain, while Formula 1 is not scheduled to visit Interlagos until November.</p><p>Can Verstappen send a cold-blooded message to the British fans with a career-best sixth straight victory this Sunday, much like he did in front of Red Bull&#8217;s home crowd last week by pitting and taking away the fastest lap point from teammate Sergio Perez on the final lap of the race, or will the Silverstone crowd enjoy another Sunday afternoon at Verstappen&#8217;s expense?</p><p>The British Grand Prix is scheduled to be broadcast live on ESPN2 from Silverstone Circuit beginning at 9:55 a.m. ET on Sunday, July 9. <strong>Start a <a href=\"https://www.fubo.tv/lp/sports/?bgvideo=nascar_fox.mp4&amp;title=Watch%20NASCAR%20live%20on%20FS1%20and%20FOX&amp;subinfo=Stream%20On%20Your%20TV,%20Phone,%20Computer%20and%20More&amp;priceline=Watch%20live%20or%20record%20it%20for%20later.%20Regional%20Restrictions%20Apply&amp;irad=356371&amp;irmp=374356&amp;subId1=FS-BeyondTheFlag-NASCAR\" target=\"_blank\" rel=\"nofollow noopener sponsored\">free trial of FuboTV today </a>and don&#8217;t miss it!</strong></p>  </div>",
                            "text": "Formula 1: A new team has joined the fight for the podium by Siddharth Bharani-Dharan\n\nSilverstone Circuit is one of just three circuits where Max Verstappen failed to win in both the 2021 and 2022 Formula 1 seasons.\n\nJust three tracks which appeared on the Formula 1 schedule in both 2021 and 2022 did not see two-time reigning world champion Max Verstappen win in either season.\n\nOne of those tracks is scheduled to host this Sunday’s race, with the Red Bull driver set to enter the weekend on his second ever five-race winning streak.\n\nSilverstone Circuit is the site of many recent unpleasant memories for the driver who has been otherwise dominant. The 18-turn, 3.661-mile (5.892-kilometer) road course is where he has his worst average result across multiple races since 2021, that being an uncharacteristic 13.5.\n\nVerstappen looked poised to win the race last year, but bodywork damage suffered as a result of debris from another car made it practically impossible. He was able to salvage a seventh place finish.\n\nAnd of course, we all remember what happened in 2021, when he was taken out by country hero Lewis Hamilton on the opening lap amid their epic championship battle. Hamilton overcame the ensuing slam-dunk penalty to further rub salt in the wound with a race victory.\n\nOn top of that, Silverstone Circuit itself has presented a highly anti-Verstappen environment ever since the Dutchman truly began to mount a challenge against the seven-time world champion a few seasons ago.\n\nWhile it may have only been a small contingent of fans who cheered as Verstappen was taken to hospital after the 2021 wreck, you could hear the unmistakable boos in 2022 whenever he was spoken to on the broadcast or shown on the video screens — and the unforgiving roars of approval when he began to fall down the order with car damage.\n\nWhat does 2023 have in store?\n\nBelieve it or not, Verstappen does actually have a win at Silverstone Circuit to his name, having won the second of two races at the track in a 2020 season that saw several schedule modifications due to COVID-19-related restrictions.\n\nHe almost won both races there that year, in fact, with Hamilton winning the first but with a tire that went flat on the final lap.\n\nBut his win was not in front of a raucous crowd of 150,000 fans, and that race was the 70th Anniversary Grand Prix. He is still in search of his first British Grand Prix win.\n\nFanDuel Sportsbook, which is currently offering fans an instant $200 just for signing up and betting $20, lists Verstappen as the -290 favorite to win the British Grand Prix.\n\nThe other two tracks where Verstappen failed to win in both 2021 and 2022 are Bahrain International Circuit, where he had never won, and Interlagos Circuit, where he won in 2019. He opened up the 2023 season with a win in Bahrain, while Formula 1 is not scheduled to visit Interlagos until November.\n\nCan Verstappen send a cold-blooded message to the British fans with a career-best sixth straight victory this Sunday, much like he did in front of Red Bull’s home crowd last week by pitting and taking away the fastest lap point from teammate Sergio Perez on the final lap of the race, or will the Silverstone crowd enjoy another Sunday afternoon at Verstappen’s expense?\n\nThe British Grand Prix is scheduled to be broadcast live on ESPN2 from Silverstone Circuit beginning at 9:55 a.m. ET on Sunday, July 9. Start a free trial of FuboTV today and don’t miss it!",
                            "top_image": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fbeyondtheflag.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2023%2F07%2F1406571441-scaled.jpeg",
                            "keywords": [],
                            "publish_date": 1688917681,
                            "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYmV5b25kdGhlZmxhZy5jb20vMjAyMy8wNy8wNy9mb3JtdWxhLTEtbWF4LXZlcnN0YXBwZW4tc2lsdmVyc3RvbmUtaG9zdGlsZS_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Brad Pitt appearance made F1 drivers' briefing \"best ever\"",
                            "article_html": "<div><p>Pitt and director Joseph Kosinski attended the gathering essentially to introduce themselves and thank the drivers in advance for accepting any inconvenience associated with the production of the new Apple-backed F1 movie.</p><p class=\"ms-ap\"></p><p>After months of preparation shooting began in earnest this weekend, <a href=\"https://www.motorsport.com/f1/news/f1s-fictional-11th-team-appears-as-brad-pitt-movie-begins-filming/10492037/\" target=\"_self\" rel=\"noopener\">and the film's fictional 11th team has a high-profile presence in the paddock and pitlane.</a></p>\n<p>The production's<a href=\"https://www.motorsport.com/f1/news/how-much-does-the-fictional-apxgp-car-differ-to-real-f1-machinery/10492657/\" target=\"_self\" rel=\"noopener\"> converted F2 cars</a> will be seen on the grid before the race, and will complete part of the formation lap, driven by former racers turned stuntmen Craig Dolby and Luciano Bacheta.</p>\n<p>\"I think it's one of those when you when you see a worldwide superstar for the first time, it's quite surreal,\" said GPDA director <a href=\"https://www.motorsport.com/driver/george-russell/21167/\" target=\"_blank\" rel=\"noopener\">George Russell</a> of Pitt's appearance.</p>\n<p>\"And then it's only when you get to be with those individuals whether it was Tom Cruise, Brad Pitt or Roger Federer, whoever we've been fortunate enough to meet, you recognise they're just normal human beings.</p>\n<p>\"He was joking around and having a good time and just kind of one of the boys really. So excited to see what the movie does.\"</p>\n   <img src=\"//cdn-9.motorsport.com/images/mgl/YW7epwOY/s1000/esteban-ocon-alpine-a523-carlo-1.jpg\" alt=\"Esteban Ocon, Alpine A523, Carlos Sainz, Ferrari SF-23, Charles Leclerc, Ferrari SF-23, George Russell, Mercedes F1 W14, others queue to leave the pits\"> \n<p class=\"title\">Esteban Ocon, Alpine A523, Carlos Sainz, Ferrari SF-23, Charles Leclerc, Ferrari SF-23, George Russell, Mercedes F1 W14, others queue to leave the pits</p>\n<p class=\"photographer\">Photo by: Glenn Dunbar / <a href=\"https://www.motorsportimages.com\" target=\"_blank\" rel=\"noopener\">Motorsport Images</a></p>\n<p>Ferrari's <a href=\"https://www.motorsport.com/driver/charles-leclerc/109611/\" target=\"_blank\" rel=\"noopener\">Charles Leclerc</a> expressed his support for the filming.</p>\n<p>\"It's fun, it's a new face and definitely quite unexpected to see Brad in the drivers' briefing,\" he said.</p>\n<p>\"They did a bit of a brief of what to expect for the movie and it just is very exciting. I'm looking forward to seeing it. Nice guy.\"</p>\n<p><a href=\"https://www.motorsport.com/driver/pierre-gasly/19626/\" target=\"_blank\" rel=\"noopener\">Pierre Gasly</a>, who posted a selfie of himself with Pitt, Hamilton and Leclerc, admitted that he hadn't registered any impact from the filming thus far.</p><p class=\"ms-ap\"></p><p>\"I must say it's not every day you get the chance to see Brad Pitt,\" said the <a href=\"https://www.motorsport.com/team/alpine/24858/\" target=\"_blank\" rel=\"noopener\">Alpine</a> driver. \"We got the chance to meet him and they introduced themselves and the movie. It was definitely a special moment.</p>\n<p>\"Apart from the driver's briefing and be sitting right in front of Brad Pitt, everything kind of felt normal.</p>\n<p>\"So on my side, I will say it has changed zero. But I think on Sunday, the grid might look slightly different than usual. We'll see what happens.\"</p>\n<p>World champion <a href=\"https://www.motorsport.com/driver/max-verstappen/17529/\" target=\"_blank\" rel=\"noopener\">Max Verstappen</a> showed less enthusiasm for the project than most of his colleagues.</p>\n<p>\"I think they're going to use some shots of everybody, in terms of onboard cameras and stuff,\" said the Dutchman. \"I completely can't be bothered with this.</p>\n<p>\"In the end, a film is always made to create a little bit of a show in it. Because yes, of course, it won't all be real. But I think it's all fine. I'm actually not that much into it.\"</p>\n<p>Additional reporting by Matt Kew and Erwin Jaeggi</p>\n    \n    <p id=\"ms-piano_article-prebanner\" class=\"ms-display-contents\"></p>\n\n    \n    <p class=\"ms-entity-detail-header_views\">\n                \n                    \n                \n                <p class=\"ms-entity-detail-header_views-value\"></p>\n            </p>\n        <p class=\"ms-share_inline \"></p>\n            \n            \n            <p class=\"ms-entity-detail-header_shares\">\n                <p class=\"ms-entity-detail-header_shares_value\"></p>\n                <p class=\"ms-entity-detail-header_shares_label\">shares</p>\n            </p>\n                         \n                    </div>",
                            "text": "Pitt and director Joseph Kosinski attended the gathering essentially to introduce themselves and thank the drivers in advance for accepting any inconvenience associated with the production of the new Apple-backed F1 movie.\n\nAfter months of preparation shooting began in earnest this weekend, and the film's fictional 11th team has a high-profile presence in the paddock and pitlane.\n\nThe production's converted F2 cars will be seen on the grid before the race, and will complete part of the formation lap, driven by former racers turned stuntmen Craig Dolby and Luciano Bacheta.\n\n\"I think it's one of those when you when you see a worldwide superstar for the first time, it's quite surreal,\" said GPDA director George Russell of Pitt's appearance.\n\n\"And then it's only when you get to be with those individuals whether it was Tom Cruise, Brad Pitt or Roger Federer, whoever we've been fortunate enough to meet, you recognise they're just normal human beings.\n\n\"He was joking around and having a good time and just kind of one of the boys really. So excited to see what the movie does.\"\n\nEsteban Ocon, Alpine A523, Carlos Sainz, Ferrari SF-23, Charles Leclerc, Ferrari SF-23, George Russell, Mercedes F1 W14, others queue to leave the pits Photo by: Glenn Dunbar / Motorsport Images\n\nFerrari's Charles Leclerc expressed his support for the filming.\n\n\"It's fun, it's a new face and definitely quite unexpected to see Brad in the drivers' briefing,\" he said.\n\n\"They did a bit of a brief of what to expect for the movie and it just is very exciting. I'm looking forward to seeing it. Nice guy.\"\n\nPierre Gasly, who posted a selfie of himself with Pitt, Hamilton and Leclerc, admitted that he hadn't registered any impact from the filming thus far.\n\n\"I must say it's not every day you get the chance to see Brad Pitt,\" said the Alpine driver. \"We got the chance to meet him and they introduced themselves and the movie. It was definitely a special moment.\n\n\"Apart from the driver's briefing and be sitting right in front of Brad Pitt, everything kind of felt normal.\n\n\"So on my side, I will say it has changed zero. But I think on Sunday, the grid might look slightly different than usual. We'll see what happens.\"\n\nWorld champion Max Verstappen showed less enthusiasm for the project than most of his colleagues.\n\n\"I think they're going to use some shots of everybody, in terms of onboard cameras and stuff,\" said the Dutchman. \"I completely can't be bothered with this.\n\n\"In the end, a film is always made to create a little bit of a show in it. Because yes, of course, it won't all be real. But I think it's all fine. I'm actually not that much into it.\"\n\nAdditional reporting by Matt Kew and Erwin Jaeggi",
                            "top_image": "https://cdn-6.motorsport.com/images/amp/6D19AJw0/s6/brad-pitt-garage-for-the-filmi.jpg",
                            "keywords": [],
                            "publish_date": 1688917683,
                            "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm1vdG9yc3BvcnQuY29tL2YxL25ld3MvYnJhZC1waXR0LWFwcGVhcmFuY2UtbWFkZS1mMS1kcml2ZXJzLWJyaWVmaW5nLWJlc3QtZXZlci8xMDQ5Mzc1Ni_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        },
                        {
                            "title": "Free F1 live stream: Where to watch British Formula 1 GP online from anywhere",
                            "article_html": "<div><p class=\"financial-disclaimer\"><i>When you buy through our links, Insider may earn an affiliate commission. <a target=\"_blank\" href=\"https://www.businessinsider.com/insider-reviews-expertise-in-product-reviews\" rel=\"\">Learn more.</a></i></p>\n                        <p class=\"table-of-contents table-of-contents-sticky\"></p><p>Looking for a free F1 live stream? Not only can we help show you where to watch the British Formula 1 GP live, but this week's race options are free and include an English commentary option. Usually, all the free F1 live streams are found in Austria, Belgium, and so on. And they're still on this week, of course, but the UK's Channel 4 is keeping up the fine tradition of showing the British F1 live stream for free.</p><p>We've listed all the free countries below, <strong>but if you're not in one of those countries, you'll need to use a VPN (virtual private network) to watch along</strong>. A VPN simulates your device's location to be in a different country and gets around geo-block restrictions for a multitude of streaming services.&#160;&#160;</p><p>If you're unavailable when the race is happening, there's an extended highlights show a few hours later. Or you can see full replays on-demand with channels that offered the full race earlier. All for free.</p><h2 id=\"how-to-watch-for-free\" class=\"toc-anchor\">Where to Watch a free British F1 live stream</h2><p>As mentioned above, the UK, Belgium, Luxembourg, and Austria have free F1 live streams for the British GP today. UK coverage of the live race is usually exclusively shown on the paid Sky Sports service, but this weekend <a href=\"https://www.channel4.com/now/C4\" target=\"_blank\" rel=\"noopener nofollow\">Channel 4</a> has it on TV or online for free. Channel 4's coverage begins 90 minutes before the race at 1:30 p.m. BST, but if you just want to see the race, just head on over by 3 p.m.&#160;&#160;</p><p>If you're not currently in one of the free countries highlighted above, you'll need to use your VPN to hop into another country digitally. Our preferred option of all the <a href=\"https://www.businessinsider.com/guides/tech/best-vpn\" rel=\"\">best VPN</a> providers is <a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=df2e08f3bea35e179958ef36f14fcbd16021231fb35b60a5c21a73cacd243e61&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.expressvpn.com%2Foffer%2Fcoupon&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" rel=\"nofollow noopener sponsored\"><strong>ExpressVPN</strong></a>, which comes with a 30-day money-back guarantee if you're unsatisfied. Better yet, you can get an extra three months for free and save 49% on a subscription.</p><h2 id=\"how-to-watch-via-a-vpn\" class=\"toc-anchor\">How to watch the British F1 live stream with a VPN</h2><ul><li>Sign up for <strong><a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=df2e08f3bea35e179958ef36f14fcbd16021231fb35b60a5c21a73cacd243e61&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.expressvpn.com%2Foffer%2Fcoupon&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" rel=\"nofollow noopener sponsored\">a VPN</a></strong> if you don't have one.</li><li>Install it on the device you're using to watch the race.</li><li>Turn it on and set it to a country with a free live stream.</li><li>Head over to <strong><a href=\"https://www.channel4.com/now/C4\" target=\"_blank\" rel=\"noopener nofollow\">Channel 4 (UK)</a>*</strong>&#160;|&#160; <strong><a href=\"https://tvthek.orf.at/livestreams\" target=\"_blank\" rel=\"noopener nofollow\">ORF 1 (Austria)</a></strong>&#160;|&#160;<strong><a href=\"https://auvio.rtbf.be/direct\" target=\"_blank\" rel=\"noopener nofollow\">RTBF (Belgium)</a></strong>&#160;| <strong><a href=\"https://www.rtl.lu/tele/live-2\" target=\"_blank\" rel=\"noopener nofollow\">RTL (Luxembourg)</a></strong>.</li><li>*Create a free login for Channel 4.</li><li>Watch on the live sections of the sites.</li><li>Race start: Today, 10 a.m. ET / 3 p.m. BST / 4 p.m. CET / 12 a.m (Monday) AEST.</li></ul><a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=df2e08f3bea35e179958ef36f14fcbd16021231fb35b60a5c21a73cacd243e61&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.expressvpn.com%2Foffer%2Fcoupon&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" rel=\"nofollow sponsored noindex\" class=\"product-card-image-link not-content-link\">\n                                <img class=\"lazy-image \" src=\"\" alt=\"\">\n                              \n                              \n                                  <img src=\"https://i.insider.com/64a9290a8ed31300199e3063\">\n                              \n                              \n                              </a>\n                        \n                          \n                        \n                            <a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=df2e08f3bea35e179958ef36f14fcbd16021231fb35b60a5c21a73cacd243e61&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.expressvpn.com%2Foffer%2Fcoupon&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" class=\"product-card-title not-content-link headline-bold\" rel=\"nofollow sponsored noindex\">\n                              ExpressVPN Plan\n                            </a>\n                          \n                        \n                            <p class=\"product-card-body body-regular\">\n                              With its consistent performance, reliable security, and expansive global streaming features, ExpressVPN is the best VPN out there, excelling in every spec and offering many advanced features that makes it exceptional. Better yet, you can save up to 49% and get an extra three months for free today.\n                            </p>\n                        \n                        \n                             \n                        <h2 id=\"are-there-extended-highlights-later?\" class=\"toc-anchor\">Are there extended highlights later?</h2><p>In the UK, Channel 4 has an extended highlights show a few hours after the race at 11:50 p.m. BST (6:50 p.m. ET). Coverage lasts two hours, so it feels like you're effectively seeing the whole race with only a few time-saving edits. You can tune in on the <a href=\"https://www.channel4.com/tv-guide/2023/04/02\" target=\"_blank\" rel=\"noopener nofollow\">Channel 4 website</a> online and use a VPN as outlined above to watch from outside the UK. If you're not free to watch it at this time, it will be available on-demand for free on the site, probably the day after. Although, the on-demand option is sometimes a shortened version, lasting just over an hour some weeks and closer to two hours on others.</p><p>This highlights show isn't just a one-off for the British GP, by the way. It's on every race weekend and is a great free option for English commentary if you can avoid the race result from earlier in the day.&#160;</p><h2 id=\"how-to-watch-in-the-us\" class=\"toc-anchor\">How to watch an F1 live stream in the US</h2><p>ESPN carries coverage of Formula 1 racing throughout the season, and there's plenty of it left to enjoy too. If you don't already have access to the channel, there are a couple of cord-cutting options for you to consider. <a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=1e3fb696bbdb86813884158ec2e9e64a5dc2a54ce1cba247f82c951a9c2e37b6&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.sling.com%2F&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" rel=\"noopener\"><strong>Sling TV's Orange tier</strong></a> is usually $40 a month, but a special offer now sees that first month's price slashed to just $15.&#160;</p><p>Fubo TV also has ESPN but is much more expensive at $74.99 monthly. It's packed with channels, though, and is a favorite amongst cord-cutting sports fans. Better yet, you can get a <a href=\"http://www.fubo.tv/welcome?irad=343747&amp;irmp=196318?subId1=biipgf_113018_best-streaming-services&amp;u=https%3A%2F%2Fwww.fubo.tv%2Fwelcome\" target=\"_blank\" rel=\"noopener nofollow\"><strong>7-day free trial</strong></a>, so enjoy the race for free and cancel your sub before the week is up if you don't want to keep it.</p><a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=1e3fb696bbdb86813884158ec2e9e64a5dc2a54ce1cba247f82c951a9c2e37b6&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.sling.com%2F&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" rel=\"nofollow sponsored noindex\" class=\"product-card-image-link not-content-link\">\n                                <img class=\"lazy-image \" src=\"\" alt=\"\">\n                              \n                              \n                                  <img src=\"https://i.insider.com/5e669a98ebf251324c00c0b3\">\n                              \n                              \n                              </a>\n                        \n                          \n                              <p class=\"product-card-deal-container\">\n                                \n                                  Deal icon\n                                  An icon in the shape of a lightning bolt.\n                                \n                                  \n                                \n                                <p class=\"product-card-deal-title headline-bold\">\n                                  Deal\n                                </p>\n                              </p>\n                        \n                            <a href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=1e3fb696bbdb86813884158ec2e9e64a5dc2a54ce1cba247f82c951a9c2e37b6&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.sling.com%2F&amp;platform=browser&amp;sc=false&amp;disabled=false\" target=\"_blank\" class=\"product-card-title not-content-link headline-bold\" rel=\"nofollow sponsored noindex\">\n                              Sling TV Subscription\n                            </a>\n                          \n                        \n                            <p class=\"product-card-deal-explainer body-regular\">\n                                  Sling is one of the most affordable live TV streaming services you can sign up for. New members can now receive their first month for a discounted rate of just $20.\n                                </p>\n                              <a target=\"_merchant\" href=\"https://affiliate.insider.com/?amazonTrackingID=biauto-59713-20&amp;h=1e3fb696bbdb86813884158ec2e9e64a5dc2a54ce1cba247f82c951a9c2e37b6&amp;postID=64aa85f6458c1a6acb479d52&amp;site=bi&amp;u=https%3A%2F%2Fwww.sling.com%2F&amp;platform=browser&amp;sc=false&amp;disabled=false\" rel=\"nofollow sponsored noindex\" class=\"product-card-button insider-picks-button not-content-link headline-bold \">\n                                  Shop at Sling\n                                </a>\n                              <a href=\"http://www.fubo.tv/welcome?irad=343747&amp;irmp=196318?subId1=biipgf_113018_best-streaming-services&amp;u=https%3A%2F%2Fwww.fubo.tv%2Fwelcome\" target=\"_blank\" rel=\"nofollow sponsored noindex\" class=\"product-card-image-link not-content-link\">\n                                <img class=\"lazy-image \" src=\"\" alt=\"\">\n                              \n                              \n                                  <img src=\"https://i.insider.com/5e1f7faa24306a1d097b2563\">\n                              \n                              \n                              </a>\n                        \n                          \n                        \n                            <a href=\"http://www.fubo.tv/welcome?irad=343747&amp;irmp=196318?subId1=biipgf_113018_best-streaming-services&amp;u=https%3A%2F%2Fwww.fubo.tv%2Fwelcome\" target=\"_blank\" class=\"product-card-title not-content-link headline-bold\" rel=\"nofollow sponsored noindex\">\n                              Fubo TV (Pro Plan)\n                            </a>\n                          \n                        \n                            <p class=\"product-card-body body-regular\">\n                              FuboTV is one of the lesser-known streaming services, but it's worth considering for those who love entertainment and non-traditional sports programming. It's pricey, but there is currently a 7-day free trial, so you can take it for a spin first.\n                            </p>\n                        \n                        \n                             \n                        <p><strong>Note:</strong> Using VPNs is illegal in certain countries, and using VPNs to access region-locked streaming content might constitute a breach of the terms of use for certain services. Insider does not endorse or condone the illegal use of VPNs.</p><a id=\"post-author_profile-link\" href=\"https://www.businessinsider.com/author/brendan-griffiths\" target=\"_blank\" rel=\"\">\n                                            \n                                                   \n                                        </a>\n                                        <a id=\"post-author_name-link\" class=\"post-author_link not-content-link\" href=\"https://www.businessinsider.com/author/brendan-griffiths\" target=\"_blank\" rel=\"\">\n                                                    <p class=\"post-author_name headline-bold\">Brendan Griffiths</p>\n                                                </a>\n                                                <p class=\"post-author_title headline-regular\">Senior Commerce Director</p>\n                                            \n                                                    <p>Brendan is the Senior Commerce Director at Insider Inc, having joined the company in early 2023. He oversees a wide range of our eCommerce content covering deals, popular sales events, How to Watch guides, and VPN articles. He also utilizes his extensive experience in SEO and Google algorithm updates to help improve content and rankings for a wide range of our shoppable buying guides, reviews, versus content, and more.</p>\n                        <p>He has over 16 years of online journalism experience and a UK University degree in Journalism and Film &amp; Media. Initially working as a freelance gaming journalist and eCommerce editor, he later joined Future Publishing in 2016 as their first-ever Deals Writer at TechRadar. Over the next six years, he became the Deals Editor at TechRadar, then Managing Editor of Hardware &amp; eCommerce at GamesRadar before moving over to Future's mobile tech division to become the eCommerce Content Director for Android Central, iMore, and Windows Central.</p>\n                        <span><a></a><p>Over the years, Brendan has written about a wide range of subjects. Be it covering game previews at GamesCom in Germany, listing the best <a href=\"https://www.businessinsider.com/guides/deals/amazon-prime-day\" rel=\"\">Amazon Prime Day deals</a> , reviewing gaming controllers, Kindles, and folding smartphones, or even international guides on buying a mattress - he's still quite annoyed that the UK and US have different sizes and names for them.</p></span><p>More recently, he's been covering international How to Watch guides on various sporting events like Formula 1, tennis, Champions League, cricket, or the hottest new movies and TV shows.&#160;&#160;</p>\n                        <p>Outside of work, you'll find Brendan trying to make a dent in various watchlists across streaming apps or playing games on his Series X or PS5, usually downloading (hoarding) yet more Game Pass games or grumbling about how open-world games should be scrapped for a solid 10-hour experience like the Uncharted series.</p>\n                                                    Read more\n                                                    Read less\n                                                </div>",
                            "text": "When you buy through our links, Insider may earn an affiliate commission. Learn more.\n\nLooking for a free F1 live stream? Not only can we help show you where to watch the British Formula 1 GP live, but this week's race options are free and include an English commentary option. Usually, all the free F1 live streams are found in Austria, Belgium, and so on. And they're still on this week, of course, but the UK's Channel 4 is keeping up the fine tradition of showing the British F1 live stream for free.\n\nWe've listed all the free countries below, but if you're not in one of those countries, you'll need to use a VPN (virtual private network) to watch along. A VPN simulates your device's location to be in a different country and gets around geo-block restrictions for a multitude of streaming services.\n\nIf you're unavailable when the race is happening, there's an extended highlights show a few hours later. Or you can see full replays on-demand with channels that offered the full race earlier. All for free.\n\nWhere to Watch a free British F1 live stream\n\nAs mentioned above, the UK, Belgium, Luxembourg, and Austria have free F1 live streams for the British GP today. UK coverage of the live race is usually exclusively shown on the paid Sky Sports service, but this weekend Channel 4 has it on TV or online for free. Channel 4's coverage begins 90 minutes before the race at 1:30 p.m. BST, but if you just want to see the race, just head on over by 3 p.m.\n\nIf you're not currently in one of the free countries highlighted above, you'll need to use your VPN to hop into another country digitally. Our preferred option of all the best VPN providers is ExpressVPN, which comes with a 30-day money-back guarantee if you're unsatisfied. Better yet, you can get an extra three months for free and save 49% on a subscription.\n\nHow to watch the British F1 live stream with a VPN\n\nSign up for a VPN if you don't have one.\n\nif you don't have one. Install it on the device you're using to watch the race.\n\nTurn it on and set it to a country with a free live stream.\n\nHead over to Channel 4 (UK)* | ORF 1 (Austria) | RTBF (Belgium) | RTL (Luxembourg) .\n\n| | | . *Create a free login for Channel 4.\n\nWatch on the live sections of the sites.\n\nRace start: Today, 10 a.m. ET / 3 p.m. BST / 4 p.m. CET / 12 a.m (Monday) AEST.\n\nExpressVPN Plan With its consistent performance, reliable security, and expansive global streaming features, ExpressVPN is the best VPN out there, excelling in every spec and offering many advanced features that makes it exceptional. Better yet, you can save up to 49% and get an extra three months for free today.\n\nAre there extended highlights later?\n\nIn the UK, Channel 4 has an extended highlights show a few hours after the race at 11:50 p.m. BST (6:50 p.m. ET). Coverage lasts two hours, so it feels like you're effectively seeing the whole race with only a few time-saving edits. You can tune in on the Channel 4 website online and use a VPN as outlined above to watch from outside the UK. If you're not free to watch it at this time, it will be available on-demand for free on the site, probably the day after. Although, the on-demand option is sometimes a shortened version, lasting just over an hour some weeks and closer to two hours on others.\n\nThis highlights show isn't just a one-off for the British GP, by the way. It's on every race weekend and is a great free option for English commentary if you can avoid the race result from earlier in the day.\n\nHow to watch an F1 live stream in the US\n\nESPN carries coverage of Formula 1 racing throughout the season, and there's plenty of it left to enjoy too. If you don't already have access to the channel, there are a couple of cord-cutting options for you to consider. Sling TV's Orange tier is usually $40 a month, but a special offer now sees that first month's price slashed to just $15.\n\nFubo TV also has ESPN but is much more expensive at $74.99 monthly. It's packed with channels, though, and is a favorite amongst cord-cutting sports fans. Better yet, you can get a 7-day free trial, so enjoy the race for free and cancel your sub before the week is up if you don't want to keep it.\n\nDeal icon An icon in the shape of a lightning bolt. Deal Sling TV Subscription Sling is one of the most affordable live TV streaming services you can sign up for. New members can now receive their first month for a discounted rate of just $20. Shop at Sling\n\nFubo TV (Pro Plan) FuboTV is one of the lesser-known streaming services, but it's worth considering for those who love entertainment and non-traditional sports programming. It's pricey, but there is currently a 7-day free trial, so you can take it for a spin first.\n\nNote: Using VPNs is illegal in certain countries, and using VPNs to access region-locked streaming content might constitute a breach of the terms of use for certain services. Insider does not endorse or condone the illegal use of VPNs.",
                            "top_image": "https://i.insider.com/64aa86ed6d7e02001af893c6?width=1200&format=jpeg",
                            "keywords": [],
                            "publish_date": 1688917684,
                            "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vZ3VpZGVzL3N0cmVhbWluZy93aGVyZS10by13YXRjaC1mMS1saXZlLXN0cmVhbS1mcmVlLWJyaXRpc2gtZ3AtMjAyM9IBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
                            "summary": ""
                        }
                    ]
                ]
            }
        ]
    ]
}
