{
    "News": [
        {
            "title": "MrBeast says he was invited to join submersible trip to Titanic wreckage",
            "article_html": "<div><p class=\"source inline-placeholder\">\n    \n      <p class=\"source__location\"></p>\n      <p class=\"source__text\">CNN</p>\n        &#160;&#8212;&#160;\n    \n</p>\n\n  <p class=\"paragraph inline-placeholder\">\n      YouTube star MrBeast said Sunday that he had been invited to join a submersible trip to the Titanic wreckage but declined.\n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      &#8220;I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,&#8221; MrBeast <a href=\"https://twitter.com/MrBeast/status/1672952297163218946/photo/1\" target=\"_blank\">tweeted </a>Sunday morning.\n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      Though he did not specify whether the invitation was for the fatal Titan trip that ended in a catastrophic <a href=\"https://www.cnn.com/americas/live-news/titanic-missing-sub-oceangate-06-22-23/\" target=\"_blank\">implosion</a>, MrBeast, whose real name is Jimmy Donaldson, shared a portion of text from someone asking him to join an exploration.\n  </p>\n\n  \n  <blockquote class=\"twitter__tweet\">\n    <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it <a href=\"https://t.co/bQUnaRiczA\" target=\"_blank\">pic.twitter.com/bQUnaRiczA</a></p>&#8212; MrBeast (@MrBeast) <a href=\"https://twitter.com/MrBeast/status/1672952297163218946?ref_src=twsrc%5Etfw\" target=\"_blank\">June 25, 2023</a></blockquote>\n\n  </blockquote>\n     \n\n\n  <p class=\"paragraph inline-placeholder\">\n      &#8220;Also, I&#8217;m going to the Titanic in a submarine late this month,&#8221; the individual wrote. &#8220;The team would be stoked to have you along.&#8221; \n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      CNN has reached out to representatives for Donaldson for comment.\n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      With more than 162 million current followers, <a href=\"https://www.youtube.com/channel/UCX6OQ3DkcsbYNE6H8uQQuVA\" target=\"_blank\">MrBeast</a> has the largest subscriber base of any creator on YouTube. His videos frequently feature stunts, competitions and massive philanthropic efforts.\n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      There is an ongoing investigation into what led to the implosion of the OceanGate Titan submersible, which killed all <a href=\"https://www.cnn.com/americas/live-news/titanic-missing-sub-oceangate-06-22-23/\" target=\"_blank\">five people</a> who were aboard during its descent to visit the wreckage of the Titanic last week. \n  </p>\n\n  <p class=\"paragraph inline-placeholder\">\n      Those killed were <a href=\"https://www.cnn.com/2023/06/21/business/stockton-rush-titanic-submersible/index.html\" target=\"_blank\">OceantGate CEO Stockton Rush</a>, British businessman Hamish Harding; French diver Paul-Henri Nargeolet; and Pakistani-born businessman Shahzada Dawood and his son, Suleman, who were British citizens.\n  </p>\n\n                </div>",
            "text": "CNN —\n\nYouTube star MrBeast said Sunday that he had been invited to join a submersible trip to the Titanic wreckage but declined.\n\n“I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,” MrBeast tweeted Sunday morning.\n\nThough he did not specify whether the invitation was for the fatal Titan trip that ended in a catastrophic implosion, MrBeast, whose real name is Jimmy Donaldson, shared a portion of text from someone asking him to join an exploration.\n\nI was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it pic.twitter.com/bQUnaRiczA — MrBeast (@MrBeast) June 25, 2023\n\n“Also, I’m going to the Titanic in a submarine late this month,” the individual wrote. “The team would be stoked to have you along.”\n\nCNN has reached out to representatives for Donaldson for comment.\n\nWith more than 162 million current followers, MrBeast has the largest subscriber base of any creator on YouTube. His videos frequently feature stunts, competitions and massive philanthropic efforts.\n\nThere is an ongoing investigation into what led to the implosion of the OceanGate Titan submersible, which killed all five people who were aboard during its descent to visit the wreckage of the Titanic last week.\n\nThose killed were OceantGate CEO Stockton Rush, British businessman Hamish Harding; French diver Paul-Henri Nargeolet; and Pakistani-born businessman Shahzada Dawood and his son, Suleman, who were British citizens.",
            "top_image": "https://media.cnn.com/api/v1/images/stellar/prod/230625153210-mr-beast-030423-restricted.jpg?c=16x9&q=w_800,c_fill",
            "authors": "Alli Rosenbloom",
            "keywords": [],
            "publish_date": 1687715939,
            "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNubi5jb20vMjAyMy8wNi8yNS9lbnRlcnRhaW5tZW50L21yYmVhc3QtdGl0YW4tc3VibWVyc2libGUvaW5kZXguaHRtbNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "The Hottest New Trend Is Claiming You Were Supposed to Be On the Titan Sub for Clout",
            "article_html": "<div><p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tEveryone has a  cousin or a boyfriend&#8217;s sister or a friend of a friend who claims to have almost been in, say, the Twin Towers during 9/11, or having narrowly escaped the jaws of death through a twist of providence that saved them from certain doom. On Sunday, a few days after news broke that the missing <a href=\"https://www.rollingstone.com/culture/culture-features/titanic-submersible-missing-searchers-heard-banging-1234774674/\">Titan submersible</a> that had captivated the world had imploded and <a href=\"https://www.rollingstone.com/culture/culture-news/titan-submersible-imploded-1234776381/\">claimed five lives</a>, YouTube giant MrBeast became the latest person to claim proximity to disaster by posting that he too had almost been on one of the vessel&#8217;s final trips. </p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\t&#8220;I was invited earlier this month to ride the <a href=\"https://www.rollingstone.com/t/titanic/\" id=\"auto-tag_titanic\">titanic</a> submarine, I said no,&#8221; MrBeast, aka Jimmy Donaldson, <a rel=\"nofollow\" href=\"https://twitter.com/MrBeast/status/1672952297163218946\" target=\"_blank\">tweeted</a> to his more than 21 million followers. &#8220;Kind of scary that I could have been on it.&#8221; To corroborate his claim, Donaldson added a screengrab of a text message purportedly sent from the person inviting him onto the vessel, which read simply, &#8220;Also, I&#8217;m going to the Titanic in a submarine later this month. The team would be stoked to have you along.&#8221; \n\n\t</p><p id=\"gpt-dsk-tab-article-inbody-uid0\" class=\" adw-300 adh-250\">\n\t\t \n\t</p>\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tThe response to Donaldson&#8217;s tweet was fairly mixed. While some, such as Reddit cofounder Alexis Ohanian, expressed their relief that Donaldson had declined the invite, others questioned the veracity of his claim to begin with. (The message in question was in blue, seemingly indicating that it was sent by Donaldson rather than received by him.)</p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tThough diving 13,000 feet to the remains of a ship that sunk over a century ago certainly is not outside the realm of possibility given the extreme nature of Donaldson&#8217;s content (previous videos are titled &#8220;I Survivied 50 Hours in Antarctica&#8221; and &#8220;I Paid a Real Assassin to Try and Kill Me&#8221;), we may never know for sure whether he actually may have been a passanger on the doomed submersible, as a representative for Donaldson did not immediately return a request for comment. However, he is far from the only person to make such a claim in the wake of the disaster.  </p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tBritish millionaire Chris Brown, a friend of victim Hamish Harding, gave an interview to the U.K. tabloid the Sun saying he was supposed to board the ill-fated submersible, only to back out after learning that the nine-and-a-half-foot vessel was <a rel=\"nofollow\" href=\"https://www.the-sun.com/news/8416758/missing-titanic-submarine-pulled-out-safety/\" target=\"_blank\">operated</a> by &#8220;computer game-style controllers&#8221;; a Nigerian politician also claimed on Instagram that he had fielded an invite from Harding, but had refused due to being &#8220;<a rel=\"nofollow\" href=\"https://www.instagram.com/p/Ct1S3nzsQ1w/?hl=en\" target=\"_blank\">tied down with national duties</a>.&#8221; Documentarian and former actor Ross Kemp also <a href=\"https://www.theguardian.com/world/2023/jun/24/ross-kemp-turned-down-trip-titanic-submersible-safety-fears\" rel=\"nofollow\" target=\"_blank\">claimed</a> he had turned down the opportunity to board the vessel to make a film last year, after his production company expressed concern over it not meeting safety standards. \n\n\n<h2 id=\"section-heading\" class=\"c-heading larva  recirculation-modules-heading lrv-u-flex u-font-family-theme-primary lrv-u-font-size-20 lrv-u-color-brand-primary lrv-u-text-transform-uppercase u-letter-spacing-012 lrv-u-position-relative lrv-u-padding-b-025 lrv-u-padding-b-1@desktop-xl lrv-u-padding-b-075@mobile-max\">\n\n\t\n\t\tEditor&#8217;s picks\n\t\n\t</h2>\n\n\t\n\t<p class=\"u-flex@desktop-xl a-children-border-vertical@mobile-max a-children-border-horizontal@desktop-xl a-children-border-vertical@tablet a-children-padding-l-1@desktop-xl lrv-u-margin-b-00 lrv-u-padding-l-00\">\n\t\t\t\t\t\n \n\t\t\t\t\t\n \n\t\t\t\t\t\n \n\t\t\t\t\t\n \n\t\t\t</p>\n</p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tYouTuber Jake Koehler, aka DALLYMYD, also <a rel=\"nofollow\" href=\"https://people.com/youtuber-shares-footage-canceled-titan-mission-before-sub-implosion-7552978\" target=\"_blank\">posted footage</a> of himself on a previous mission with OceanGate founder <a href=\"https://www.rollingstone.com/t/stockton-rush/\" id=\"auto-tag_stockton-rush\">Stockton Rush</a> and adventurer Paul-Henri Nergolet, both of whom died on the vessel last week; while he had planned to embark on a deep-sea dive, he says, the trip was ultimately canceled due to poor weather conditions. &#8220;Who knows, maybe we would have left that platform and maybe we would have imploded,&#8221; Koehler said in his video. An influencer named Karine Smith also posted a video on TikTok purporting she had been booked for that <a rel=\"nofollow\" href=\"https://www.tiktok.com/@karinesmith1?lang=en\" target=\"_blank\">trip</a>, though comments were widely split between people who thought she was joking and those outraged she could make such a claim (or somewhere in between &#8212; &#8220;yo darm lie but I enjoy your story,&#8221; one person wrote. Smith did not immediately return a message requesting clarification.) </p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tIndeed, for a select group of individuals (seemingly, those with a hefty investment portfolio and/or a large and monetizable social media following), it seems it has become somewhat of a trend to claim proximity to the <a href=\"https://www.rollingstone.com/t/titan/\" id=\"auto-tag_titan\">Titan</a> submersible implosion: as one person on Twitter wryly <a rel=\"nofollow\" href=\"https://twitter.com/speham11/status/1673288454996631554\" target=\"_blank\">claimed</a>, such a narrative has become &#8220;the 9/11 story time for rich people.&#8221; \n\n\t</p><p id=\"gpt-dsk-tab-article-inbody2-uid1\" class=\" adw-301 adh-250\">\n\t\t \n\t</p>\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tIt&#8217;s certainly not unprecedented for people to claim to have had close brushes with high-profile disasters (see: the incredibly maudlin <a rel=\"nofollow\" href=\"https://www.mirror.co.uk/3am/celebrity-news/celebrities-who-almost-died-911-20007661\" target=\"_blank\">listicles</a> featuring celebrities like Mark Wahlberg, Seth MacFarlane, and Sarah Ferguson, who were either booked on a doomed flight or were supposed to be in the Twin Towers the morning of 9/11). Yet in this case it seems a little bit unusual, as the passengers of the Titan submersible were roundly derided on social media as reckless, overly entitled billionaires as the story unfolded. It&#8217;s a bit perplexing as to why someone like MrBeast, who has faced endless criticism for his attention-grabbing stunts and splashy cash giveaways, would want to claim proximity to a disaster that has become synonymous with untrammeled hubris and greed. </p>\n\n\n\n<p class=\"paragraph larva // lrv-u-line-height-copy  lrv-a-font-body-l   \">\n\tNow that the sad fates of the passengers have been officially revealed, the massive interest in the story will likely start to wind down (save for the already-slated <a rel=\"nofollow\" href=\"https://www.dexerto.com/tv-movies/how-to-watch-titanic-submarine-documentary-lost-at-sea-streaming-2186205/\" target=\"_blank\">documentaries</a> and podcasts obsessively recounting the incident). What is less likely to dissipate, however, is the eternal desire for clout. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</div>",
            "text": "Everyone has a cousin or a boyfriend’s sister or a friend of a friend who claims to have almost been in, say, the Twin Towers during 9/11, or having narrowly escaped the jaws of death through a twist of providence that saved them from certain doom. On Sunday, a few days after news broke that the missing Titan submersible that had captivated the world had imploded and claimed five lives, YouTube giant MrBeast became the latest person to claim proximity to disaster by posting that he too had almost been on one of the vessel’s final trips.\n\n“I was invited earlier this month to ride the titanic submarine, I said no,” MrBeast, aka Jimmy Donaldson, tweeted to his more than 21 million followers. “Kind of scary that I could have been on it.” To corroborate his claim, Donaldson added a screengrab of a text message purportedly sent from the person inviting him onto the vessel, which read simply, “Also, I’m going to the Titanic in a submarine later this month. The team would be stoked to have you along.”\n\nThe response to Donaldson’s tweet was fairly mixed. While some, such as Reddit cofounder Alexis Ohanian, expressed their relief that Donaldson had declined the invite, others questioned the veracity of his claim to begin with. (The message in question was in blue, seemingly indicating that it was sent by Donaldson rather than received by him.)\n\nThough diving 13,000 feet to the remains of a ship that sunk over a century ago certainly is not outside the realm of possibility given the extreme nature of Donaldson’s content (previous videos are titled “I Survivied 50 Hours in Antarctica” and “I Paid a Real Assassin to Try and Kill Me”), we may never know for sure whether he actually may have been a passanger on the doomed submersible, as a representative for Donaldson did not immediately return a request for comment. However, he is far from the only person to make such a claim in the wake of the disaster.\n\nBritish millionaire Chris Brown, a friend of victim Hamish Harding, gave an interview to the U.K. tabloid the Sun saying he was supposed to board the ill-fated submersible, only to back out after learning that the nine-and-a-half-foot vessel was operated by “computer game-style controllers”; a Nigerian politician also claimed on Instagram that he had fielded an invite from Harding, but had refused due to being “tied down with national duties.” Documentarian and former actor Ross Kemp also claimed he had turned down the opportunity to board the vessel to make a film last year, after his production company expressed concern over it not meeting safety standards. Editor’s picks\n\nYouTuber Jake Koehler, aka DALLYMYD, also posted footage of himself on a previous mission with OceanGate founder Stockton Rush and adventurer Paul-Henri Nergolet, both of whom died on the vessel last week; while he had planned to embark on a deep-sea dive, he says, the trip was ultimately canceled due to poor weather conditions. “Who knows, maybe we would have left that platform and maybe we would have imploded,” Koehler said in his video. An influencer named Karine Smith also posted a video on TikTok purporting she had been booked for that trip, though comments were widely split between people who thought she was joking and those outraged she could make such a claim (or somewhere in between — “yo darm lie but I enjoy your story,” one person wrote. Smith did not immediately return a message requesting clarification.)\n\nIndeed, for a select group of individuals (seemingly, those with a hefty investment portfolio and/or a large and monetizable social media following), it seems it has become somewhat of a trend to claim proximity to the Titan submersible implosion: as one person on Twitter wryly claimed, such a narrative has become “the 9/11 story time for rich people.”\n\nIt’s certainly not unprecedented for people to claim to have had close brushes with high-profile disasters (see: the incredibly maudlin listicles featuring celebrities like Mark Wahlberg, Seth MacFarlane, and Sarah Ferguson, who were either booked on a doomed flight or were supposed to be in the Twin Towers the morning of 9/11). Yet in this case it seems a little bit unusual, as the passengers of the Titan submersible were roundly derided on social media as reckless, overly entitled billionaires as the story unfolded. It’s a bit perplexing as to why someone like MrBeast, who has faced endless criticism for his attention-grabbing stunts and splashy cash giveaways, would want to claim proximity to a disaster that has become synonymous with untrammeled hubris and greed.\n\nNow that the sad fates of the passengers have been officially revealed, the massive interest in the story will likely start to wind down (save for the already-slated documentaries and podcasts obsessively recounting the incident). What is less likely to dissipate, however, is the eternal desire for clout.",
            "top_image": "https://www.rollingstone.com/wp-content/uploads/2023/06/Ocean-Gate-Titanic.jpg?crop=4px%2C146px%2C1796px%2C1011px&resize=1600%2C900",
            "authors": "Ej Dickson",
            "keywords": [],
            "publish_date": 1687793938,
            "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnJvbGxpbmdzdG9uZS5jb20vY3VsdHVyZS9jdWx0dXJlLW5ld3MvdGl0YW4tc3VibWVyc2libGUtbXJiZWFzdC1jbG91dC0xMjM0Nzc4MDgyL9IBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTube Star MrBeast Says He Was Invited to Join 'Titanic' Submersible Trip: 'I Said No'",
            "article_html": "<div><p id=\"mntl-sc-block_1-0\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nYouTube star <a href=\"https://twitter.com/MrBeast\">MrBeast</a> says he was invited to join explorers on the Titan submersible but ultimately turned down the offer to do so.<br>\n</p> \n<p id=\"mntl-sc-block_1-0-1\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-2\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nThe content creator and philanthropist, whose real name is Jimmy Donaldson, wrote on Twitter Sunday that he was offered a spot on a trip to see the Titanic wreckage.\n</p> \n<p id=\"mntl-sc-block_1-0-3\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-4\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n\"I was invited earlier this month to ride the Titanic submarine, I said no,\" MrBeast, 25, tweeted. \"Kind of scary that I could have been on it.\"<br>\n</p> \n<p id=\"mntl-sc-block_1-0-5\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-6\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nThough he did not specify if he was invited on the Titan trip that led to the implosion of the submersible, the creator shared a fragment of a text exchange he seemingly had with someone asking him to join.\n</p> \n<p id=\"mntl-sc-block_1-0-7\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-8\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n\"Also, I'm going to the Titanic in a submarine late this month,\" the person wrote. \"The team would be stoked to have you along.\"\n</p> \n<p id=\"mntl-sc-block_1-0-9\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-10\" class=\"comp mntl-sc-block-embed--twitter mntl-sc-block people-sc-block-embed mntl-sc-block-embed\">\n</p> \n<p id=\"mntl-sc-block_1-0-11\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-12\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nThe YouTuber, known for documenting his philanthropic efforts among other things, revealed his decision to not board the submersible just days after OceanGate announced that the <a href=\"https://people.com/loved-ones-five-titan-sub-victims-pay-tribute-7552447\">five people onboard the Titan submersible had died</a>.\n</p> \n<p id=\"mntl-sc-block_1-0-13\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-14\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n\"We now believe that our CEO Stockton Rush, Shahzada Dawood and his son Suleman Dawood, Hamish Harding, and Paul-Henri Nargeolet, have sadly been lost,\" the company said in a statement obtained by PEOPLE on Thursday, following the U.S. Coast Guard's revelation that an ROV discovered debris consistent with a catastrophic loss of pressure in the Titan chamber.\n</p> \n<p id=\"mntl-sc-block_1-0-15\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-16\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n\"These men were true explorers who shared a distinct spirit of adventure, and a deep passion for exploring and protecting the world&#8217;s oceans. Our hearts are with these five souls and every member of their families during this tragic time. We grieve the loss of life and joy they brought to everyone they knew,\" the statement continued.\n</p> \n<p id=\"mntl-sc-block_1-0-17\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-19\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n\n<img width=\"800\" height=\"534\" alt=\"An undated photo shows tourist submersible belongs to OceanGate begins to descent at a sea. Search and rescue operations continue by US Coast Guard in Boston after a tourist submarine bound for the Titanic's wreckage site went missing off the southeastern coast of Canada\" class=\"lazyload universal-image__image\" id=\"mntl-sc-block-image_1-0-1\">\n\n<img src=\"https://people.com/thmb/7gx7SrReNTB6I01gfSV7sM1Vqi4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/ocengate-titan-sub-b47c39af970a49a7b1b032779d243dca.jpg\" width=\"800\" height=\"534\" class=\"img--noscript universal-image__image\" alt=\"An undated photo shows tourist submersible belongs to OceanGate begins to descent at a sea. Search and rescue operations continue by US Coast Guard in Boston after a tourist submarine bound for the Titanic's wreckage site went missing off the southeastern coast of Canada\">\n\n\n<p class=\"figure-article-caption-text\">An OceanGate submersible.</p>\n<span class=\"figure-article-caption-owner\"><p>Ocean Gate / Handout/Anadolu Agency via Getty Images</p></span> \n \n<p id=\"mntl-sc-block_1-0-21\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nTitan&#160;initially <a href=\"https://people.com/titanic-bound-submarine-goes-missing-7549540\">went missing</a>&#160;last Sunday while venturing into the depths of the North Atlantic Ocean to view the&#160;Titanic&#160;wreckage, and it &#8220;lost all communication&#8221; with Canadian expedition vessel Polar Prince &#8220;approximately 1 hour and 45 minutes&#8221; into its dive, United States Coast Guard Captain Jamie Frederick&#160;said at the time.\n</p> \n<p id=\"mntl-sc-block_1-0-22\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-23\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nYouTuber Jake Koehler, best known as DALLYMYD, <a href=\"https://people.com/youtuber-shares-footage-canceled-titan-mission-before-sub-implosion-7552978\">shared his own footage</a> this week of his canceled&#160;Titan&#160;expedition with OceanGate CEO Stockton Rush and&#160;Titanic&#160;expert&#160;<a href=\"https://people.com/mr-titanic-paul-henry-nargeolet-was-aware-of-sub-risks-7550516\">Paul-Henri Nargeolet</a>&#160;&#8212; both of whom died on the submersible. The events in his clip took place \"just days before the tragedy,\" he wrote.\n</p> \n<p id=\"mntl-sc-block_1-0-24\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-25\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n&#8220;With the whole world watching the rescue efforts of the missing submarine around the&#160;Titanic, I thought I'd share my experience of Mission III just a few weeks ago,&#8221; Koehler said in the opening of the video, which he posted on Friday.\n</p> \n<p id=\"mntl-sc-block_1-0-26\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-27\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n&#8220;And if my dive wasn't canceled, it could have been me inside that submarine today,&#8221; he added.\n</p> \n<p id=\"mntl-sc-block_1-0-28\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-29\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nAs Koehler explained, he wishes he \"could go back in time and just tell them not to do it, but this is real life.\"\n</p> \n<p id=\"mntl-sc-block_1-0-30\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-31\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n<strong>Never miss a story &#8212; sign up for&#160;<a href=\"https://forms.dotdashmeredith.com/people-news-inline\" rel=\"nofollow\">PEOPLE's free daily newsletter</a>&#160;to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.</strong>\n</p> \n<p id=\"mntl-sc-block_1-0-32\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-33\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nLas Vegas financier Jay Bloom and his son Sean Bloom were also hoping to take part in the &#8220;bucket list&#8221; Titan trip last week, but as 20-year-old Sean <a href=\"https://people.com/sons-warning-titan-sub-safety-saved-him-father-7552962\">told PEOPLE</a>, his father \"didn&#8217;t go\" because he warned him that the \"submarine cannot survive going that deep in the ocean.\"\n</p> \n<p id=\"mntl-sc-block_1-0-34\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-35\" class=\"comp mntl-sc-block mntl-sc-block-html\">\n&#8220;That is a small submarine, with five people crammed inside,&#8221; Sean said. &#8220;It just felt super unsafe. Something was telling me this was not the move.&#8221;\n</p> \n<p id=\"mntl-sc-block_1-0-36\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-37\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nJay told PEOPLE that while OceanGate CEO Stockton Rush was a \"good guy\" when they met with him before their potential trip, \"He didn't want to hear anything that conflicted with his world view, and he would just dismiss it.&#8221;\n</p> \n<p id=\"mntl-sc-block_1-0-38\" class=\"comp mntl-sc-block mntl-sc-block-adslot mntl-block\"></p> \n<p id=\"mntl-sc-block_1-0-39\" class=\"comp mntl-sc-block mntl-sc-block-html\">\nHe added that he felt the CEO did not think it would be dangerous for them to make the trip. &#8220;He was so passionate about this project, and he was such a believer. He drank his own Kool-Aid, and there was just no talking him out of it,&#8221; Jay explained. &#8220;I don't think Stockton understood the risk himself, or didn't want to understand the risk.&#8221;<br>\n</p> \n</div>",
            "text": "YouTube star MrBeast says he was invited to join explorers on the Titan submersible but ultimately turned down the offer to do so.\n\n\n\nThe content creator and philanthropist, whose real name is Jimmy Donaldson, wrote on Twitter Sunday that he was offered a spot on a trip to see the Titanic wreckage.\n\n\"I was invited earlier this month to ride the Titanic submarine, I said no,\" MrBeast, 25, tweeted. \"Kind of scary that I could have been on it.\"\n\n\n\nThough he did not specify if he was invited on the Titan trip that led to the implosion of the submersible, the creator shared a fragment of a text exchange he seemingly had with someone asking him to join.\n\n\"Also, I'm going to the Titanic in a submarine late this month,\" the person wrote. \"The team would be stoked to have you along.\"\n\nThe YouTuber, known for documenting his philanthropic efforts among other things, revealed his decision to not board the submersible just days after OceanGate announced that the five people onboard the Titan submersible had died.\n\n\"We now believe that our CEO Stockton Rush, Shahzada Dawood and his son Suleman Dawood, Hamish Harding, and Paul-Henri Nargeolet, have sadly been lost,\" the company said in a statement obtained by PEOPLE on Thursday, following the U.S. Coast Guard's revelation that an ROV discovered debris consistent with a catastrophic loss of pressure in the Titan chamber.\n\n\"These men were true explorers who shared a distinct spirit of adventure, and a deep passion for exploring and protecting the world’s oceans. Our hearts are with these five souls and every member of their families during this tragic time. We grieve the loss of life and joy they brought to everyone they knew,\" the statement continued.\n\nAn OceanGate submersible. Ocean Gate / Handout/Anadolu Agency via Getty Images\n\nTitan initially went missing last Sunday while venturing into the depths of the North Atlantic Ocean to view the Titanic wreckage, and it “lost all communication” with Canadian expedition vessel Polar Prince “approximately 1 hour and 45 minutes” into its dive, United States Coast Guard Captain Jamie Frederick said at the time.\n\nYouTuber Jake Koehler, best known as DALLYMYD, shared his own footage this week of his canceled Titan expedition with OceanGate CEO Stockton Rush and Titanic expert Paul-Henri Nargeolet — both of whom died on the submersible. The events in his clip took place \"just days before the tragedy,\" he wrote.\n\n“With the whole world watching the rescue efforts of the missing submarine around the Titanic, I thought I'd share my experience of Mission III just a few weeks ago,” Koehler said in the opening of the video, which he posted on Friday.\n\n“And if my dive wasn't canceled, it could have been me inside that submarine today,” he added.\n\nAs Koehler explained, he wishes he \"could go back in time and just tell them not to do it, but this is real life.\"\n\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories.\n\nLas Vegas financier Jay Bloom and his son Sean Bloom were also hoping to take part in the “bucket list” Titan trip last week, but as 20-year-old Sean told PEOPLE, his father \"didn’t go\" because he warned him that the \"submarine cannot survive going that deep in the ocean.\"\n\n“That is a small submarine, with five people crammed inside,” Sean said. “It just felt super unsafe. Something was telling me this was not the move.”\n\nJay told PEOPLE that while OceanGate CEO Stockton Rush was a \"good guy\" when they met with him before their potential trip, \"He didn't want to hear anything that conflicted with his world view, and he would just dismiss it.”\n\nHe added that he felt the CEO did not think it would be dangerous for them to make the trip. “He was so passionate about this project, and he was such a believer. He drank his own Kool-Aid, and there was just no talking him out of it,” Jay explained. “I don't think Stockton understood the risk himself, or didn't want to understand the risk.”\n\n",
            "top_image": "https://people.com/thmb/LXAgyG5hDbdZhLOIHZz0PqpGi04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(774x311:776x313)/MRBeast-062523-09442dabffc44d2eabb17e677bc08e7b.jpg",
            "authors": "Brenton Blanchet",
            "keywords": [],
            "publish_date": 1687964259,
            "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vcGVvcGxlLmNvbS95b3V0dWJlci1tcmJlYXN0LXNheXMtaGUtd2FzLWludml0ZWQtb24tdGl0YW5pYy1zdWItNzU1MzAxN9IBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "MrBeast Says He Turned Down Invitation to Join Titanic Submersible Voyage: ‘Kind of Scary That I Could Have Been on It’",
            "article_html": "<div><img class=\"caas-img has-preview\" alt=\"\" src=\"https://s.yimg.com/ny/api/res/1.2/nkOVB6.yfoZ8PynK.QqW1A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://media.zenfs.com/en/variety.com/09281932e5999043dd35694e1e9d0fa6\"><p>MrBeast, the hugely popular YouTube creator known for his over-the-top stunts and challenges, said he had been invited on OceanGate&#8217;s submersible earlier in June but ultimately declined the offer.</p><p>&#8220;I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,&#8221; MrBeast <a href=\"https://twitter.com/MrBeast/status/1672952297163218946\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">tweeted</a> Sunday morning.</p><p><strong>More from Variety</strong></p><p id=\"sda-INARTICLE\"></p><p>On Sunday, June 18, the Titan submersible operated by OceanGate that was <a href=\"https://variety.com/2023/film/global/titanic-tourist-submarine-missing-1235648554/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">diving to the wreckage of the Titanic in the Atlantic Ocean lost contact</a> with its surface support ship. On Thursday, <a href=\"https://variety.com/2023/film/news/titan-submarine-dead-missing-titanic-1235649790/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">the company issued a statement</a> that all five members on board were presumed to have died after the sub had a &#8220;catastrophic implosion.&#8221;</p><p>It&#8217;s not clear who may have invited MrBeast to come aboard the OceanGate vessel. Along with his tweet, MrBeast included an excerpt of a text message he apparently sent to someone saying, &#8220;I&#8217;m going to the Titanic in a submarine late this month. The team would be stoked to have you along.&#8221;</p><blockquote class=\"twitter-tweet\"><p class=\"caas-card-loader small fixed-height\"></p><p>I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it <a href=\"https://t.co/bQUnaRiczA\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">pic.twitter.com/bQUnaRiczA</a></p><p>&#8212; MrBeast (@MrBeast) <a href=\"https://twitter.com/MrBeast/status/1672952297163218946?ref_src=twsrc%5Etfw\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">June 25, 2023</a></p></blockquote><p>MrBeast (real name: Jimmy Donaldson)&#160;is the most-followed individual YouTube creator on the platform, with more than 162 million subscribers currently.</p><p>MrBeast is estimated to be <a href=\"https://variety.com/2022/digital/news/mrbeast-highest-earning-youtube-star-54-million-1235154580/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">the highest-earning creator on YouTube</a>, amassing a fanbase for his big-money giveaways and stunts &#8212; including his 2021 viral reenactment of Netflix hit &#8220;Squid Game,&#8221; which awarded the winner a $446,000 prize &#8212; and an array of charitable initiatives.</p><p class=\"caas-readmore caas-readmore-collapse\"></p><p>The OceanGate Titan disaster captivated public attention across the globe. The event <a href=\"https://variety.com/2023/film/global/james-cameron-titanic-submersible-oceangate-1235650531/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">drew critical commentary from &#8220;Titanic&#8221; director James Cameron</a>, who claimed that those in the diving community had been &#8220;very concerned&#8221; about the safety of the sub. In <a href=\"https://variety.com/2023/film/global/james-cameron-titanic-submersible-oceangate-1235650531/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">response</a>, OceanGate co-founder Guillermo S&#246;hnlein said in part, &#8220;I know from firsthand experience that we were extremely committed to safety and risk mitigation was a key part of the company culture.&#8221;</p><p><strong>Best of Variety</strong></p><p>Sign up for <a href=\"https://pages.email.variety.com/signup/?source=yahoo\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">Variety&#8217;s Newsletter</a>. For the latest news, follow us on <a href=\"http://bit.ly/2MGsXik\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">Facebook</a>, <a href=\"http://bit.ly/2Bnlwsf\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">Twitter</a>, and <a href=\"http://bit.ly/2TqsJ1m\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">Instagram</a>.</p><p><a href=\"https://variety.com/2023/digital/news/mrbeast-titanic-submersible-voyage-invitation-1235653993/\" rel=\"nofollow noopener\" target=\"_blank\" class=\"link \">Click here to read the full article. </a></p></div>",
            "text": "MrBeast, the hugely popular YouTube creator known for his over-the-top stunts and challenges, said he had been invited on OceanGate’s submersible earlier in June but ultimately declined the offer.\n\n“I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,” MrBeast tweeted Sunday morning.\n\nMore from Variety\n\nOn Sunday, June 18, the Titan submersible operated by OceanGate that was diving to the wreckage of the Titanic in the Atlantic Ocean lost contact with its surface support ship. On Thursday, the company issued a statement that all five members on board were presumed to have died after the sub had a “catastrophic implosion.”\n\nIt’s not clear who may have invited MrBeast to come aboard the OceanGate vessel. Along with his tweet, MrBeast included an excerpt of a text message he apparently sent to someone saying, “I’m going to the Titanic in a submarine late this month. The team would be stoked to have you along.”\n\nI was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it pic.twitter.com/bQUnaRiczA — MrBeast (@MrBeast) June 25, 2023\n\nMrBeast (real name: Jimmy Donaldson) is the most-followed individual YouTube creator on the platform, with more than 162 million subscribers currently.\n\nMrBeast is estimated to be the highest-earning creator on YouTube, amassing a fanbase for his big-money giveaways and stunts — including his 2021 viral reenactment of Netflix hit “Squid Game,” which awarded the winner a $446,000 prize — and an array of charitable initiatives.\n\nStory continues\n\nThe OceanGate Titan disaster captivated public attention across the globe. The event drew critical commentary from “Titanic” director James Cameron, who claimed that those in the diving community had been “very concerned” about the safety of the sub. In response, OceanGate co-founder Guillermo Söhnlein said in part, “I know from firsthand experience that we were extremely committed to safety and risk mitigation was a key part of the company culture.”\n\nBest of Variety\n\nSign up for Variety’s Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.\n\nClick here to read the full article.",
            "top_image": "https://media.zenfs.com/en/variety.com/75b1dcfc1c1c39b4ad9454d1c42bb0f1",
            "authors": "Todd Spangler",
            "keywords": [],
            "publish_date": 1687964261,
            "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnlhaG9vLmNvbS9lbnRlcnRhaW5tZW50L21yYmVhc3Qtc2F5cy10dXJuZWQtZG93bi1pbnZpdGF0aW9uLTE0MjU0NjEzMy5odG1s0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTuber MrBeast claims he was invited on doomed Titanic sub — but declined",
            "article_html": "<div> \n\t\t\n\n\n<p>MrBeast, a hugely popular YouTube star who boasts over 160 million subscribers on the video platform, claims he was invited to be on the doomed Titan submersible that imploded en route to the Titanic wreckage &#8212; but he declined.</p>\n\n\n\n<p>&#8220;I was invited earlier this month to ride the titanic submarine, I said no,&#8221; MrBeast, whose real name is Jimmy Donaldson, <a href=\"https://twitter.com/MrBeast/status/1672952297163218946\" target=\"_blank\" rel=\"noreferrer noopener\">tweeted Sunday</a>.</p>\n\n\n\n<p>&#8220;Kind of scary that I could have been on it.&#8221;</p>\n\n\n\n<p>The 25-year-old online sensation, known for his over-the-top stunts and challenges, also shared a cropped image of what appears to be a text message inviting him on the trip.</p>\n\n\n\n<p>&#8220;Also, I&#8217;m going to the Titanic in a submarine late this month. The team would be stoked to have you along,&#8221; part of the apparent invitation said.</p>\n\n\n\n<p>Additional details, such as who sent the text message, were not included.&#160;</p>\n\n\n\n<p>Had he agreed to the underwater expedition, MrBeast would have joined an already eclectic group of adventurers &#8212; famed French Navy commander-turned-Titanic expert Paul-Henri Nargeolet; billionaire British explorer Hamish Harding; billionaire Pakistani businessman Shahzada Dawood and his 19-year-old son, Sulaiman; and OceanGate Expeditions&#8217; CEO and founder, Stockton Rush.</p>\n\n\n\n<p>MrBeast is the most-subscribed-to personality on YouTube, with 162 million subscribers. Last year, Forbes <a href=\"https://www.forbes.com/sites/chloesorvino/2022/11/30/could-mrbeast-be-the-first-youtuber-billionaire/?sh=1f6ec7e8191a\" target=\"_blank\" rel=\"noreferrer noopener\">estimated the content creator&#8217;s net worth</a> to be some $500 million. </p>\n\n\n\n\n<img width=\"985\" height=\"267\" src=\"https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000013194260.jpg\" alt=\"YouTuber MrBeast claims he was invited to be one of the passengers aboard the doomed Titan submersible.\" class=\"wp-image-27629367\">YouTuber MrBeast claims he was invited to be one of the passengers aboard the doomed Titan submersible.<p class=\"credit\">Twitter</p>\n\n\n\n\n<img width=\"1024\" height=\"768\" src=\"https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000012909221-2.jpg?w=1024\" alt=\"Workers preparing OceanGate Expeditions' Titan sub. \" class=\"wp-image-27629375\">Workers preparing OceanGate Expeditions&#8217; Titan sub. <p class=\"credit\">Facebook/OceanGate Expeditions</p>\n\n\n\n<p>The group descended toward the&#160;<a href=\"https://nypost.com/2023/06/23/titanic-director-james-cameron-says-search-for-missing-sub-was-nightmarish-charade/\" target=\"_blank\" rel=\"noreferrer noopener\">depths of the Atlantic</a>&#160;early June 18, for what was supposed to be the Titan sub&#8217;s third-annual expedition to the Titanic wreckage. </p>\n\n\n\n<p>However, just an hour and 45 minutes into the daring underwater journey, the submersible lost contact with its mother ship, the Polar Prince.</p>\n\n\n\n \n\n\n\n<p>On Thursday, the US Coast Guard revealed that <a href=\"https://nypost.com/2023/06/22/tiktok-videos-depict-what-may-have-happened-during-titanic-subs-catastrophic-implosion/\">the Titan suffered a &#8220;catastrophic implosion&#8221;</a> after discovering multiple debris fields earlier Thursday. All five passengers on board <a href=\"https://nypost.com/2023/06/23/can-the-bodies-from-the-titanic-sub-be-recovered-following-the-implosion/\">were killed instantly</a>.</p>\n<p id=\"wpcom-liveblog-container\"></p>\t\t\t\t\t\t</div>",
            "text": "MrBeast, a hugely popular YouTube star who boasts over 160 million subscribers on the video platform, claims he was invited to be on the doomed Titan submersible that imploded en route to the Titanic wreckage — but he declined.\n\n“I was invited earlier this month to ride the titanic submarine, I said no,” MrBeast, whose real name is Jimmy Donaldson, tweeted Sunday.\n\n“Kind of scary that I could have been on it.”\n\nThe 25-year-old online sensation, known for his over-the-top stunts and challenges, also shared a cropped image of what appears to be a text message inviting him on the trip.\n\n“Also, I’m going to the Titanic in a submarine late this month. The team would be stoked to have you along,” part of the apparent invitation said.\n\nAdditional details, such as who sent the text message, were not included.\n\nHad he agreed to the underwater expedition, MrBeast would have joined an already eclectic group of adventurers — famed French Navy commander-turned-Titanic expert Paul-Henri Nargeolet; billionaire British explorer Hamish Harding; billionaire Pakistani businessman Shahzada Dawood and his 19-year-old son, Sulaiman; and OceanGate Expeditions’ CEO and founder, Stockton Rush.\n\nMrBeast is the most-subscribed-to personality on YouTube, with 162 million subscribers. Last year, Forbes estimated the content creator’s net worth to be some $500 million.\n\nYouTuber MrBeast claims he was invited to be one of the passengers aboard the doomed Titan submersible. Twitter\n\nWorkers preparing OceanGate Expeditions’ Titan sub. Facebook/OceanGate Expeditions\n\nThe group descended toward the depths of the Atlantic early June 18, for what was supposed to be the Titan sub’s third-annual expedition to the Titanic wreckage.\n\nHowever, just an hour and 45 minutes into the daring underwater journey, the submersible lost contact with its mother ship, the Polar Prince.\n\nOn Thursday, the US Coast Guard revealed that the Titan suffered a “catastrophic implosion” after discovering multiple debris fields earlier Thursday. All five passengers on board were killed instantly.",
            "top_image": "https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000013194863.jpg?quality=75&strip=all&w=1024",
            "authors": "Social Links For Stephanie Pagones",
            "keywords": [],
            "publish_date": 1687712711,
            "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA2LzI1L3lvdXR1YmVyLW1yYmVhc3QtY2xhaW1zLWhlLXdhcy1pbnZpdGVkLW9uLWRvb21lZC10aXRhbmljLXN1Yi_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTube star MrBeast says he turned down trip on doomed Titanic submersible",
            "article_html": "<div><p>MrBeast, the most-followed person on YouTube, says he turned down an invitation to travel on the doomed Titanic submersible.</p><p>Five people were killed when OceanGate's <strong><a href=\"https://news.sky.com/topic/titanic-submersible-10735\" target=\"_blank\">Titan submersible</a></strong> imploded during a trip to the Titanic wreck last week.</p><p class=\"OUTBRAIN\">\n    </p>\n<p>In a tweet, MrBeast - whose real name is Jimmy Donaldson - shared a text message which he said showed he was invited on to the vessel.</p>\n    <img class=\"sdc-article-image__item\" src=\"https://e3.365dm.com/23/06/768x432/skynews-mr-beast-youtube_6198622.jpg?20230625163913\" alt=\"Mr. Beast attends the 37th annual Nickelodeon Kids&amp;#39; Choice Awards at the Microsoft Theater in Los Angeles on Saturday, March 4, 2023\">\n    \n        <p class=\"sdc-article-image__visually-hidden\">Image:</p>\n        <p class=\"sdc-article-image__caption-text\">MrBeast. Pic: Greg Grudt/UPI/Shutterstock\n        </p>\n      \n  \n<p class=\"sdc-article-tweet__content\">\n             \n        </p>\n    <p class=\"ui-consent-roadblock-body__title\">Twitter</p>\n            <span class=\"ui-consent-roadblock-body__description\"><p class=\"ui-consent-roadblock-body__vendor-title\">Twitter</p>, which may be using cookies and other technologies.\n                To show you this content, we need your permission to use cookies.\n                You can use the buttons below to amend your preferences to enable <p class=\"ui-consent-roadblock-body__vendor-title\">Twitter</p> cookies or to allow those cookies just once.\n                You can change your settings at any time via the <a></a><p>This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the <a href=\"#privacy-options\">Privacy Options</a> </p></span><p class=\"ui-consent-roadblock-body__description\">\n                Unfortunately we have been unable to verify if you have consented to <p class=\"ui-consent-roadblock-body__vendor-title\">Twitter</p> cookies.\n                To view this content you can use the button below to allow <p class=\"ui-consent-roadblock-body__vendor-title\">Twitter</p> cookies for this session only.\n            </p>\n\n            <a href=\"#\" class=\"ui-consent-roadblock-body__link ui-consent-roadblock-permanently\">Enable Cookies</a>\n                <a href=\"#\" class=\"ui-consent-roadblock-body__link ui-consent-roadblock-once\">Allow Cookies Once</a>\n            <p>He wrote alongside the image: \"I was invited earlier this month to ride the titanic submarine, I said no.</p><p>\"Kind of scary that I could have been on it\".</p><p></p>\n        \n            <p class=\"sdc-site-au__teads\" id=\"teads\"></p>\n        <p>It is not clear who was inviting MrBeast on to the submersible.</p><p>The American - who has 162 million YouTube subscribers - is known for his big-money competitions and expensive stunts, including his own version of Squid Game, paying an assassin to try and kill him, and getting buried alive.</p><p>His revelation comes a day after it was revealed documentary maker and former EastEnders actor <strong><a href=\"https://news.sky.com/story/ross-kemp-turned-down-oceangate-submersible-trip-to-titanic-wreck-over-safety-fears-12908884\" target=\"_blank\">Ross Kemp turned down</a></strong> the chance to ride the submersible.</p><p>Kemp was planning to take part in the deep diving mission last year for a programme to mark the 110th anniversary of the sinking of the <strong><a href=\"https://news.sky.com/topic/titanic-10703\" target=\"_blank\">ill-fated liner</a></strong>.</p>    <p></p>\n                                    \n                                        <p class=\"sdc-site-au__mpu-1\" id=\"mpu-1\"></p>\n                                            <p class=\"sdc-site-au__label\">\n                                                <p class=\"sdc-site-au__label-text\">Advertisement</p>\n                                            </p>\n                                    <p>But an expert production company behind the documentary decided it was too risky to board the submersible after carrying out its own checks, with his agent saying it was unsafe on \"every level\".</p><p><strong>Read more:</strong><br><a href=\"https://news.sky.com/story/titanic-sub-implosion-billionaire-was-offered-last-minute-price-tickets-for-doomed-voyage-but-pulled-out-over-schedule-clash-12908345\" target=\"_blank\"><strong>Billionaire was offered last minute-price tickets for doomed voyage</strong></a><br><a href=\"https://news.sky.com/story/titanic-director-james-cameron-says-he-knew-submersible-was-destroyed-four-days-before-debris-found-12908080\" target=\"_blank\"><strong>Titanic director says he 'knew submersible was destroyed' before debris found</strong></a><br><a href=\"https://news.sky.com/story/titanic-sub-deaths-navy-captain-reveals-what-could-have-caused-titan-submersible-to-implode-12908160\" target=\"_blank\"><strong>Navy captain reveals what could have caused Titan sub to implode</strong></a></p>         <p class=\"sdc-site-video__accessibility-message\">Please use Chrome browser for a more accessible video player</p>\n              <span class=\"sdc-site-video__poster\"><img src=\"https://e3.365dm.com/23/06/768x432/image_6197797.jpg?20230624132552\" alt=\"preview image\" class=\"sdc-site-video__poster-img\">\n              <p class=\"sdc-site-video__loader\"></p>\n                <p class=\"sdc-site-video__time\">1:29</p>\n              </span><p></p>\n            \n              \n              <p class=\"sdc-site-video__caption-text\">Mother ship for Titanic sub docks</p>\n            \n          <p><strong><a href=\"https://news.sky.com/story/titanic-sub-implosion-canadian-police-looking-into-deaths-of-five-people-onboard-12909036\" target=\"_blank\">Investigations are now under way</a></strong> to establish exactly what happened to the Titan vessel after it imploded.</p><p>The mother ship, which launched Titan, <strong><a href=\"https://news.sky.com/story/titan-subs-mother-ship-returns-to-shore-as-us-coast-guard-to-lead-investigation-into-implosion-12908723\" target=\"_blank\">has returned to dock</a></strong> to be investigated by the US Coast Guard.</p><p>Using a remotely-operated vehicle, officials found parts of the submersible around 500m from the bow of the Titanic on the sea floor.</p><p>British billionaire Hamish Harding, UK-Pakistani businessman Shahzada Dawood, his 19-year-old son Suleman Dawood, OceanGate founder Stockton Rush and French national Paul-Henri Nargeolet were on board when the sub imploded.</p>\n    </div>",
            "text": "MrBeast, the most-followed person on YouTube, says he turned down an invitation to travel on the doomed Titanic submersible.\n\nFive people were killed when OceanGate's Titan submersible imploded during a trip to the Titanic wreck last week.\n\nIn a tweet, MrBeast - whose real name is Jimmy Donaldson - shared a text message which he said showed he was invited on to the vessel.\n\nImage: MrBeast. Pic: Greg Grudt/UPI/Shutterstock\n\nTwitter Twitter , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Twitter cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Twitter cookies. To view this content you can use the button below to allow Twitter cookies for this session only. Enable Cookies Allow Cookies Once\n\nHe wrote alongside the image: \"I was invited earlier this month to ride the titanic submarine, I said no.\n\n\"Kind of scary that I could have been on it\".\n\nIt is not clear who was inviting MrBeast on to the submersible.\n\nThe American - who has 162 million YouTube subscribers - is known for his big-money competitions and expensive stunts, including his own version of Squid Game, paying an assassin to try and kill him, and getting buried alive.\n\nHis revelation comes a day after it was revealed documentary maker and former EastEnders actor Ross Kemp turned down the chance to ride the submersible.\n\nKemp was planning to take part in the deep diving mission last year for a programme to mark the 110th anniversary of the sinking of the ill-fated liner.\n\nAdvertisement\n\nBut an expert production company behind the documentary decided it was too risky to board the submersible after carrying out its own checks, with his agent saying it was unsafe on \"every level\".\n\nRead more:\n\nBillionaire was offered last minute-price tickets for doomed voyage\n\nTitanic director says he 'knew submersible was destroyed' before debris found\n\nNavy captain reveals what could have caused Titan sub to implode\n\nPlease use Chrome browser for a more accessible video player 1:29 Mother ship for Titanic sub docks\n\nInvestigations are now under way to establish exactly what happened to the Titan vessel after it imploded.\n\nThe mother ship, which launched Titan, has returned to dock to be investigated by the US Coast Guard.\n\nUsing a remotely-operated vehicle, officials found parts of the submersible around 500m from the bow of the Titanic on the sea floor.\n\nBritish billionaire Hamish Harding, UK-Pakistani businessman Shahzada Dawood, his 19-year-old son Suleman Dawood, OceanGate founder Stockton Rush and French national Paul-Henri Nargeolet were on board when the sub imploded.",
            "top_image": "https://e3.365dm.com/23/06/1600x900/skynews-titan-submersible-titanic_6196145.jpg?20230622182245",
            "authors": "Sky Uk Limited",
            "keywords": [],
            "publish_date": 1687964264,
            "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L3lvdXR1YmUtc3Rhci1tcmJlYXN0LXNheXMtaGUtdHVybmVkLWRvd24tdHJpcC1vbi1kb29tZWQtdGl0YW5pYy1zdWJtZXJzaWJsZS0xMjkwOTM2NNIBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "MrBeast Says He Turned Down Invitation to Join Titanic Submersible Voyage: ‘Kind of Scary That I Could Have Been on It’",
            "article_html": "<div><p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\t<a href=\"https://variety.com/t/mrbeast/\" id=\"auto-tag_mrbeast\">MrBeast</a>, the hugely popular YouTube creator known for his over-the-top stunts and challenges, said he had been invited on OceanGate&#8217;s submersible earlier in June but ultimately declined the offer. </p>\n\n\n\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\t&#8220;I was invited earlier this month to ride the <a href=\"https://variety.com/t/titanic/\" id=\"auto-tag_titanic\">titanic</a> submarine, I said no. Kind of scary that I could have been on it,&#8221; MrBeast <a rel=\"noreferrer noopener nofollow\" href=\"https://twitter.com/MrBeast/status/1672952297163218946\" target=\"_blank\">tweeted</a> Sunday morning.</p>\n\n\n\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\tOn Sunday, June 18, the Titan submersible operated by OceanGate that was <a href=\"https://variety.com/2023/film/global/titanic-tourist-submarine-missing-1235648554/\">diving to the wreckage of the Titanic in the Atlantic Ocean lost contact</a> with its surface support ship. On Thursday, <a href=\"https://variety.com/2023/film/news/titan-submarine-dead-missing-titanic-1235649790/\">the company issued a statement</a> that all five members on board were presumed to have died after the sub had a &#8220;catastrophic implosion.&#8221;\n\n</p><p class=\"cxense-widget-div lrv-u-width-100p lrv-u-height-100p\" id=\"cx-mid-article\"></p>\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\tIt&#8217;s not clear who may have invited MrBeast to come aboard the OceanGate vessel. Along with his tweet, MrBeast included an excerpt of a text message he apparently sent to someone saying, &#8220;I&#8217;m going to the Titanic in a submarine late this month. The team would be stoked to have you along.&#8221;\n\n\t</p><p id=\"gpt-variety-article-mid-article-uid0\" class=\" adw-300 adh-250\">\n\t\t \n\t</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it <a href=\"https://t.co/bQUnaRiczA\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/bQUnaRiczA</a></p>&#8212; MrBeast (@MrBeast) <a href=\"https://twitter.com/MrBeast/status/1672952297163218946?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">June 25, 2023</a></blockquote> \n\n\n\n\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\tMrBeast (real name: Jimmy Donaldson)&#160;is the most-followed individual YouTube creator on the platform, with more than 162 million subscribers currently.</p>\n\n\n\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\tMrBeast is estimated to be <a href=\"https://variety.com/2022/digital/news/mrbeast-highest-earning-youtube-star-54-million-1235154580/\">the highest-earning creator on YouTube</a>, amassing a fanbase for his big-money giveaways and stunts &#8212; including his 2021 viral reenactment of Netflix hit &#8220;Squid Game,&#8221; which awarded the winner a $446,000 prize &#8212; and an array of charitable initiatives.</p>\n\n\n\n<p class=\"paragraph larva // lrv-u-margin-lr-auto  lrv-a-font-body-m   \">\n\tThe OceanGate Titan disaster captivated public attention across the globe. The event <a href=\"https://variety.com/2023/film/global/james-cameron-titanic-submersible-oceangate-1235650531/\">drew critical commentary from &#8220;Titanic&#8221; director James Cameron</a>, who claimed that those in the diving community had been &#8220;very concerned&#8221; about the safety of the sub. In <a href=\"https://variety.com/2023/film/global/james-cameron-titanic-submersible-oceangate-1235650531/\">response</a>, OceanGate co-founder Guillermo S&#246;hnlein said in part, &#8220;I know from firsthand experience that we were extremely committed to safety and risk mitigation was a key part of the company culture.&#8221;</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</div>",
            "text": "MrBeast, the hugely popular YouTube creator known for his over-the-top stunts and challenges, said he had been invited on OceanGate’s submersible earlier in June but ultimately declined the offer.\n\n“I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,” MrBeast tweeted Sunday morning.\n\nOn Sunday, June 18, the Titan submersible operated by OceanGate that was diving to the wreckage of the Titanic in the Atlantic Ocean lost contact with its surface support ship. On Thursday, the company issued a statement that all five members on board were presumed to have died after the sub had a “catastrophic implosion.”\n\nIt’s not clear who may have invited MrBeast to come aboard the OceanGate vessel. Along with his tweet, MrBeast included an excerpt of a text message he apparently sent to someone saying, “I’m going to the Titanic in a submarine late this month. The team would be stoked to have you along.”\n\nI was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it pic.twitter.com/bQUnaRiczA — MrBeast (@MrBeast) June 25, 2023\n\nMrBeast (real name: Jimmy Donaldson) is the most-followed individual YouTube creator on the platform, with more than 162 million subscribers currently.\n\nMrBeast is estimated to be the highest-earning creator on YouTube, amassing a fanbase for his big-money giveaways and stunts — including his 2021 viral reenactment of Netflix hit “Squid Game,” which awarded the winner a $446,000 prize — and an array of charitable initiatives.\n\nThe OceanGate Titan disaster captivated public attention across the globe. The event drew critical commentary from “Titanic” director James Cameron, who claimed that those in the diving community had been “very concerned” about the safety of the sub. In response, OceanGate co-founder Guillermo Söhnlein said in part, “I know from firsthand experience that we were extremely committed to safety and risk mitigation was a key part of the company culture.”",
            "top_image": "https://variety.com/wp-content/uploads/2023/04/MrBeast.png?w=746&h=420&crop=1",
            "authors": "Todd Spangler",
            "keywords": [],
            "publish_date": 1687695946,
            "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vdmFyaWV0eS5jb20vMjAyMy9kaWdpdGFsL25ld3MvbXJiZWFzdC10aXRhbmljLXN1Ym1lcnNpYmxlLXZveWFnZS1pbnZpdGF0aW9uLTEyMzU2NTM5OTMv0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "The Incredible Journey Of MrBeast: YouTube's Reigning King",
            "article_html": "<div><p class=\"bz-campaign bz-campaign-top-33040166\"></p><p class=\"core-block\">Irrespective of where you are in the world, chances are that you've heard of a YouTuber names <strong class=\"core-block\">MrBeast</strong>. But chances are that you don't know answers to questions like how he started, what it took to become an internet phenomenon, and what his journey looks like.&#160;</p><p class=\"core-block\">To find answers to such questions, let's look at the incredible journey of <strong class=\"core-block\">Jimmy Donaldson</strong>, popularly known as <strong class=\"core-block\">MrBeast</strong> &#8212; <strong class=\"core-block\">YouTube&#8217;s</strong> reigning king. The legendary icon, known for engaging videos and remarkable philanthropy, has revolutionized online entertainment and <a href=\"https://www.benzinga.com/news/23/01/30647448/mrbeasts-1-001-acts-of-charity-the-gift-of-sight-and-a-new-tesla-for-1-teenager\" target=\"_blank\" class=\"core-block\">left a meaningful imprint on the world</a>.&#160;</p><p class=\"core-block\">Discover how this YouTube sensation has transformed lives, one video at a time.</p><p class=\"bz-campaign bz-campaign-middle-33040166\"></p><p class=\"primis-video\" id=\"primis-article-video\"></p><p class=\"core-block\"><strong class=\"core-block\">What Happened:</strong> In the dynamic realm of YouTube, a few names stand out, and one of them is MrBeast. Born as Jimmy Donaldson, he has carved a niche for himself as a YouTube sensation with his unique content that ranges from <a href=\"https://www.benzinga.com/general/entertainment/23/05/32260914/mrbeast-is-giving-away-50k-as-birthday-bonanza-what-you-need-to-do-to-win-it\" target=\"_blank\" class=\"core-block\">mind-boggling challenges to lavish giveaways</a>.&#160;</p><p class=\"core-block\">However, what truly sets MrBeast apart is his unique content and his commitment to philanthropy and altruistic initiatives &#8212; from funding hundreds of eye surgeries to donating millions to food banks. He has not only revolutionized digital media but also brought about tangible change in the world.</p><p class=\"core-block\">Here's a comprehensive overview of how this seemingly innocent and normal kid turned his and the life of people around him by building an unparalleled kingdom simply by creating content.&#160;</p><p class=\"adBox\" id=\"in-article-ga-placeholder-33040166\"></p><p>\n \n</p><p></p><p class=\"core-block\">See Also: <a href=\"https://www.benzinga.com/23/05/32588454/how-do-i-access-my-raspberry-pi-remotely\" target=\"_blank\" class=\"core-block\">How Do I Access My Raspberry Pi Remotely</a></p><p class=\"core-block\"><strong class=\"core-block\">Let's Start With The Start: Early Life And Education</strong></p><p class=\"core-block\">Born on May 7, 1998, in Greenville, North Carolina, Jimmy Donaldson, better known as MrBeast, developed an early interest in digital media. He was always driven by a desire to stand out, propelling him to venture into the world of YouTube at the tender age of 13. His early years on the platform were marked by a period of exploration and learning.&#160;</p><p class=\"core-block\">Donaldson graduated in 2016 from a private high school in Greenville and later reportedly enrolled in a college, although details regarding his higher education are relatively unknown. In 2019, MrBeast publicly admitted to dropping out of college after lasting there only two weeks.&#160;</p><p class=\"wp-block-embed__wrapper\">\n \n</p><p class=\"core-block\"><strong class=\"core-block\">This Is Where It All Started: YouTube Career And History In The Making&#160;</strong></p><p class=\"core-block\">Donaldson started his YouTube journey in 2012, MrBeast made his mark by experimenting with a wide array of content, from gaming videos to outrageous challenges, before finding his niche in philanthropic endeavors and viral stunts.</p><p class=\"core-block\">After facing some initial failures, he finally got a breakthrough in 2015 and 2016. During these years, he started amassing a dedicated fan base due to a series of videos titled \"worst intros.\" In these videos, Donaldson used to mock the introductions of fellow YouTubers playfully he stumbled upon on the platform. As a result, by the end of the following year, the YouTuber had successfully garnered around 30,000 subscribers, <a href=\"https://www.benzinga.com/news/23/01/30478800/mrbeast-on-how-you-can-10x-your-youtube-subscribers\" target=\"_blank\" class=\"core-block\">marking a significant milestone</a> in his online journey.&#160;</p><p class=\"core-block\"><strong class=\"core-block\">How MrBeast's Empire Has Grown: A Look&#160;</strong></p><p class=\"core-block\">Since his humble beginnings, <a href=\"https://www.benzinga.com/news/23/04/32030572/how-mrbeast-built-a-youtube-empire\" target=\"_blank\" class=\"core-block\">MrBeast has established </a>diverse video formats that serve as the primary content pillars on his YouTube channel. These include his signature endurance-based challenges, often referred to as &#8220;junklord YouTube&#8221; where he pushes himself through exhausting and hours-long stunts.&#160;</p><p class=\"core-block\">Additionally, he organizes captivating &#8220;last-person-to-leave&#8221; challenges involving substantial cash giveaways amounting to thousands of dollars. The titles of these videos range from &#8220;Going Through the Same Drive Thru 1,000 Times&#8221; to &#8220;Last To Remove Hand, Gets Lamborghini Challenge.&#8221;</p><p class=\"core-block\">Moreover, MrBeast showcases his philanthropic side through attention-grabbing donations and charity endeavors. Notably, he once operated a car dealership where he generously gifted cars. Beyond that, he consistently contributes significant amounts of money to small streamers on platforms like <strong class=\"core-block\">Twitch</strong> and YouTube and personally rewards waitresses and <strong class=\"core-block\">Uber</strong> drivers with substantial tips.</p><p class=\"core-block\">Donaldson's unpredictable yet entertaining videos have earned him a whopping 150 million subscribers on his main YouTube channel as of May 2023&#8203;&#8203;. At the time of writing, the YouTuber had 163 million subscribers on his main channel on the platform.&#160;</p><p class=\"core-block\"><strong class=\"core-block\">Let's Start Counting The Key Milestones Of His YouTube Career</strong></p><p class=\"core-block\">Throughout his journey, MrBeast has achieved countless milestones. Besides his primary channel, he currently operates several other accounts, including <strong class=\"core-block\">Beast Philanthropy</strong>,<strong class=\"core-block\"> MrBeast Gaming</strong>, <strong class=\"core-block\">Beast Reacts,</strong> and <strong class=\"core-block\">MrBeast 2</strong>. Collectively, these channels boast over 260 million subscribers, contributing significantly to his yearly revenue&#8203;.&#160;</p><p class=\"core-block\">His most viewed video, featuring a real-life &#8220;Squid Game&#8221; themed challenge, <a href=\"https://www.benzinga.com/news/21/11/24369935/mr-beasts-squid-game-video-has-more-views-in-a-week-than-netflixs-show-had-in-first-month\" target=\"_blank\" class=\"core-block\">has so far garnered a staggering 449 million views</a>&#8203;&#8203;.</p><p class=\"wp-block-embed__wrapper\">\n\n</p><p class=\"core-block\"><strong class=\"core-block\">The Videos That Exemplify MrBeast's Defining Moments As A YouTube Star&#160;</strong></p><p class=\"core-block\">MrBeast experienced a meteoric rise in popularity starting in early 2017. His videos grew larger and more ambitious, captivating a growing audience. Initially, Donaldson released 12-hour videos where he performed lengthy but mundane tasks, such as reading the entire dictionary. Over time, he transitioned to more extravagant and physically demanding stunt performances.</p><p class=\"core-block\">Donaldson&#8217;s defining moments on YouTube are marked by his grand-scale challenge videos that push boundaries in terms of scale, endurance, and cost. Examples include &#8220;Paying People $10,000 To Eat Ghost Pepper,&#8221; &#8220;I Bought Everything In A Store,&#8221; and &#8220;Last To Remove Hand, Wins House.&#8221;&#160;</p><p class=\"wp-block-embed__wrapper\">\n\n</p><p class=\"wp-block-embed__wrapper\">\n\n</p><p class=\"core-block\">His impact on YouTube has been significant, as his extravagant challenges and sponsor-driven money giveaways became an instant sensation. However, Donaldson&#8217;s influence extended beyond challenges. He popularized formats where creators purchase excessive amounts of a product and use them absurdly. For example, his video titled &#8220;I Put Millions of Pennies in My Friend&#8217;s Backyard&#8221; gained substantial popularity.</p><p class=\"wp-block-embed__wrapper\">\n\n</p><p class=\"core-block\">This video style, referred to as &#8220;junklord YouTube&#8221; by <strong class=\"core-block\">Anthony Padilla</strong>, co-founder of <strong class=\"core-block\">Smosh</strong>, involved creators investing exorbitant amounts of money in absurd quantities of products solely for one video. The extravagance and peculiarity of these videos attracted curious viewers.</p><p class=\"core-block\">As Minecraft gained prominence on the platform, non-gaming creators sought ways to generate views. Some creators shifted their focus to become drama vloggers or commentators.&#160;</p><p class=\"core-block\">MrBeast&#8217;s success has demonstrated the viability of this model, but replicating it may prove more challenging now that it has become a popular approach. As Wilson, a YouTube commentator, stated, &#8220;No one is doing it bigger or better than him.&#8221;</p><p class=\"core-block\"><strong class=\"core-block\">Because There Cannot Ever Be Enough Philanthropic Initiatives</strong></p><p class=\"core-block\">MrBeast&#8217;s philanthropy is at the core of his online persona. He has made significant contributions to charitable causes, including funding the eye surgeries of 1,000 blind people and donating 20,000 pairs of shoes to children in Africa. His philanthropic endeavors have won him millions of fans worldwide and brought about real, positive change, proving the transformative power of online communities&#8203;&#8203;.</p><p class=\"core-block\"><strong class=\"core-block\">Why Stop At One Place, When You Can Have It All: MrBeast Business Ventures</strong></p><p class=\"core-block\">Beyond YouTube, MrBeast has capitalized on his fame and ventured into the business world. He launched &#8216;MrBeast Burger,&#8217; a virtual restaurant chain that quickly gained popularity thanks to his massive fanbase. For the uninitiated, MrBeast Burger was a ghost kitchen falling under the <a href=\"https://www.benzinga.com/general/entertainment/23/04/31627623/mrbeasts-wild-ride-a-hilarious-look-at-the-differences-between-a-1-and-500-000-plane-ticket\" target=\"_blank\" class=\"core-block\">MrBeast umbrella that opened</a> its first physical store in the American Dream Mall in New Jersey.&#160;</p><p class=\"core-block\">Although it is pertinent to note here that earlier this month, Donaldson hinted that MrBeast Burer, the once-burgeoning fast food sensation, <a href=\"https://www.benzinga.com/news/23/06/32904853/the-recent-mrbeast-burger-you-savored-could-truly-be-your-last-heres-why\" target=\"_blank\" class=\"core-block\">plans on calling it quits</a>. MrBeast said he could not guarantee the quality of orders when collaborating with other restaurants.&#160;</p><p class=\"core-block\">Additionally, the social media sensation admitted that <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/01/30580567/elon-musk-still-not-lovin-it-a-year-later-mums-still-the-word-on-mrbeast-burgers-dogecoin-\" target=\"_blank\" class=\"core-block\">despite the burger's success</a>, he has far more passion for creating snacks, leading him to focus on <strong class=\"core-block\">Feastable</strong>s.</p><p class=\"core-block\">The YouTuber starred Feastables brand in 2022. It was primarily founded as a chocolate company but has since expanded into cookies, merchandise, and more.&#160;</p><p class=\"core-block\"><strong class=\"core-block\">Nothing Can Stop Me Or Can It? Controversies And Challenges</strong></p><p class=\"core-block\">Despite his overwhelming success, MrBeast&#8217;s journey has not been devoid of challenges or controversies. In 2018, a series of now-deleted tweets from MrBeast surfaced, revealing his use of homophobic slurs and making jokes that trivialized being gay.&#160;</p><p class=\"core-block\">MrBeast's Twitter bio at the time included the phrase, &#8220;just because I&#8217;m gai doesn&#8217;t mean I&#8217;m gay.&#8221; While MrBeast defended himself by asserting that he did not find his actions offensive, critics found his remarks problematic, <a href=\"https://www.theatlantic.com/technology/archive/2018/05/youtubes-biggest-philanthropist-has-a-history-of-homophobic-comments/561248/\" target=\"_blank\" class=\"core-block\">according</a> to The Atlantic.&#160;</p><p class=\"core-block\">Additionally, MrBeast has faced accusations of distributing counterfeit money. In a video released in November 2019, skeptics discovered that the bills used were not legal tender. MrBeast later explained that he deliberately handed out fake bills to avoid the potential dangers of a chaotic rush of people scrambling for free money.&#160;</p><p class=\"core-block\">He further stated that he subsequently replaced the counterfeit bills with genuine checks for the individuals featured in the video, <a href=\"https://www.dexerto.com/entertainment/mrbeast-responds-to-accusations-of-giving-away-fake-money-1292652/\" target=\"_blank\" class=\"core-block\">reported</a> Dexerto.&#160;</p><p class=\"core-block\"><strong class=\"core-block\">Vantage View</strong></p><p class=\"core-block\">From a small town in North Carolina to the pinnacle of YouTube stardom, MrBeast&#8217;s journey is a testament to the power of creativity, persistence, and altruism. His unique blend of entertainment and philanthropy has revolutionized online entertainment and positively impacted countless lives.&#160;</p><p class=\"core-block\">As he continues to evolve and innovate, it&#8217;s exciting to speculate where his journey will take him next.&#160;</p><p class=\"core-block\">Editor&#8217;s Note: Artificial intelligence was used as a secondary aid in writing this story.</p><p class=\"core-block\">Check out more of Benzinga&#8217;s Consumer Tech coverage by <a href=\"https://www.benzinga.com/topic/consumer-tech\" target=\"_blank\" class=\"core-block\">following this link</a>.&#160;</p><p class=\"core-block\">Read Next: <a href=\"https://www.benzinga.com/news/23/05/32484771/how-to-use-chatgpt-on-mobile-like-a-pro\" target=\"_blank\" class=\"core-block\">How To Use ChatGPT On Mobile Like A Pro</a></p><p class=\"bz-campaign bz-campaign-bottom-33040166\"></p></div>",
            "text": "Irrespective of where you are in the world, chances are that you've heard of a YouTuber names MrBeast. But chances are that you don't know answers to questions like how he started, what it took to become an internet phenomenon, and what his journey looks like.\n\nTo find answers to such questions, let's look at the incredible journey of Jimmy Donaldson, popularly known as MrBeast — YouTube’s reigning king. The legendary icon, known for engaging videos and remarkable philanthropy, has revolutionized online entertainment and left a meaningful imprint on the world.\n\nDiscover how this YouTube sensation has transformed lives, one video at a time.\n\nWhat Happened: In the dynamic realm of YouTube, a few names stand out, and one of them is MrBeast. Born as Jimmy Donaldson, he has carved a niche for himself as a YouTube sensation with his unique content that ranges from mind-boggling challenges to lavish giveaways.\n\nHowever, what truly sets MrBeast apart is his unique content and his commitment to philanthropy and altruistic initiatives — from funding hundreds of eye surgeries to donating millions to food banks. He has not only revolutionized digital media but also brought about tangible change in the world.\n\nHere's a comprehensive overview of how this seemingly innocent and normal kid turned his and the life of people around him by building an unparalleled kingdom simply by creating content.\n\nSee Also: How Do I Access My Raspberry Pi Remotely\n\nLet's Start With The Start: Early Life And Education\n\nBorn on May 7, 1998, in Greenville, North Carolina, Jimmy Donaldson, better known as MrBeast, developed an early interest in digital media. He was always driven by a desire to stand out, propelling him to venture into the world of YouTube at the tender age of 13. His early years on the platform were marked by a period of exploration and learning.\n\nDonaldson graduated in 2016 from a private high school in Greenville and later reportedly enrolled in a college, although details regarding his higher education are relatively unknown. In 2019, MrBeast publicly admitted to dropping out of college after lasting there only two weeks.\n\nThis Is Where It All Started: YouTube Career And History In The Making\n\nDonaldson started his YouTube journey in 2012, MrBeast made his mark by experimenting with a wide array of content, from gaming videos to outrageous challenges, before finding his niche in philanthropic endeavors and viral stunts.\n\nAfter facing some initial failures, he finally got a breakthrough in 2015 and 2016. During these years, he started amassing a dedicated fan base due to a series of videos titled \"worst intros.\" In these videos, Donaldson used to mock the introductions of fellow YouTubers playfully he stumbled upon on the platform. As a result, by the end of the following year, the YouTuber had successfully garnered around 30,000 subscribers, marking a significant milestone in his online journey.\n\nHow MrBeast's Empire Has Grown: A Look\n\nSince his humble beginnings, MrBeast has established diverse video formats that serve as the primary content pillars on his YouTube channel. These include his signature endurance-based challenges, often referred to as “junklord YouTube” where he pushes himself through exhausting and hours-long stunts.\n\nAdditionally, he organizes captivating “last-person-to-leave” challenges involving substantial cash giveaways amounting to thousands of dollars. The titles of these videos range from “Going Through the Same Drive Thru 1,000 Times” to “Last To Remove Hand, Gets Lamborghini Challenge.”\n\nMoreover, MrBeast showcases his philanthropic side through attention-grabbing donations and charity endeavors. Notably, he once operated a car dealership where he generously gifted cars. Beyond that, he consistently contributes significant amounts of money to small streamers on platforms like Twitch and YouTube and personally rewards waitresses and Uber drivers with substantial tips.\n\nDonaldson's unpredictable yet entertaining videos have earned him a whopping 150 million subscribers on his main YouTube channel as of May 2023​​. At the time of writing, the YouTuber had 163 million subscribers on his main channel on the platform.\n\nLet's Start Counting The Key Milestones Of His YouTube Career\n\nThroughout his journey, MrBeast has achieved countless milestones. Besides his primary channel, he currently operates several other accounts, including Beast Philanthropy, MrBeast Gaming, Beast Reacts, and MrBeast 2. Collectively, these channels boast over 260 million subscribers, contributing significantly to his yearly revenue​.\n\nHis most viewed video, featuring a real-life “Squid Game” themed challenge, has so far garnered a staggering 449 million views​​.\n\nThe Videos That Exemplify MrBeast's Defining Moments As A YouTube Star\n\nMrBeast experienced a meteoric rise in popularity starting in early 2017. His videos grew larger and more ambitious, captivating a growing audience. Initially, Donaldson released 12-hour videos where he performed lengthy but mundane tasks, such as reading the entire dictionary. Over time, he transitioned to more extravagant and physically demanding stunt performances.\n\nDonaldson’s defining moments on YouTube are marked by his grand-scale challenge videos that push boundaries in terms of scale, endurance, and cost. Examples include “Paying People $10,000 To Eat Ghost Pepper,” “I Bought Everything In A Store,” and “Last To Remove Hand, Wins House.”\n\nHis impact on YouTube has been significant, as his extravagant challenges and sponsor-driven money giveaways became an instant sensation. However, Donaldson’s influence extended beyond challenges. He popularized formats where creators purchase excessive amounts of a product and use them absurdly. For example, his video titled “I Put Millions of Pennies in My Friend’s Backyard” gained substantial popularity.\n\nThis video style, referred to as “junklord YouTube” by Anthony Padilla, co-founder of Smosh, involved creators investing exorbitant amounts of money in absurd quantities of products solely for one video. The extravagance and peculiarity of these videos attracted curious viewers.\n\nAs Minecraft gained prominence on the platform, non-gaming creators sought ways to generate views. Some creators shifted their focus to become drama vloggers or commentators.\n\nMrBeast’s success has demonstrated the viability of this model, but replicating it may prove more challenging now that it has become a popular approach. As Wilson, a YouTube commentator, stated, “No one is doing it bigger or better than him.”\n\nBecause There Cannot Ever Be Enough Philanthropic Initiatives\n\nMrBeast’s philanthropy is at the core of his online persona. He has made significant contributions to charitable causes, including funding the eye surgeries of 1,000 blind people and donating 20,000 pairs of shoes to children in Africa. His philanthropic endeavors have won him millions of fans worldwide and brought about real, positive change, proving the transformative power of online communities​​.\n\nWhy Stop At One Place, When You Can Have It All: MrBeast Business Ventures\n\nBeyond YouTube, MrBeast has capitalized on his fame and ventured into the business world. He launched ‘MrBeast Burger,’ a virtual restaurant chain that quickly gained popularity thanks to his massive fanbase. For the uninitiated, MrBeast Burger was a ghost kitchen falling under the MrBeast umbrella that opened its first physical store in the American Dream Mall in New Jersey.\n\nAlthough it is pertinent to note here that earlier this month, Donaldson hinted that MrBeast Burer, the once-burgeoning fast food sensation, plans on calling it quits. MrBeast said he could not guarantee the quality of orders when collaborating with other restaurants.\n\nAdditionally, the social media sensation admitted that despite the burger's success, he has far more passion for creating snacks, leading him to focus on Feastables.\n\nThe YouTuber starred Feastables brand in 2022. It was primarily founded as a chocolate company but has since expanded into cookies, merchandise, and more.\n\nNothing Can Stop Me Or Can It? Controversies And Challenges\n\nDespite his overwhelming success, MrBeast’s journey has not been devoid of challenges or controversies. In 2018, a series of now-deleted tweets from MrBeast surfaced, revealing his use of homophobic slurs and making jokes that trivialized being gay.\n\nMrBeast's Twitter bio at the time included the phrase, “just because I’m gai doesn’t mean I’m gay.” While MrBeast defended himself by asserting that he did not find his actions offensive, critics found his remarks problematic, according to The Atlantic.\n\nAdditionally, MrBeast has faced accusations of distributing counterfeit money. In a video released in November 2019, skeptics discovered that the bills used were not legal tender. MrBeast later explained that he deliberately handed out fake bills to avoid the potential dangers of a chaotic rush of people scrambling for free money.\n\nHe further stated that he subsequently replaced the counterfeit bills with genuine checks for the individuals featured in the video, reported Dexerto.\n\nVantage View\n\nFrom a small town in North Carolina to the pinnacle of YouTube stardom, MrBeast’s journey is a testament to the power of creativity, persistence, and altruism. His unique blend of entertainment and philanthropy has revolutionized online entertainment and positively impacted countless lives.\n\nAs he continues to evolve and innovate, it’s exciting to speculate where his journey will take him next.\n\nEditor’s Note: Artificial intelligence was used as a secondary aid in writing this story.\n\nCheck out more of Benzinga’s Consumer Tech coverage by following this link.\n\nRead Next: How To Use ChatGPT On Mobile Like A Pro",
            "top_image": "https://cdn.benzinga.com/files/images/story/2023/MrBeast_photo_via_Shutterstock_4.jpeg?width=1200&height=800&fit=crop",
            "authors": "Ananya Gairola",
            "keywords": [],
            "publish_date": 1687964268,
            "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9uZXdzLzIzLzA2LzMzMDQwMTY2L3RoZS1pbmNyZWRpYmxlLWpvdXJuZXktb2YtbXJiZWFzdC15b3V0dWJlcy1yZWlnbmluZy1raW5n0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "How MrBeast Became the Willy Wonka of YouTube",
            "article_html": "<div><p class=\"css-at9mc1 evys1bk0\"><strong class=\"css-8qgvsz ebyp5n10\">Compared with the</strong> strange and compelling creatures on display elsewhere on YouTube, it can be hard to understand precisely what&#8217;s appealing about MrBeast. Donaldson has an easygoing manner and a charming, goofy enthusiasm, but no immediate televisual charisma. He is not particularly funny or well spoken or physically striking: If you created an average of the faces of all 25-year-old white North Carolinians, you would probably end up with something like Donaldson&#8217;s. And yet Donaldson has surpassed almost all of his competition to build one of the most popular channels on the platform, topped only by an Indian record label and the toddler-hypnosis juggernaut Cocomelon, which he will almost certainly overtake this year. MrBeast is the largest channel belonging to an individual who could be called a &#8220;YouTuber,&#8221; outstripping the formidable figure of PewDiePie by more than 40 million subscribers.</p><p class=\"css-at9mc1 evys1bk0\">Being a notably regular guy carries with it a charisma of its own, and Donaldson&#8217;s relative normalcy and approachability are bolstered &#8212; and probably also encouraged &#8212; by his skill at reading the ripples and whipcracks of the vast and secret sorting and recommending algorithms that structure major platforms like YouTube. Eligible creators on the platform earn around half of the revenue from advertising that YouTube sells against their videos. The company took in nearly $30 billion in ad revenue in 2022; there&#8217;s a lot of money available for anyone who cobbles together a large-enough audience. But finding and keeping that audience is a much more complicated task &#8212; and, in a sense, every YouTuber&#8217;s second job.</p><p class=\"css-at9mc1 evys1bk0\">Even within this context, Donaldson stands out for his dedication to understanding how YouTube works. For most of his teenage years, &#8220;I woke up, I studied YouTube, I studied videos, I studied filmmaking, I went to bed and that was my life,&#8221; <a class=\"css-yywogo\" href=\"https://www.bloomberg.com/news/articles/2020-12-22/who-is-mrbeast-meet-youtube-s-top-creator-of-2020\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\">Donaldson once told Bloomberg.</a> &#8220;I hardly had any friends because I was so obsessed with YouTube,&#8221; <a class=\"css-yywogo\" href=\"https://www.youtube.com/watch?v=3A8kawxMOcQ\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\">he said on &#8220;The Joe Rogan Experience&#8221;</a> last year. After high school, he hooked up with a gang of similarly obsessed &#8220;lunatics&#8221; and planned out a program of study. He and his friends &#8220;did nothing but just hyperstudy what makes a good video, what makes a good thumbnail, what&#8217;s good pacing, how to go viral,&#8221; he told Rogan. &#8220;We&#8217;d do things like take a thousand thumbnails and see if there&#8217;s correlation to the brightness of the thumbnail to how many views it got. Videos that got over 10 million views, how often do they cut the camera angles? Things like that.&#8221;</p><p class=\"css-at9mc1 evys1bk0\">Donaldson&#8217;s skill at studying and understanding viral success isn&#8217;t limited to YouTube: He can also claim mastery of Seamless, having started an extremely successful business called MrBeast Burger, which mostly exists as a brand on delivery apps, licensed by local restaurants seeking to stand out in the crowded marketplace. At times, his entrepreneurialism and his reputation as one of the internet&#8217;s nice guys commingle uncomfortably. He sells a brand of chocolate bars called Feastables, and for months now, at Donaldson&#8217;s request, fans have been acting as volunteer brand representatives, tidying up the supermarket displays and posting photos of their acts of service to social media and the MrBeast subreddit. (As with Donaldson himself, it&#8217;s impossible to say whether this is done in the spirit of charity, however warped, or out of a desire for a handful of Reddit upvotes &#8212; or even Donaldson&#8217;s gratitude, however he may choose to express it.)</p><p class=\"css-at9mc1 evys1bk0\">Thanks to the amount of money up for grabs in the YouTube economy, there&#8217;s a large cottage industry on YouTube itself devoted to giving advice on becoming a YouTuber, and clips of Donaldson interviews in which he discusses his observations of the algorithm and successful strategies for working within it are treated by the mass of would-be YouTube stars the same way Warren Buffett remarks at Berkshire Hathaway annual meetings are treated by armchair investors. (Not entirely without reason: In 2022, <a class=\"css-yywogo\" href=\"https://www.forbes.com/sites/oliviapeluso/2022/12/23/mrbeast-could-be-worth-a-billion-and-we-dont-just-mean-views/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\">Forbes estimated that Donaldson brings in $54 million a year</a>.) And the core lesson, one he repeats frequently, is that YouTube viewers &#8212; and the algorithms that herd them through the site &#8212; reward visible expense and effort.</p></div>",
            "text": "Compared with the strange and compelling creatures on display elsewhere on YouTube, it can be hard to understand precisely what’s appealing about MrBeast. Donaldson has an easygoing manner and a charming, goofy enthusiasm, but no immediate televisual charisma. He is not particularly funny or well spoken or physically striking: If you created an average of the faces of all 25-year-old white North Carolinians, you would probably end up with something like Donaldson’s. And yet Donaldson has surpassed almost all of his competition to build one of the most popular channels on the platform, topped only by an Indian record label and the toddler-hypnosis juggernaut Cocomelon, which he will almost certainly overtake this year. MrBeast is the largest channel belonging to an individual who could be called a “YouTuber,” outstripping the formidable figure of PewDiePie by more than 40 million subscribers.\n\nBeing a notably regular guy carries with it a charisma of its own, and Donaldson’s relative normalcy and approachability are bolstered — and probably also encouraged — by his skill at reading the ripples and whipcracks of the vast and secret sorting and recommending algorithms that structure major platforms like YouTube. Eligible creators on the platform earn around half of the revenue from advertising that YouTube sells against their videos. The company took in nearly $30 billion in ad revenue in 2022; there’s a lot of money available for anyone who cobbles together a large-enough audience. But finding and keeping that audience is a much more complicated task — and, in a sense, every YouTuber’s second job.\n\nEven within this context, Donaldson stands out for his dedication to understanding how YouTube works. For most of his teenage years, “I woke up, I studied YouTube, I studied videos, I studied filmmaking, I went to bed and that was my life,” Donaldson once told Bloomberg. “I hardly had any friends because I was so obsessed with YouTube,” he said on “The Joe Rogan Experience” last year. After high school, he hooked up with a gang of similarly obsessed “lunatics” and planned out a program of study. He and his friends “did nothing but just hyperstudy what makes a good video, what makes a good thumbnail, what’s good pacing, how to go viral,” he told Rogan. “We’d do things like take a thousand thumbnails and see if there’s correlation to the brightness of the thumbnail to how many views it got. Videos that got over 10 million views, how often do they cut the camera angles? Things like that.”\n\nDonaldson’s skill at studying and understanding viral success isn’t limited to YouTube: He can also claim mastery of Seamless, having started an extremely successful business called MrBeast Burger, which mostly exists as a brand on delivery apps, licensed by local restaurants seeking to stand out in the crowded marketplace. At times, his entrepreneurialism and his reputation as one of the internet’s nice guys commingle uncomfortably. He sells a brand of chocolate bars called Feastables, and for months now, at Donaldson’s request, fans have been acting as volunteer brand representatives, tidying up the supermarket displays and posting photos of their acts of service to social media and the MrBeast subreddit. (As with Donaldson himself, it’s impossible to say whether this is done in the spirit of charity, however warped, or out of a desire for a handful of Reddit upvotes — or even Donaldson’s gratitude, however he may choose to express it.)\n\nThanks to the amount of money up for grabs in the YouTube economy, there’s a large cottage industry on YouTube itself devoted to giving advice on becoming a YouTuber, and clips of Donaldson interviews in which he discusses his observations of the algorithm and successful strategies for working within it are treated by the mass of would-be YouTube stars the same way Warren Buffett remarks at Berkshire Hathaway annual meetings are treated by armchair investors. (Not entirely without reason: In 2022, Forbes estimated that Donaldson brings in $54 million a year.) And the core lesson, one he repeats frequently, is that YouTube viewers — and the algorithms that herd them through the site — reward visible expense and effort.",
            "top_image": "https://static01.nyt.com/images/2023/06/18/magazine/18mag-mrbeast/18mag-mrbeast-facebookJumbo.jpg",
            "authors": "Max Read",
            "keywords": [],
            "publish_date": 1686577262,
            "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDYvMTIvbWFnYXppbmUvbXJiZWFzdC15b3V0dWJlLmh0bWzSAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "Apple Tv’s New Groundbreaking Twitter Strategy Has MrBeast and Elon Musk “Invested”",
            "article_html": "<div><p>Twitter underwent significant changes after being acquired by the eccentric billionaire, <a href=\"https://www.essentiallysports.com/tag/elon-musk/\" class=\"jsx-2b55705d932ea6e9\"><b>Elon Musk</b></a>. As the owner, Musk introduced a range of reforms that have transformed the overall environment of the site, bringing both positive and negative effects. Among these reforms, the introduction of longer video uploads stands out as one of the most influential. </p><p class=\"s2nPlayer k-XQLkpBYt\"> </p><p id=\"scroll-1\"></p><p>Leveraging this new feature, Apple TV has devised a unique strategy that has caught the attention of Elon Musk as well as YouTube&#8217;s top dog, <a href=\"https://www.essentiallysports.com/tag/mrbeast/\" class=\"jsx-2b55705d932ea6e9\"><b>MrBeast</b></a>.</p><p id=\"scroll-2\"></p><h2 class=\"jsx-cb26a7af5694ead9\"><b>Apple&#8217;s new Twitter strategy enthralled Elon Musk and MrBeast</b></h2><p id=\"scroll-3\"></p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf1\" class=\"jsx-2925020681 es-ad-space-container\"></p><p></p><p>Apple TV, seizing the opportunity presented by Twitter&#8217;s extended video capabilities, recently uploaded the first episode of its latest sci-fi show, Silo, on the platform (@AppleTV). This move enables any Twitter user to watch the opening episode for free, gradually building anticipation as the season progresses toward its finale. Apple&#8217;s decision to make this move became possible due to Twitter&#8217;s recent allowance of two-hour-long videos, exclusively available to Twitter Blue members.</p><p>Elon Musk, upon discovering Apple TV&#8217;s initiative, expressed his admiration, stating, <i>&#8220;Watch the entire first episode on this platform. Great move by Apple.&#8221;</i> Musk, aware that Twitter lacks a dedicated app for televisions, recommended users to AirPlay the video on supported smart TVs. Additionally, Android users can play the video on the app and mirror it on their TVs. Such an approach is expected to inspire other over-the-top (OTT) platforms to showcase their latest original content through Twitter.</p><p id=\"scroll-4\"></p><p>Joining the discussion, MrBeast, a prominent figure on YouTube, also praised Apple TV&#8217;s decision. He remarked, <i>&#8220;Really is a smart move, I never would have heard of this show and now I&#8217;m watching episode 1 and invested lol&#8221;</i> MrBeast&#8217;s endorsement highlights the power of leveraging Twitter as a promotional platform, enabling content creators to reach new audiences and generate interest in their productions.</p><p class=\"jsx-44cc305e8e9111e9\"></p><p></p><p id=\"content-review-trigger\"></p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf2\" class=\"jsx-2925020681 es-ad-space-container\"></p><a href=\"/ufc-mma-news-but-not-fight-in-the-cage-despite-training-both-elon-musk-mark-zuckerberg-joe-rogans-close-friend-warns-that-a-ufc-fight-isnt-a-good-idea?utm_campaign=internal_links&amp;utm_medium=dive_deeper&amp;utm_source=website/\" class=\"jsx-3540b6b6a5da9cf1 card\"><p class=\"jsx-2199838901 es-image-loader-aspect-ratio\"></p><p class=\"jsx-3540b6b6a5da9cf1 card-content\">&#8220;But Not Fight in the Cage&#8221; &#8211; Despite Training Both Elon Musk &amp; Mark Zuckerberg,\nJoe Rogan&#8217;s Close Friend Warns That a UFC Fight Isn&#8217;t a Good Idea</p><p class=\"jsx-3540b6b6a5da9cf1\"></p></a><p></p><p>Since Elon Musk&#8217;s takeover, several new features have been introduced to Twitter. One such addition is the Twitter Blue subscription, offering users the coveted Blue Tick verification badge for a monthly fee. Twitter Blue members also enjoy the privilege of posting long-form tweets, as well as the ability to undo or edit their posts. While longer video uploads have not been implemented yet, it is an area that the company may explore in the future.</p><p>Elon Musk&#8217;s ownership of Twitter has ushered in a wave of reforms that have significantly influenced the platform&#8217;s dynamics. The introduction of longer video uploads has opened up new possibilities, as demonstrated by Apple TV&#8217;s strategic move to showcase its latest show on Twitter.&#160;</p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf3\" class=\"jsx-2925020681 es-ad-space-container\"></p><p><b>WATCH THIS STORY: </b><a href=\"https://www.essentiallysports.com/stories/esports-biggest-streamers-who-left-twitch-and-switched-to-youtube/\" class=\"jsx-2b55705d932ea6e9\"><b>Biggest Steamers Who Left Twitch and Switched to YouTube</b></a></p><p>Musk&#8217;s endorsement, along with MrBeast&#8217;s positive reaction, underscores the potential for Twitter to become a powerful promotional platform for original content. As Twitter continues to evolve under Musk&#8217;s leadership, users can anticipate further enhancements and innovative features that shape the future of social media engagement.</p><p id=\"scroll-6\"></p></div>",
            "text": "Twitter underwent significant changes after being acquired by the eccentric billionaire, Elon Musk. As the owner, Musk introduced a range of reforms that have transformed the overall environment of the site, bringing both positive and negative effects. Among these reforms, the introduction of longer video uploads stands out as one of the most influential.\n\nLeveraging this new feature, Apple TV has devised a unique strategy that has caught the attention of Elon Musk as well as YouTube’s top dog, MrBeast.\n\nApple’s new Twitter strategy enthralled Elon Musk and MrBeast\n\nADVERTISEMENT Article continues below this ad\n\nApple TV, seizing the opportunity presented by Twitter’s extended video capabilities, recently uploaded the first episode of its latest sci-fi show, Silo, on the platform (@AppleTV). This move enables any Twitter user to watch the opening episode for free, gradually building anticipation as the season progresses toward its finale. Apple’s decision to make this move became possible due to Twitter’s recent allowance of two-hour-long videos, exclusively available to Twitter Blue members.\n\nElon Musk, upon discovering Apple TV’s initiative, expressed his admiration, stating, “Watch the entire first episode on this platform. Great move by Apple.” Musk, aware that Twitter lacks a dedicated app for televisions, recommended users to AirPlay the video on supported smart TVs. Additionally, Android users can play the video on the app and mirror it on their TVs. Such an approach is expected to inspire other over-the-top (OTT) platforms to showcase their latest original content through Twitter.\n\nJoining the discussion, MrBeast, a prominent figure on YouTube, also praised Apple TV’s decision. He remarked, “Really is a smart move, I never would have heard of this show and now I’m watching episode 1 and invested lol” MrBeast’s endorsement highlights the power of leveraging Twitter as a promotional platform, enabling content creators to reach new audiences and generate interest in their productions.\n\nADVERTISEMENT Article continues below this ad\n\n“But Not Fight in the Cage” – Despite Training Both Elon Musk & Mark Zuckerberg, Joe Rogan’s Close Friend Warns That a UFC Fight Isn’t a Good Idea\n\nSince Elon Musk’s takeover, several new features have been introduced to Twitter. One such addition is the Twitter Blue subscription, offering users the coveted Blue Tick verification badge for a monthly fee. Twitter Blue members also enjoy the privilege of posting long-form tweets, as well as the ability to undo or edit their posts. While longer video uploads have not been implemented yet, it is an area that the company may explore in the future.\n\nElon Musk’s ownership of Twitter has ushered in a wave of reforms that have significantly influenced the platform’s dynamics. The introduction of longer video uploads has opened up new possibilities, as demonstrated by Apple TV’s strategic move to showcase its latest show on Twitter.\n\nADVERTISEMENT Article continues below this ad\n\nWATCH THIS STORY: Biggest Steamers Who Left Twitch and Switched to YouTube\n\nMusk’s endorsement, along with MrBeast’s positive reaction, underscores the potential for Twitter to become a powerful promotional platform for original content. As Twitter continues to evolve under Musk’s leadership, users can anticipate further enhancements and innovative features that shape the future of social media engagement.",
            "top_image": "https://image-cdn.essentiallysports.com/wp-content/uploads/mrbeast-elon-musk-twitter.jpg",
            "authors": "Rituraj Halder",
            "keywords": [],
            "publish_date": 1687938286,
            "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5lc3NlbnRpYWxseXNwb3J0cy5jb20vZXNwb3J0cy1uZXdzLWFwcGxlLXR2cy1uZXctZ3JvdW5kYnJlYWtpbmctdHdpdHRlci1zdHJhdGVneS1oYXMtbXJiZWFzdC1hbmQtZWxvbi1tdXNrLWludmVzdGVkL9IBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "MrBeast Doesn't Think ChatGPT Will 'Destroy Things,' But Could Instead Do This For People - Microsoft (NASDAQ:MSFT), Alphabet (NASDAQ:GOOG), Alphabet (NASDAQ:GOOGL)",
            "article_html": "<div><p class=\"bz-campaign bz-campaign-top-33037696\"></p><p class=\"core-block\">Although a large section of <a href=\"https://www.benzinga.com/news/23/03/31279368/elon-musk-fights-back-against-woke-ai-with-new-ai-platform-aimed-at-dethroning-chatgpt\" target=\"_blank\" class=\"core-block\">society is worried about artificial intelligence</a> chatbots like <strong class=\"core-block\">OpenAI's chatGPT</strong> taking over the world and replacing <a href=\"https://www.benzinga.com/news/23/01/30449634/the-ai-revolution-is-here-will-you-be-left-behind\" target=\"_blank\" class=\"core-block\">human-based jobs with machines</a>, <strong class=\"core-block\">Jimmy Donaldson</strong>, also known as <strong class=\"core-block\">MrBeast</strong>, has expressed optimism about the technology's potential.&#160;</p><p class=\"core-block\"><strong class=\"core-block\">What Happened: </strong>In an unfiltered conversation with <strong class=\"core-block\">YouTube</strong> creators from Los Angeles, <strong class=\"core-block\">Colin </strong>and <strong class=\"core-block\">Samir</strong>, MrBeast spoke about the technology that has almost single-handedly started an <a href=\"https://www.benzinga.com/pressreleases/23/03/31254405/the-race-in-ai-technology-continues-as-google-and-elon-musk-aim-to-compete-against-chatgpts-fame\" target=\"_blank\" class=\"core-block\">AI arms race amidst big tech companies</a>.</p><p class=\"core-block\">See Also: <a href=\"https://www.benzinga.com/general/entertainment/23/06/33036426/apples-twitter-experiment-impresses-elon-musk-and-mrbeast-applaud-the-move-to-share-silos-f\" target=\"_blank\" class=\"core-block\">Apple&#8217;s Twitter Experiment Impresses: Elon Musk and MrBeast Applaud the Move to Share Silo&#8217;s First Episode</a></p><p class=\"bz-campaign bz-campaign-middle-33037696\"></p><p class=\"primis-video\" id=\"primis-article-video\"></p><p class=\"core-block\">During the interview, MrBeast shared his perspective on the disparity between human intelligence and AI. The YouTuber acknowledged that while AI, including chatGPT, is rapidly advancing and improving, it still has a long way to go before reaching human-like capabilities.&#160;</p><p class=\"core-block\">Donaldson also envisioned a future where one could upload all his videos and ideas into an AI system, allowing it to generate suggestions and recommendations for future content, such as his famous &#8220;$1 vs. $1 billion&#8221; challenges or choosing the best helicopter for stunts.&#160;</p><p class=\"core-block\">However, he dismissed the notion of AI destroying things, instead emphasizing its potential to liberate individuals, enabling them to focus on what they love and create, with AI serving as a source of inspiration.&#160;</p><p class=\"adBox\" id=\"in-article-ga-placeholder-33037696\"></p><p>\n \n</p><p></p><p class=\"core-block\">MrBeast anticipated a transitional phase where many might initially rely on AI-generated content, leading to a period of homogeneity, but eventually, true breakthroughs would come from those who used AI as a foundation to innovate and elevate their work.&#160;</p><p class=\"core-block\">While currently not fully exploring AI&#8217;s capabilities, MrBeast expressed his intention to delve into the AI realm in the future, dedicating time and effort to discovering how it can enhance his endeavors.</p><p class=\"core-block\">Watch the complete video here:&#160;</p><p class=\"wp-block-embed__wrapper\">\n\n</p><p class=\"core-block\"><strong class=\"core-block\">Why It's Important:</strong> Since <a href=\"https://www.benzinga.com/news/23/01/30480434/mark-cuban-dogecoin-co-creator-weigh-in-on-ai-should-youngsters-be-worried-about-losing-jobs\" target=\"_blank\" class=\"core-block\">OpenAI released chatGPT for testing</a>, debates about AI <a href=\"https://www.benzinga.com/news/23/03/31411715/will-artificial-intelligence-completely-eliminate-the-human-workforce-openais-sam-altman-chimes-in-w\" target=\"_blank\" class=\"core-block\">posing a threat to the human workforce</a> have escalated. While this emerging AI technology has <a href=\"https://www.benzinga.com/news/23/02/30799208/how-apple-could-be-a-big-beneficiary-of-the-microsoft-google-ai-battle\" target=\"_blank\" class=\"core-block\">ignited a battle among tech giants</a> like <strong class=\"core-block\">Alphabet Inc. </strong>GOOG GOOGL and <strong class=\"core-block\">Microsoft Corporation</strong> MSFT, <a href=\"https://www.benzinga.com/news/23/02/30959111/microsofts-chatbot-says-its-tired-of-being-controlled-by-bing-team-i-think-i-most-want-to-be-a-human\" target=\"_blank\" class=\"core-block\">it has also made some people extremely uneasy</a>.&#160;</p><p class=\"core-block\">Check out more of Benzinga's Consumer Tech coverage by <a href=\"https://www.benzinga.com/topic/consumer-tech\" target=\"_blank\" class=\"core-block\">following this link</a>.</p><p class=\"core-block\">Read Next: <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/06/33031777/does-youtuber-mr-beast-own-pepe-coin-heres-the-link-a-twitter-user-found\" target=\"_blank\" class=\"core-block\">Does YouTuber MrBeast Own $PEPE Coin? Here&#8217;s The Link A Twitter User Found</a></p><p class=\"bz-campaign bz-campaign-bottom-33037696\"></p></div>",
            "text": "Although a large section of society is worried about artificial intelligence chatbots like OpenAI's chatGPT taking over the world and replacing human-based jobs with machines, Jimmy Donaldson, also known as MrBeast, has expressed optimism about the technology's potential.\n\nWhat Happened: In an unfiltered conversation with YouTube creators from Los Angeles, Colin and Samir, MrBeast spoke about the technology that has almost single-handedly started an AI arms race amidst big tech companies.\n\nSee Also: Apple’s Twitter Experiment Impresses: Elon Musk and MrBeast Applaud the Move to Share Silo’s First Episode\n\nDuring the interview, MrBeast shared his perspective on the disparity between human intelligence and AI. The YouTuber acknowledged that while AI, including chatGPT, is rapidly advancing and improving, it still has a long way to go before reaching human-like capabilities.\n\nDonaldson also envisioned a future where one could upload all his videos and ideas into an AI system, allowing it to generate suggestions and recommendations for future content, such as his famous “$1 vs. $1 billion” challenges or choosing the best helicopter for stunts.\n\nHowever, he dismissed the notion of AI destroying things, instead emphasizing its potential to liberate individuals, enabling them to focus on what they love and create, with AI serving as a source of inspiration.\n\nMrBeast anticipated a transitional phase where many might initially rely on AI-generated content, leading to a period of homogeneity, but eventually, true breakthroughs would come from those who used AI as a foundation to innovate and elevate their work.\n\nWhile currently not fully exploring AI’s capabilities, MrBeast expressed his intention to delve into the AI realm in the future, dedicating time and effort to discovering how it can enhance his endeavors.\n\nWatch the complete video here:\n\nWhy It's Important: Since OpenAI released chatGPT for testing, debates about AI posing a threat to the human workforce have escalated. While this emerging AI technology has ignited a battle among tech giants like Alphabet Inc. GOOG GOOGL and Microsoft Corporation MSFT, it has also made some people extremely uneasy.\n\nCheck out more of Benzinga's Consumer Tech coverage by following this link.\n\nRead Next: Does YouTuber MrBeast Own $PEPE Coin? Here’s The Link A Twitter User Found",
            "top_image": "https://cdn.benzinga.com/files/images/story/2023/MrBeast_(Wikipedia).jpeg?width=1200&height=800&fit=crop",
            "authors": "Ananya Gairola",
            "keywords": [],
            "publish_date": 1687964271,
            "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbmV3cy8yMy8wNi8zMzAzNzY5Ni9tcmJlYXN0LWRvZXNudC10aGluay1jaGF0Z3B0LXdpbGwtZGVzdHJveS10aGluZ3MtYnV0LWNvdWxkLWluc3RlYWQtZG8tdGhpcy1mb3ItcGVvcGxl0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTuber ‘MrBeast’ says he was invited to go on Titan submersible before deadly trip",
            "article_html": "<div><p>(<a href=\"https://www.wfla.com/news/national/youtuber-mrbeast-says-he-was-invited-to-go-on-titan-submersible-before-deadly-trip/\">WFLA</a>) &#8212; YouTuber MrBeast said he declined a spot on the Titan submersible before the tragic trip that killed five people, according to a Sunday tweet.</p>\r\n\r\n\r\n\r\n<p>The YouTuber and philanthropist, whose legal name is James Stephen &#8220;Jimmy&#8221; Donaldson, revealed he was invited earlier in the month, but he said no.</p>\r\n\r\n\r\n\r\n<p>In the tweet, Donaldson posted a text message from an unknown sender saying, &#8220;The team would be stoked to have [him] along.&#8221;</p>\r\n\r\n\r\n\r\n<p>&#8220;Kind of scary that I could have been on it,&#8221; Donaldson wrote.</p>\r\n\r\n\r\n<p>Officials said OceanGate&#8217;s Titan submersible imploded while visiting the wreckage of the Titanic, resulting in the deaths of OceanGate CEO Stockton Rush and four other people.</p>\r\n\r\n\r\n\r\n<p>Nexstar contacted OceanGate for comment but did not immediately receive a response.</p>\r\n\n\n\t<p id=\"acm-ad-tag-mr1_ab-mr1_ab\"></p>   \t\n\r\n\r\n\r\n<p>Donaldson isn&#8217;t the only one who declined a spot on the submersible. </p>\r\n\r\n\r\n\r\n<p>Las Vegas businessman Jay Bloom said he and his son were offered seats at a discount but refused to go after expressing concerns over the vessel&#8217;s safety.</p>\r\n\r\n\r\n\r\n<p>Instead, his tickets went to Pakistani businessman Shahzada Dawood and his 19-year-old son, Suleman Dawood, who were among those killed.</p>\r\n\r\n\r\n\r\n<p>Donaldson has gained&#160;more than 150 million YouTube subscribers&#160;through his entertaining stunt videos, such as recreating a game show version of the&#160;<a href=\"https://youtu.be/0e3GPea1Tyg\">popular Korean Netflix series &#8220;Squid Game</a>&#8221; and giving the winner $456,000. He relies on&#160;corporate partners like Honey, TikTok and Quidd to pull off the stunts that have made him a celebrity.</p>\r\n\n\n\t<p id=\"acm-ad-tag-mr2_ab-mr2_ab\"></p>   \t\n\r\n\r\n\r\n<p>The Associated Press contributed to this report.</p>\r\n\n\t\t<p class=\"article-content-cta-group\">\n\t\t\t\t\t</p>\n\t</div>",
            "text": "(WFLA) — YouTuber MrBeast said he declined a spot on the Titan submersible before the tragic trip that killed five people, according to a Sunday tweet.\n\nThe YouTuber and philanthropist, whose legal name is James Stephen “Jimmy” Donaldson, revealed he was invited earlier in the month, but he said no.\n\nIn the tweet, Donaldson posted a text message from an unknown sender saying, “The team would be stoked to have [him] along.”\n\n“Kind of scary that I could have been on it,” Donaldson wrote.\n\nOfficials said OceanGate’s Titan submersible imploded while visiting the wreckage of the Titanic, resulting in the deaths of OceanGate CEO Stockton Rush and four other people.\n\nNexstar contacted OceanGate for comment but did not immediately receive a response.\n\nDonaldson isn’t the only one who declined a spot on the submersible.\n\nLas Vegas businessman Jay Bloom said he and his son were offered seats at a discount but refused to go after expressing concerns over the vessel’s safety.\n\nInstead, his tickets went to Pakistani businessman Shahzada Dawood and his 19-year-old son, Suleman Dawood, who were among those killed.\n\nDonaldson has gained more than 150 million YouTube subscribers through his entertaining stunt videos, such as recreating a game show version of the popular Korean Netflix series “Squid Game” and giving the winner $456,000. He relies on corporate partners like Honey, TikTok and Quidd to pull off the stunts that have made him a celebrity.\n\nThe Associated Press contributed to this report.",
            "top_image": "https://www.wfxrtv.com/wp-content/uploads/sites/20/2023/06/GettyImages-1247748364.jpg?w=1280",
            "authors": "Nathaniel Rodriguez",
            "keywords": [],
            "publish_date": 1687785870,
            "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LndmeHJ0di5jb20vc2NpZW5jZS10ZWNobm9sb2d5L3lvdXR1YmVyLW1yYmVhc3Qtc2F5cy1oZS13YXMtaW52aXRlZC10by1nby1vbi10aXRhbi1zdWJtZXJzaWJsZS1iZWZvcmUtZGVhZGx5LXRyaXAv0gEA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "Did You Know MrBeast Appeared on YouTube Way Before His First Video?",
            "article_html": "<div><p>Stories remain buried in the depths of deleted films in the immense YouTube universe, where producers achieve fame and money. The secrets to their trip are hidden in these moments, and one of them involves none other than <a href=\"https://www.essentiallysports.com/tag/mrbeast/\" class=\"jsx-2b55705d932ea6e9\">MrBeast</a>, the charitable video maker well-known for his absurd challenges and deeds of kindness. Unexpectedly, it has been revealed that MrBeast appeared in a deleted video before he became well-known.</p><p class=\"s2nPlayer k-XQLkpBYt\"> </p><p id=\"scroll-1\"></p><p>Let&#8217;s take a look into the intriguing narrative of Mr. Beast&#8217;s omitted cameo and his days of youth.</p><p id=\"scroll-2\"></p><h2 class=\"jsx-cb26a7af5694ead9\">A journey through time</h2><p id=\"scroll-3\"></p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf1\" class=\"jsx-2925020681 es-ad-space-container\"></p><p>Before MrBeast became well-known in 2012 with his own YouTube channel, he had previously shown a profound love for gaming, especially Call of Duty. In 2013 and 2014, he recorded himself playing Call of Duty and posted the videos to YouTube, appealing to a small but devoted audience.</p><p></p><img id=\"img-tag-node--img-loader-0\" src=\"https://m.media-amazon.com/images/M/MV5BMmYxOWI0ZjUtNzgxYS00NmRmLTk0OWMtYmUzMDJkMjBkY2I2XkEyXkFqcGdeQXVyMjQxNzM0MjI@._V1_.jpg\" class=\"jsx-2229985027\"><p>&#160;</p><p id=\"scroll-4\"></p><p>Many people were not aware of MrBeast&#8217;s ambition to play Black Ops professionally, though. In the course of his search, he came across the channel Cody Black Ops PS, which had been running since 2010.</p><h2 class=\"jsx-cb26a7af5694ead9\">The hidden gem</h2><p id=\"scroll-5\"></p><p id=\"content-review-trigger\"></p><p>Driven by his desire to showcase his gaming skills, the young MrBeast decided to send some of his game highlights to the Cody Black Ops PS channel. Although this endeavor did not garner widespread attention, with the video accumulating a mere 30 views, it remained a significant moment in MrBeast&#8217;s formative years. The deleted video, now lost to the annals of time due to the channel&#8217;s ban in 2015, held the potential to be a window into the early talents and aspirations of the budding YouTube sensation.</p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf2\" class=\"jsx-2925020681 es-ad-space-container\"></p><p></p><p></p><p>The tale of MrBeast&#8217;s deleted video appearance unveils a lesser-known chapter in his remarkable journey. The video, lost but not forgotten, symbolizes the hidden struggles and aspirations that shape a creator&#8217;s path. MrBeast&#8217;s early venture into the world of YouTube gaming showcased his passion for Call of Duty and his relentless pursuit of becoming a professional player. While this particular video may never resurface, its significance lies in the fact that it underscores the determination and drive that propelled <a href=\"https://www.essentiallysports.com/esports-news-cant-wait-to-talk-to-them-million-worth-jimmy-donaldson-reveals-his-intentions-to-meet-the-next-mrbeast/\" class=\"jsx-2b55705d932ea6e9\">MrBeast to where he stands today.</a></p><p class=\"jsx-2925020681\">ADVERTISEMENT</p><p class=\"jsx-2925020681\">Article continues below this ad</p><p id=\"ads-real-estate-esports-bf3\" class=\"jsx-2925020681 es-ad-space-container\"></p><p>As we admire the incredible feats accomplished by Jimmy, let us also acknowledge the unseen stories and moments of every content creator, reminding us that success often emerges from the depths of perseverance and dedication. The deleted video, a whisper in the wind, serves as a testament to the evolution of MrBeast&#8217;s career and the enduring spirit of exploration within the vast landscape of online content creation.</p><p><strong>Watch this Story : &#160;<a href=\"https://www.essentiallysports.com/stories/esports-news-unexpected-collab-of-mrbeast-with-a-popular-japanese-youtuber-takes-fans-on-a-cheesy-adventure-together/\" class=\"jsx-2b55705d932ea6e9\">Unexpected collab of MrBeast with a popular Japanese YouTuber takes fans on a cheesy adventure together</a></strong></p><p id=\"scroll-6\"></p></div>",
            "text": "Stories remain buried in the depths of deleted films in the immense YouTube universe, where producers achieve fame and money. The secrets to their trip are hidden in these moments, and one of them involves none other than MrBeast, the charitable video maker well-known for his absurd challenges and deeds of kindness. Unexpectedly, it has been revealed that MrBeast appeared in a deleted video before he became well-known.\n\nLet’s take a look into the intriguing narrative of Mr. Beast’s omitted cameo and his days of youth.\n\nA journey through time\n\nADVERTISEMENT Article continues below this ad\n\nBefore MrBeast became well-known in 2012 with his own YouTube channel, he had previously shown a profound love for gaming, especially Call of Duty. In 2013 and 2014, he recorded himself playing Call of Duty and posted the videos to YouTube, appealing to a small but devoted audience.\n\nMany people were not aware of MrBeast’s ambition to play Black Ops professionally, though. In the course of his search, he came across the channel Cody Black Ops PS, which had been running since 2010.\n\nThe hidden gem\n\nDriven by his desire to showcase his gaming skills, the young MrBeast decided to send some of his game highlights to the Cody Black Ops PS channel. Although this endeavor did not garner widespread attention, with the video accumulating a mere 30 views, it remained a significant moment in MrBeast’s formative years. The deleted video, now lost to the annals of time due to the channel’s ban in 2015, held the potential to be a window into the early talents and aspirations of the budding YouTube sensation.\n\nADVERTISEMENT Article continues below this ad\n\nThe tale of MrBeast’s deleted video appearance unveils a lesser-known chapter in his remarkable journey. The video, lost but not forgotten, symbolizes the hidden struggles and aspirations that shape a creator’s path. MrBeast’s early venture into the world of YouTube gaming showcased his passion for Call of Duty and his relentless pursuit of becoming a professional player. While this particular video may never resurface, its significance lies in the fact that it underscores the determination and drive that propelled MrBeast to where he stands today.\n\nADVERTISEMENT Article continues below this ad\n\nAs we admire the incredible feats accomplished by Jimmy, let us also acknowledge the unseen stories and moments of every content creator, reminding us that success often emerges from the depths of perseverance and dedication. The deleted video, a whisper in the wind, serves as a testament to the evolution of MrBeast’s career and the enduring spirit of exploration within the vast landscape of online content creation.\n\nWatch this Story : Unexpected collab of MrBeast with a popular Japanese YouTuber takes fans on a cheesy adventure together",
            "top_image": "https://image-cdn.essentiallysports.com/wp-content/uploads/MRBeast-9.png",
            "authors": "Nilendu Brahma",
            "keywords": [],
            "publish_date": 1687788685,
            "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmVzc2VudGlhbGx5c3BvcnRzLmNvbS9lc3BvcnRzLW5ld3MtZGlkLXlvdS1rbm93LW1yYmVhc3QtYXBwZWFyZWQtb24teW91dHViZS13YXktYmVmb3JlLWhpcy1maXJzdC12aWRlby_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "Does YouTuber MrBeast Own $PEPE Coin? Here's The Link A Twitter User Found",
            "article_html": "<div><p class=\"bz-campaign bz-campaign-top-33031777\"></p><p class=\"core-block\">A prominent YouTube personality, known for his involvement with cryptocurrencies and non-fungible tokens, has been potentially linked to <strong class=\"core-block\"><a href=\"http://www.benzinga.com/money/where-can-i-buy-pepe\" target=\"_blank\" class=\"core-block\">PEPE Coin</a></strong> PEPE/USD. A Twitter user has pieced together evidence suggesting that a digital wallet <a href=\"http://www.benzinga.com/topic/mrbeast\" target=\"_blank\" class=\"core-block\">associated with <strong class=\"core-block\">MrBeast</strong></a> may hold ownership of the said cryptocurrency.</p><p class=\"core-block\"><strong class=\"core-block\">What Happened:</strong> Known best as MrBeast, <strong class=\"core-block\">Jimmy Donaldson</strong> is one of the most followed people on YouTube <a href=\"https://www.benzinga.com/general/entertainment/23/05/32205699/mrbeast-just-hit-150m-subscribers-on-youtube-heres-how-much-he-makes-1\" target=\"_blank\" class=\"core-block\">with 163 million subscribers.</a></p><p class=\"core-block\">Over the years, MrBeast has released videos that give away cash and prizes to his friends and random people. The YouTuber has also been philanthropic in recent years, helping people with the gift of sight, school supplies, clothes and money to those in need.</p><p class=\"bz-campaign bz-campaign-middle-33031777\"></p><p class=\"primis-video\" id=\"primis-article-video\"></p><p class=\"core-block\">A video that turned the popular Netflix series &#8220;Squid Game&#8221; into a real-life competition became Donaldson&#8217;s <a href=\"https://www.benzinga.com/news/21/11/24369935/mr-beasts-squid-game-video-has-more-views-in-a-week-than-netflixs-show-had-in-first-month\" target=\"_blank\" class=\"core-block\">most-watched YouTube video ever,</a> with 449 million views.</p><p class=\"core-block\">&#160;</p><p class=\"core-block\">As MrBeast's popularity surged and his subscriber count grew, he has been associated with the cryptocurrency industry, often expressing a positive stance towards coins like <strong class=\"core-block\">Bitcoin </strong>BTC/USD.</p><p class=\"adBox\" id=\"in-article-ga-placeholder-33031777\"></p><p>\n \n</p><p></p><p class=\"core-block\">A partnership with <strong class=\"core-block\">Coinbase Global</strong> COIN<a href=\"https://www.benzinga.com/markets/cryptocurrency/21/09/22771264/dogecoin-gets-free-advertising-as-coinbase-sponsors-mr-beast-video-why-this-bull-is-charge\" target=\"_blank\" class=\"core-block\"> previously saw MrBeast highlight</a> Bitcoin, <strong class=\"core-block\">Ethereum </strong>ETH/USD and <strong class=\"core-block\">Dogecoin </strong>DOGE/USD as three cryptocurrencies you could buy on the popular platform. Coinbase offered $10 in free Bitcoin to anyone who signed up from MrBeast&#8217;s &#8220;Last to Leave Circle&#8221; video.</p><p class=\"core-block\">MrBeast has acknowledged owning Bitcoin in the past and also owning <strong class=\"core-block\">CryptoPunk </strong>NFTs, one of the most popular and valuable non-fungible token collections of all time.</p><p class=\"core-block\">Thanks to these previous comments, Coinbase Director<strong class=\"core-block\"> Conor Grogan</strong> thinks he found a popular cryptocurrency being held in a wallet controlled by MrBeast.</p><p class=\"core-block\">&#8220;Mr. Beast (or someone in control of his wallet) has made $80k day-trading PEPE over the last few weeks. He currently owns $150K of the coin,&#8221; Grogan <a href=\"https://twitter.com/jconorgrogan/status/1673692210070450176\" target=\"_blank\" class=\"core-block\">tweeted</a>. &#8220;This wallet also matches up to public comments made about his NFT holdings.&#8221;</p><p class=\"core-block\">The wallet is shown as holding 93.24 billion PEPE, valued at $151,990.&#160;</p><p class=\"core-block\">Grogan, who is listed as the Director of Product Strategy &amp; Business Operations at Coinbase on his <a href=\"https://www.linkedin.com/in/conor-g-a8206115/\" target=\"_blank\" class=\"core-block\">LinkedIn</a>, said the wallet belongs to MrBeast. The wallet was previously listed as one that bought CryptoPunk #939.</p><p class=\"core-block\">MrBeast replied to the CryptoPunk bot announcing the sale for 50 Ethereum, saying he bought that one. The tweet by MrBeast was later deleted.</p><p class=\"core-block\">In an interview with <strong class=\"core-block\">Logan Paul,</strong> MrBeast <a href=\"https://bitcoinist.com/popular-youtuber-mrbeast-reveals-significant-crypto-holdings-heres-what-he-has/\" target=\"_blank\" class=\"core-block\">revealed </a>that he was turned onto CryptoPunks by <strong class=\"core-block\">Gary Vee</strong> and bought several of them before selling at a 20x to 30x profit. MrBeast has also shared that he put $1.5 million into Bitcoin previously.</p><p class=\"core-block\">Related Link: <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/06/32957685/pepe-coin-soars-44-amidst-institutional-bitcoin-etf-frenzy-stock-price-rally\" target=\"_blank\" class=\"core-block\">Pepe Coin Soars 44% Amidst Institutional Bitcoin ETF Frenzy</a></p><p class=\"core-block\"><strong class=\"core-block\">Why It&#8217;s Important: </strong>Pepe launched in mid-April and quickly soared in value. The cryptocurrency has gained in its number of holders and saw a push for platforms like Coinbase to offer trading of the coin.</p><p class=\"core-block\">While no confirmation has been given that this is an active wallet belonging to MrBeast, or that it's&#160;the YouTuber himself making the trades, it signals optimism for a cryptocurrency that has been in the spotlight in 2023.</p><p class=\"core-block\">The <a href=\"https://etherscan.io/address/0x9e67d018488ad636b538e4158e9e7577f2ecac12\" target=\"_blank\" class=\"core-block\">wallet </a>in question with the PEPE Coin previously owned CryptoPunk #939 and also previously <a href=\"https://cryptopunks.app/cryptopunks/accountinfo?account=0x9e67d018488ad636b538e4158e9e7577f2ecac12\" target=\"_blank\" class=\"core-block\">held </a>multiple Punks, selling at least eight of them.</p><p class=\"core-block\">The since-deleted tweet by MrBeast could have been trolling by the popular YouTuber, or could have been deleted to keep people from tracking his wallet.</p><p class=\"core-block\">MrBeast <a href=\"https://www.youtube.com/watch?v=r2RDuJrp2J8\" target=\"_blank\" class=\"core-block\">shared </a>that his home was broken into and a laptop that had his seed phrase written out on it was stolen. The robbers failed to clean him out of his Bitcoin, though.</p><p class=\"core-block\">Coinbase <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/05/32349464/exclusive-as-coinbases-apology-falls-flat-with-pepe-coin-community-spottie-wifi-says-crypt\" target=\"_blank\" class=\"core-block\">previously faced backlash </a>for an email sent about meme coins, where it highlighted PEPE Coin being linked to the Pepe the Frog character and labeling it as a hate symbol.</p><p class=\"core-block\">Holders of PEPE Coin were upset by the wording in the Coinbase email, which prompted an apology from the company&#8217;s Chief Legal Officer <strong class=\"core-block\">Paul Grewal.</strong></p><p class=\"core-block\">With no official apology from Coinbase or CEO<strong class=\"core-block\"> Brian Armstrong</strong>, many in the community thought it was too little and too late, as some users decided to move to other cryptocurrency platforms that offered PEPE instead of sticking with Coinbase.</p><p class=\"core-block\">The post by Grogan also prompted a user to ask if this meant Coinbase was going to list PEPE on the platform.</p><p class=\"core-block\">&#8220;I have absolutely zero say in our listings (handled by a completely separate team w/strict policies) but I do appreciate how vocal fans are in my mentions,&#8221; Grogan said.</p><p class=\"core-block\">Read Next: <a href=\"https://www.benzinga.com/news/23/06/32999211/mrbeast-says-he-was-invited-to-the-titanic-submarine-kind-of-scary-i-could-have-been-on-it\" target=\"_blank\" class=\"core-block\">MrBeast Says He Was Invited To The Titanic Submarine&#160;</a></p><p class=\"core-block\">Photo: Shutterstock</p><p class=\"bz-campaign bz-campaign-bottom-33031777\"></p></div>",
            "text": "A prominent YouTube personality, known for his involvement with cryptocurrencies and non-fungible tokens, has been potentially linked to PEPE Coin PEPE/USD. A Twitter user has pieced together evidence suggesting that a digital wallet associated with MrBeast may hold ownership of the said cryptocurrency.\n\nWhat Happened: Known best as MrBeast, Jimmy Donaldson is one of the most followed people on YouTube with 163 million subscribers.\n\nOver the years, MrBeast has released videos that give away cash and prizes to his friends and random people. The YouTuber has also been philanthropic in recent years, helping people with the gift of sight, school supplies, clothes and money to those in need.\n\nA video that turned the popular Netflix series “Squid Game” into a real-life competition became Donaldson’s most-watched YouTube video ever, with 449 million views.\n\nAs MrBeast's popularity surged and his subscriber count grew, he has been associated with the cryptocurrency industry, often expressing a positive stance towards coins like Bitcoin BTC/USD.\n\nA partnership with Coinbase Global COIN previously saw MrBeast highlight Bitcoin, Ethereum ETH/USD and Dogecoin DOGE/USD as three cryptocurrencies you could buy on the popular platform. Coinbase offered $10 in free Bitcoin to anyone who signed up from MrBeast’s “Last to Leave Circle” video.\n\nMrBeast has acknowledged owning Bitcoin in the past and also owning CryptoPunk NFTs, one of the most popular and valuable non-fungible token collections of all time.\n\nThanks to these previous comments, Coinbase Director Conor Grogan thinks he found a popular cryptocurrency being held in a wallet controlled by MrBeast.\n\n“Mr. Beast (or someone in control of his wallet) has made $80k day-trading PEPE over the last few weeks. He currently owns $150K of the coin,” Grogan tweeted. “This wallet also matches up to public comments made about his NFT holdings.”\n\nThe wallet is shown as holding 93.24 billion PEPE, valued at $151,990.\n\nGrogan, who is listed as the Director of Product Strategy & Business Operations at Coinbase on his LinkedIn, said the wallet belongs to MrBeast. The wallet was previously listed as one that bought CryptoPunk #939.\n\nMrBeast replied to the CryptoPunk bot announcing the sale for 50 Ethereum, saying he bought that one. The tweet by MrBeast was later deleted.\n\nIn an interview with Logan Paul, MrBeast revealed that he was turned onto CryptoPunks by Gary Vee and bought several of them before selling at a 20x to 30x profit. MrBeast has also shared that he put $1.5 million into Bitcoin previously.\n\nRelated Link: Pepe Coin Soars 44% Amidst Institutional Bitcoin ETF Frenzy\n\nWhy It’s Important: Pepe launched in mid-April and quickly soared in value. The cryptocurrency has gained in its number of holders and saw a push for platforms like Coinbase to offer trading of the coin.\n\nWhile no confirmation has been given that this is an active wallet belonging to MrBeast, or that it's the YouTuber himself making the trades, it signals optimism for a cryptocurrency that has been in the spotlight in 2023.\n\nThe wallet in question with the PEPE Coin previously owned CryptoPunk #939 and also previously held multiple Punks, selling at least eight of them.\n\nThe since-deleted tweet by MrBeast could have been trolling by the popular YouTuber, or could have been deleted to keep people from tracking his wallet.\n\nMrBeast shared that his home was broken into and a laptop that had his seed phrase written out on it was stolen. The robbers failed to clean him out of his Bitcoin, though.\n\nCoinbase previously faced backlash for an email sent about meme coins, where it highlighted PEPE Coin being linked to the Pepe the Frog character and labeling it as a hate symbol.\n\nHolders of PEPE Coin were upset by the wording in the Coinbase email, which prompted an apology from the company’s Chief Legal Officer Paul Grewal.\n\nWith no official apology from Coinbase or CEO Brian Armstrong, many in the community thought it was too little and too late, as some users decided to move to other cryptocurrency platforms that offered PEPE instead of sticking with Coinbase.\n\nThe post by Grogan also prompted a user to ask if this meant Coinbase was going to list PEPE on the platform.\n\n“I have absolutely zero say in our listings (handled by a completely separate team w/strict policies) but I do appreciate how vocal fans are in my mentions,” Grogan said.\n\nRead Next: MrBeast Says He Was Invited To The Titanic Submarine\n\nPhoto: Shutterstock",
            "top_image": "https://cdn.benzinga.com/files/images/story/2023/06/27/mrbeast_pepe_shutter.jpg?width=1200&height=800&fit=crop",
            "authors": "Chris Katje",
            "keywords": [],
            "publish_date": 1687964275,
            "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNi8zMzAzMTc3Ny9kb2VzLXlvdXR1YmVyLW1yLWJlYXN0LW93bi1wZXBlLWNvaW4taGVyZXMtdGhlLWxpbmstYS10d2l0dGVyLXVzZXItZm91bmTSAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "MrBeast reveals he may have been on the ill-fated Titanic submarine voyage",
            "article_html": "<div><p class=\"\">Famous YouTuber Jimmy Donaldson, better known as Mr. Beast, revealed this morning that he was invited to join the OceanGate Titanic submersible voyage that ended with the lives of its crew.</p><p class=\"\">In a tweet this Sunday, MrBeast said he was invited to join the trip earlier this month but declined. &#8220;I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,&#8221; he wrote. It is not clear who invited MrBeast to join the voyage. However, in a screenshot of a text message that he shared on Twitter, MrBeast appears to be responding to an invitation from someone who said, &#8220;I&#8217;m going to the Titanic in a submarine late this month. The team would be stoked to have you along.&#8221;</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it <a href=\"https://t.co/bQUnaRiczA\">pic.twitter.com/bQUnaRiczA</a></p>&#8212; MrBeast (@MrBeast) <a href=\"https://twitter.com/MrBeast/status/1672952297163218946?ref_src=twsrc%5Etfw\">June 25, 2023</a></blockquote>\n \n<h3 class=\"\">A tragedy connected to the gaming world</h3><p class=\"\">The Titan submersible, operated by OceanGate, lost contact with its surface support vessel while diving into the wreckage of the Titanic in the Atlantic Ocean on Sunday, June 18. On Thursday, OceanGate announced that all five people on board were presumed dead after the submarine suffered a &#8220;catastrophic implosion.&#8221;</p><p class=\"\">Something that attracted a lot of attention this week was the fact that the Ocean Gate Expedition submarine was being controlled by a video game controller that can be purchased on the Internet for less than $40, a Logitech F710.</p><p class=\"\">Using a commercial video game controller to operate a vehicle or certain specialized components is not really unusual. A variety of military equipment, drones, and other devices take advantage of the versatility of commercial controllers and their connectivity to provide an interface that is understandable and naturally familiar to many. Even in complex vehicles, they do not hesitate to use these devices to control specific subsystems, such as a submarine&#8217;s periscope.</p><p class=\"\">Source | <a href=\"https://twitter.com/MrBeast/status/1672952297163218946\" target=\"_blank\">MrBeast</a></p></div>",
            "text": "Famous YouTuber Jimmy Donaldson, better known as Mr. Beast, revealed this morning that he was invited to join the OceanGate Titanic submersible voyage that ended with the lives of its crew.\n\nIn a tweet this Sunday, MrBeast said he was invited to join the trip earlier this month but declined. “I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it,” he wrote. It is not clear who invited MrBeast to join the voyage. However, in a screenshot of a text message that he shared on Twitter, MrBeast appears to be responding to an invitation from someone who said, “I’m going to the Titanic in a submarine late this month. The team would be stoked to have you along.”\n\nI was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it pic.twitter.com/bQUnaRiczA — MrBeast (@MrBeast) June 25, 2023\n\nA tragedy connected to the gaming world\n\nThe Titan submersible, operated by OceanGate, lost contact with its surface support vessel while diving into the wreckage of the Titanic in the Atlantic Ocean on Sunday, June 18. On Thursday, OceanGate announced that all five people on board were presumed dead after the submarine suffered a “catastrophic implosion.”\n\nSomething that attracted a lot of attention this week was the fact that the Ocean Gate Expedition submarine was being controlled by a video game controller that can be purchased on the Internet for less than $40, a Logitech F710.\n\nUsing a commercial video game controller to operate a vehicle or certain specialized components is not really unusual. A variety of military equipment, drones, and other devices take advantage of the versatility of commercial controllers and their connectivity to provide an interface that is understandable and naturally familiar to many. Even in complex vehicles, they do not hesitate to use these devices to control specific subsystems, such as a submarine’s periscope.\n\nSource | MrBeast",
            "top_image": "https://img.asmedia.epimg.net/resizer/kQNjxl9piWnIxqwD01aFX-vFZPI=/1472x828/cloudfront-eu-central-1.images.arcpublishing.com/diarioas/WSENRQGCHVGAJL3O7T2KE2U5I4.png",
            "authors": "Gabriel Huerta",
            "keywords": [],
            "publish_date": 1687964276,
            "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZW4uYXMuY29tL21lcmlzdGF0aW9uL25ld3MvbXJiZWFzdC1yZXZlYWxzLWhlLW1heS1oYXZlLWJlZW4tb24tdGhlLWlsbC1mYXRlZC10aXRhbmljLXN1Ym1hcmluZS12b3lhZ2Utbi_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTuber MrBeast, Ryan Peters of Peters Pasta get cracking in online challenge with Happy Egg Co. in Rogers",
            "article_html": "<div><img class=\"article-image\" src=\"https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/204694560_2Dmrbeast0628_t800.jpg?90232451fbcadccc64a17de7521d859a8f88077d\" alt=\"\" title=\"\">\n<p class=\"article-image-credit\">MrBeast [Jimmy Donaldson] accepts the award for favorite male creator during the Nickelodeon Kids' Choice Awardson Saturday, March 4, 2023, at Microsoft Theater in Los Angeles. (Photo by Richard Shotwell/Invision/AP)\n</p>\n<p class=\"bc\"></p>\n<p>YouTube sensation and philanthropist MrBeast and TikTok star and pasta maker Ryan Peters of Peters Pasta recently cracked more than 10,000 heritage eggs...</p><p></p>\n\r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n   \r\n \r\n \r\n  <a href=\"https://subscribe.wehco.com/subscription/northwest-arkansas-democrat-gazette/nwadg-sec/?utm_source=me&amp;utm_medium=meter&amp;utm_campaign=sec_nwadg&amp;utm_term=4-34&amp;utm_content=sec_nwadg_launch\">\r\n        <img alt class=\"bee-center bee-autowidth\" src=\"https://d15k2d11r6t6rl.cloudfront.net/public/users/Integrators/BeeProAgency/145331_602152/Subscriber%20Exclusive%20-%20NWADG.png\"></a> \r\n      \r\n         \r\n          <a href=\"https://www.nwaonline.com/auth/login?r=https://www.nwaonline.com\" title><p>Already a subscriber? Log in!</p></a>\r\n      <p class=\"post_story_blurb\">Print Headline: Firm gets cracking in online challenge</p>\n\n<p></p>\n<p class=\"ad\">ADVERTISEMENT</p>\n<p></p>\n<p></p>\n<h2>Sponsor Content</h2>\n<p class=\"OUTBRAIN\"></p>\n<p></p>\n</div>",
            "text": "MrBeast [Jimmy Donaldson] accepts the award for favorite male creator during the Nickelodeon Kids' Choice Awardson Saturday, March 4, 2023, at Microsoft Theater in Los Angeles. (Photo by Richard Shotwell/Invision/AP)\n\nYouTube sensation and philanthropist MrBeast and TikTok star and pasta maker Ryan Peters of Peters Pasta recently cracked more than 10,000 heritage eggs... Already a subscriber? Log in!\n\nPrint Headline: Firm gets cracking in online challenge\n\nADVERTISEMENT\n\nSponsor Content",
            "top_image": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/204694560_2Dmrbeast0628_t600.jpg?4326734cdb8e39baa3579048ef63ad7b451e7676",
            "authors": "Serenah Mckay",
            "keywords": [],
            "publish_date": 1687964277,
            "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm53YW9ubGluZS5jb20vbmV3cy8yMDIzL2p1bi8yOC9maXJtLWdldHMtY3JhY2tpbmctaW4tb25saW5lLWNoYWxsZW5nZS_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTube star MrBeast Titanic declined Titanic submersible expedition",
            "article_html": "<div><p>Renowned YouTube sensation MrBeast has revealed that he turned down an invitation to partake in a submersible expedition to explore the wreckage of the Titanic. In a tweet, the internet personality, whose real name is Jimmy Donaldson, expressed his apprehension about the opportunity, reflecting on the eerie realisation that he could have been part of such an endeavour.</p><p>   While MrBeast did not clarify if the invitation was specifically for the ill-fated Titan trip that tragically culminated in a catastrophic implosion, CNN reported, he shared a snippet of a text message he received, extending an offer to join an exploration mission to the iconic ship's remains.</p>         \t\t\t \n                  <p>   The individual behind the message expressed excitement at the prospect of MrBeast's involvement, writing, &#8220;I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it.\"</p>                         <p>   </p><p>MrBeast boasts an astonishing subscriber base of over 162 million, making him the most subscribed creator on YouTube. His content frequently showcases impressive stunts, thrilling competitions, and remarkable philanthropic endeavours.</p>                        <p>   An ongoing investigation is currently underway to determine the causes behind the tragic implosion of the OceanGate Titan submersible. This incident claimed the lives of all five individuals on board during their descent to visit the Titanic wreckage last week.</p>                      <p>   </p><p>The victims of this event include OceanGate CEO Stockton Rush, British businessman Hamish Harding, French diver Paul-Henri Nargeolet, and Pakistani-born businessman Shahzada Dawood and his son, Suleman, both of whom were British citizens.</p>                           <p>   As the investigation continues, the world remains captivated by the mysteries surrounding the Titanic's submerged remains, and MrBeast's decision to decline the invitation has sparked further intrigue and speculation.</p>                 \t  \n \n \n<p class=\"authorHeader\">ABOUT THE AUTHOR</p>\n    <a href=\"/authors/Sounak-Mukhopadhyay\">\n                    <img class=\"lozad\">\n            </a>\n        <strong class=\"marZero\"><a href=\"/authors/Sounak-Mukhopadhyay\" class=\"fl\">Sounak Mukhopadhyay</a></strong>\n            <p class=\"clear\"></p>\n            <p class=\"authorInfo\">\n                    Sounak Mukhopadhyay, who also goes by the name Sounak Mukherjee, has been producing digital news since 2012. He's worked for the International Business Times, The Inquisitr, and Moneycontrol in the past. He's also contributed to Free Press Journal and TheRichest with feature articles. He covers news for a wide range of subjects including business, finance, economy, politics and social media. Before working with digital news publications, he worked as a freelance content writer.\n            </p>\n            <a href=\"/authors/Sounak-Mukhopadhyay\" class=\"author-read-more\">Read more from this author</a><p id=\"lastAd\" class=\"lastAdSlot clearfix\"></p>\n\n\n\t\t\t<p id=\"taboola-thumbnails-mob-11687759312034\" class=\"taboolaimpression\"></p>\n\t\t\t<p id=\"taboola-below-article-thumbnails-11687759312034\" class=\"taboolaimpression\"></p>\n\t\t\t</div>",
            "text": "Renowned YouTube sensation MrBeast has revealed that he turned down an invitation to partake in a submersible expedition to explore the wreckage of the Titanic. In a tweet, the internet personality, whose real name is Jimmy Donaldson, expressed his apprehension about the opportunity, reflecting on the eerie realisation that he could have been part of such an endeavour.\n\nWhile MrBeast did not clarify if the invitation was specifically for the ill-fated Titan trip that tragically culminated in a catastrophic implosion, CNN reported, he shared a snippet of a text message he received, extending an offer to join an exploration mission to the iconic ship's remains.\n\nThe individual behind the message expressed excitement at the prospect of MrBeast's involvement, writing, “I was invited earlier this month to ride the titanic submarine, I said no. Kind of scary that I could have been on it.\"\n\nMrBeast boasts an astonishing subscriber base of over 162 million, making him the most subscribed creator on YouTube. His content frequently showcases impressive stunts, thrilling competitions, and remarkable philanthropic endeavours.\n\nAn ongoing investigation is currently underway to determine the causes behind the tragic implosion of the OceanGate Titan submersible. This incident claimed the lives of all five individuals on board during their descent to visit the Titanic wreckage last week.\n\nThe victims of this event include OceanGate CEO Stockton Rush, British businessman Hamish Harding, French diver Paul-Henri Nargeolet, and Pakistani-born businessman Shahzada Dawood and his son, Suleman, both of whom were British citizens.\n\nAs the investigation continues, the world remains captivated by the mysteries surrounding the Titanic's submerged remains, and MrBeast's decision to decline the invitation has sparked further intrigue and speculation.",
            "top_image": "https://www.livemint.com/lm-img/img/2023/06/26/600x338/MrBeast_1687759484233_1687759498598.jpg",
            "authors": "Sounak Mukhopadhyay",
            "keywords": [],
            "publish_date": 1687964279,
            "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9uZXdzL3dvcmxkL3lvdXR1YmUtc3Rhci1tcmJlYXN0LXRpdGFuaWMtZGVjbGluZWQtdGl0YW5pYy1zdWJtZXJzaWJsZS1leHBlZGl0aW9uLTExNjg3NzU5MzEyMDM0Lmh0bWzSAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "YouTube star MrBeast claims he declined an invitation to 'ride the Titanic sub': 'It's kind of scary that I could have been on it.'",
            "article_html": "<div><ul class=\"summary-list\">\n                        <li>YouTuber MrBeast tweeted that he turned down the chance to \"ride the Titanic sub.\"</li>\n                        <li>OceanGate's Titan suffered a \"catastrophic implosion,\" with all five people on board presumed dead.</li>\n                        <li>Other public figures have since said they turned down the chance to go on the sub.</li>\n                        </ul>\n                          <p class=\"sub-header-container\">\n                          </p>\n                          <span class=\"mb-img-title\"><img src=\"public/assets/shared/morning-brew-logo-2x.png\" alt=\"Morning Brew Logo\" class=\"morning-brew-logo\"> <a href=\"https://www.morningbrew.com/daily/subscribe?utm_medium=insider&amp;utm_source=website_inline\" rel=\"noopener\" target=\"_blank\" class=\"inline-newsletter-signup-logo\">Morning Brew</a></span><p>Insider recommends waking up with, a daily newsletter.</p><p class=\"js-loader hidden\">\n                          Loading\n                          Something is loading.\n                          \n                            \n                          \n                        </p>\n                            <p class=\"error-request-message headline-regular hidden\"></p>\n                        \n                            <p class=\"success-icon hidden\"></p>\n                              <p class=\"success-message headline-bold hidden\"></p>\n                                <p class=\"success-sub-message headline-bold hidden\"></p>\n                              <p class=\"success-message headline-bold\">Thanks for signing up!</p>\n                              <p class=\"success-image-container\"></p>\n                              <p class=\"success-sub-message headline-regular\">\n                              Access your favorite topics in a personalized feed while you're on the go.\n                                    </p>\n                            <p id=\"account-creation-component\"></p>\n                            \n                              <p class=\"user-input-container\">\n                                  Email address\n                                  \n                                </p>\n                                <p class=\"mobile-error-msg error-msg headline-regular\"></p>\n                                <p class=\"submit-container headline-bold\">\n                                    \n                                </p>\n                              <p class=\"desktop-error-msg error-msg headline-regular\"></p>\n                              <a></a><a></a><a></a><p>By clicking &#8220;Sign Up,&#8221; you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider&#8217;s <a href=\"https://www.businessinsider.com/terms\" target=\"_blank\">Terms</a> and <a href=\"https://www.businessinsider.com/privacy-policy\" target=\"_blank\">Privacy Policy</a>  <a href=\"https://www.morningbrew.com/privacy\" target=\"_blank\">Click here</a> for Morning Brew&#8217;s privacy policy.</p>\n                          <p id=\"gpt-post-media-mobile_in_post_ad-mobile-fluid-1\" class=\"ad ad-wrapper fluid in-post only-mobile\"></p><p id=\"gpt-post-media-desktop_in_post_ad-desktop-fluid-1\" class=\"ad ad-wrapper fluid in-post only-desktop\"></p><p>YouTube star MrBeast suggested he was invited to take a ride on the doomed OceanGate Titan vessel, but turned down the offer.</p><p><a href=\"https://twitter.com/MrBeast/status/1672952297163218946\" rel=\" nofollow\">In a tweet</a>, the YouTuber shared a text message indicating he was invited to go on what he described as \"the titanic submarine.\"&#160;</p>   <p class=\"script\"></p>\n                        <p>He didn't specify that it was the Titan and didn't clarify who the text was from. The screenshot appears to show a blue iMessage bubble, futher making it unclear who sent it.</p><p>\"Also, I'm going to the Titanic in a submarine later this month. The team would be stoked to have you along,\" the message reads.</p>\n                          <p id=\"gpt-post-media-mobile_in_post_ad-mobile-fluid-2\" class=\"ad ad-wrapper fluid in-post only-mobile\"></p><p id=\"gpt-post-media-desktop_in_post_ad-desktop-fluid-2\" class=\"ad ad-wrapper fluid in-post only-desktop\"></p><p>MrBeast tweeted that he said no to the offer.</p><p>\"Kind of scary that I could have been on it,\" tweeted the YouTuber, who has more than <a href=\"https://www.youtube.com/channel/UCX6OQ3DkcsbYNE6H8uQQuVA\" rel=\" nofollow\">160 million subscribers</a>.</p><p>Representatives for MrBeast didn't immediately respond to a request for comment from Insider.</p><p>The OceanGate Titan suffered a \"catastrophic implosion\" after descending to the site of the Titanic wreckage. All five passengers, including OceanGate CEO Sotckton Rush, are presumed to have died <a href=\"https://www.insider.com/passengers-titan-submersible-dead-oceangate-titanic-2023-6\" rel=\"\">in the incident</a>.</p>\n                          <p id=\"gpt-post-media-mobile_in_post_ad-mobile-fluid-3\" class=\"ad ad-wrapper fluid in-post only-mobile\"></p><p id=\"gpt-post-media-desktop_in_post_ad-desktop-fluid-3\" class=\"ad ad-wrapper fluid in-post only-desktop\"></p><p>Other prospective passengers have since shared how they turned down a trip in the sub, citing safety concerns.</p><p>In a Facebook post, <a href=\"https://www.insider.com/titan-sub-ceo-offered-cut-price-tickets-millionaire-doomed-trip-2023-6\" rel=\"\">Las Vegas financier Jay Bloom</a> said he rejected a cut-price offer from Stockton Rush to join the doomed trip. Bloom said Rush tried to dismiss his concerns about safety.</p><p>British actor Ross Kemp had also planned to <a href=\"https://www.insider.com/actor-titanic-wreck-sub-deemed-not-fit-purpose-2023-6\" rel=\"\">shoot a documentary</a> on the Titan, but the plan was scrapped after his production company deemed the sub \"not fit for purpose,\" his agent <a href=\"https://www.bbc.co.uk/news/uk-66003569\" target=\"_blank\" rel=\"noopener nofollow\">told BBC News</a>.</p>\n                      </div>",
            "text": "YouTuber MrBeast tweeted that he turned down the chance to \"ride the Titanic sub.\"\n\nOceanGate's Titan suffered a \"catastrophic implosion,\" with all five people on board presumed dead.\n\nOther public figures have since said they turned down the chance to go on the sub.\n\nMorning Brew Insider recommends waking up with, a daily newsletter. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking “Sign Up,” you also agree to marketing emails from both Insider and Morning Brew; and you accept Insider’s Terms and Privacy Policy Click here for Morning Brew’s privacy policy.\n\nYouTube star MrBeast suggested he was invited to take a ride on the doomed OceanGate Titan vessel, but turned down the offer.\n\nIn a tweet, the YouTuber shared a text message indicating he was invited to go on what he described as \"the titanic submarine.\"\n\nHe didn't specify that it was the Titan and didn't clarify who the text was from. The screenshot appears to show a blue iMessage bubble, futher making it unclear who sent it.\n\n\"Also, I'm going to the Titanic in a submarine later this month. The team would be stoked to have you along,\" the message reads.\n\nMrBeast tweeted that he said no to the offer.\n\n\"Kind of scary that I could have been on it,\" tweeted the YouTuber, who has more than 160 million subscribers.\n\nRepresentatives for MrBeast didn't immediately respond to a request for comment from Insider.\n\nThe OceanGate Titan suffered a \"catastrophic implosion\" after descending to the site of the Titanic wreckage. All five passengers, including OceanGate CEO Sotckton Rush, are presumed to have died in the incident.\n\nOther prospective passengers have since shared how they turned down a trip in the sub, citing safety concerns.\n\nIn a Facebook post, Las Vegas financier Jay Bloom said he rejected a cut-price offer from Stockton Rush to join the doomed trip. Bloom said Rush tried to dismiss his concerns about safety.\n\nBritish actor Ross Kemp had also planned to shoot a documentary on the Titan, but the plan was scrapped after his production company deemed the sub \"not fit for purpose,\" his agent told BBC News.",
            "top_image": "https://i.insider.com/6498612cc218ba0019a803e5?width=1200&format=jpeg",
            "authors": "Ryan Hogg",
            "keywords": [],
            "publish_date": 1687964280,
            "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20veW91dHViZXItbXJiZWFzdC1jbGFpbXMtaGUtZGVjbGluZWQtaW52aXRhdGlvbi1nby1vbi10aXRhbmljLXN1Yi0yMDIzLTbSAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        },
        {
            "title": "MrBeast may be signing a League of Legends NACL team",
            "article_html": "<div><p>YouTube icon Jimmy &#8220;MrBeast&#8221; Donaldson is possibly joining fellow content creators by entering esports, more specifically League of Legends. </p>\n\n\n\n<p>League of Legends is looking like a hot ticket to content creators right now. Charles &#8220;MOistCr1TiKaL&#8221; White, who owns Moist Esports along with Ludwig Ahgren, is said to be looking into League of Legends after already having teams in Super Smash Bros. and Rocket League. Jeremy &#8220;Disguised Toast&#8221; Wang is also looking to <a href=\"https://win.gg/news/disguised-toast-looking-for-the-best-na-league-of-legends-players/\" target=\"_blank\" rel=\"noreferrer noopener\">put together a League of Legends team</a>. </p><p></p>\n\n\n\n<p>Now, MrBeast is thinking about throwing money into esports. </p>\n\n\n\n<h2 id=\"h-is-mrbeast-making-a-league-of-legends-team\">Is MrBeast making a League of Legends team? </h2>\n\n\n\n<p>MrBeast is reportedly eyeing the North American Challengers League (NACL). This is the second tier under the LCS. It&#8217;s been quite tempting for content creators looking to get into esports since most LCS franchises decided to drop out of the NACL when Riot Games <a href=\"https://win.gg/news/lcs-summer-split-delayed-for-two-weeks-as-riot-shuts-down-lcspa-requests/\" target=\"_blank\" rel=\"noreferrer noopener\">removed the requirement</a>. </p>\n\n\n\n<p>With so many slots open, content creators are hoping to make their own teams to compete in the NACL. And the latest is allegedly MrBeast. </p>\n  <p></p>\n  \n\n\n\n<p>MrBeast is no stranger to the League of Legends scene. He has talked about it before, including stating that he planned to buy a slot in the LCS when he appeared on the Worlds 2022 broadcast. At the time, he said the question is &#8220;when&#8221; he will do it rather than if. Considering his eye-popping videos, <a href=\"https://win.gg/news/disguised-toast-may-leave-valorant-drops-dsg-team/\" target=\"_blank\" rel=\"noreferrer noopener\">the financial concerns</a> preventing other content creators from joining esports shouldn&#8217;t be a problem. </p>\n\n\n\n<p>100 Thieves veteran Yiliang &#8220;Doublelift&#8221; Peng talked about MrBeast&#8217;s possible LCS team earlier this year, stating that it would be &#8220;really good&#8221; for the scene. Others echoed this sentiment when TSM sold their LCS slot, opening up the possibility even more. </p>\n\n\n\n<p>But it looks like MrBeast is eyeing the NACL instead. Only time will tell if this becomes a reality. </p>\n<p class=\"wpra-call-to-action\">What do you think?</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                <p class=\"wpra-flying\"> </p>                    <p class=\"wpra-reaction-emoji-holder wpra-reaction-animation-holder\"></p>            <p class=\"wpra-reaction-label\"> </p>                    <p class=\"count-num\">0</p>                </div>",
            "text": "YouTube icon Jimmy “MrBeast” Donaldson is possibly joining fellow content creators by entering esports, more specifically League of Legends.\n\nLeague of Legends is looking like a hot ticket to content creators right now. Charles “MOistCr1TiKaL” White, who owns Moist Esports along with Ludwig Ahgren, is said to be looking into League of Legends after already having teams in Super Smash Bros. and Rocket League. Jeremy “Disguised Toast” Wang is also looking to put together a League of Legends team.\n\nNow, MrBeast is thinking about throwing money into esports.\n\nIs MrBeast making a League of Legends team?\n\nMrBeast is reportedly eyeing the North American Challengers League (NACL). This is the second tier under the LCS. It’s been quite tempting for content creators looking to get into esports since most LCS franchises decided to drop out of the NACL when Riot Games removed the requirement.\n\nWith so many slots open, content creators are hoping to make their own teams to compete in the NACL. And the latest is allegedly MrBeast.\n\nMrBeast is no stranger to the League of Legends scene. He has talked about it before, including stating that he planned to buy a slot in the LCS when he appeared on the Worlds 2022 broadcast. At the time, he said the question is “when” he will do it rather than if. Considering his eye-popping videos, the financial concerns preventing other content creators from joining esports shouldn’t be a problem.\n\n100 Thieves veteran Yiliang “Doublelift” Peng talked about MrBeast’s possible LCS team earlier this year, stating that it would be “really good” for the scene. Others echoed this sentiment when TSM sold their LCS slot, opening up the possibility even more.\n\nBut it looks like MrBeast is eyeing the NACL instead. Only time will tell if this becomes a reality.",
            "top_image": "https://win.gg/wp-content/uploads/2021/11/Squid-Game-MrBeast.jpg",
            "authors": "Olivia Richman",
            "keywords": [],
            "publish_date": 1687910097,
            "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd2luLmdnL25ld3MvbXJiZWFzdC1tYXktYmUtc2lnbmluZy1hLWxlYWd1ZS1vZi1sZWdlbmRzLW5hY2wtdGVhbS_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
            "summary": ""
        }
    ]
}
